test_facts = [
    {
        'name': 'poltava_battle',
        'label': 'Полтавская битва',
        'description': """
            '''Полта́вская би́тва''' — крупнейшее [[генеральное сражение]] [[Великая Северная война|Северной войны]] между [[русская императорская армия|русскими войсками]] под командованием [[Пётр I|Петра I]] и [[Швеция|шведской]] армией [[Карл XII|Карла XII]].

            [[Битва]] состоялась утром {{СС|8|июля|1709 год|27|июня}} (28 июня по шведскому календарю) в 6 [[верста]]х от города [[Полтава|Полтавы]] ([[Гетманщина]]). Разгром шведской армии привёл к перелому в Северной войне в пользу [[Русское царство|России]] и к концу господства [[Шведское великодержавие|Швеции]] в [[Европа (часть света)|Европе]].
            """,
        'info': """
            {{Вооружённый конфликт
                |конфликт    = Полтавская битва
                |часть       = [[Великая Северная война]]
                |изображение = [[Файл:Lomonosov_Poltava_1762_1764_small.jpg|380px|«Полтавская баталия». Фрагмент мозаики М. В. Ломоносова]]
                |заголовок   = «Полтавская баталия».<br />Фрагмент мозаики [[Ломоносов, Михаил Васильевич|М. В. Ломоносова]]
                |дата        = {{СС|8|июля|1709 год|27|июня}}а
                |место = близ [[Полтава|Полтавы]], [[Гетманщина]]
                |причина =
                |итог = Решительная победа русской армии
                |противник1 = {{Флаг Швеции (1562-1761)|25px}}[[Шведское великодержавие|Швеция]]<br />{{Флаг|Гетманщина}} [[Гетманщина|Войско Запорожское]]
                |противник2 = [[Файл:Flag of Russia.svg|border|20px|Флаг России]] [[Русское царство|Россия]]<br />{{Флаг|Гетманщина}} [[Гетманщина|Войско Запорожское]] (казаки И. Скоропадского)
                |командир1 = {{Флаг Швеции (1562-1761)|25px}}'''[[Карл XII]]'''<br />{{Флаг Швеции (1562-1761)|25px}}[[Реншильд, Карл Густав|К. Г. Реншильд]]<br />{{Флаг Швеции (1562-1761)|25px}}[[Левенгаупт, Адам Людвиг|А. Л. Левенгаупт]]<br />{{Флаг Швеции (1562-1761)|25px}}[[Роос, Карл Густав|К. Г. Роос]]<br />{{Флаг|Гетманщина}}[[Мазепа, Иван Степанович|И. С. Мазепа]]<br />[[Файл:Прапор В.З..png|border|20px]][[Кость Гордиенко|К. Гордиенко]]
                |командир2 = [[Файл:Flag of Russia.svg|border|20px|Флаг России]]'''[[Пётр I]]'''<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Шереметев, Борис Петрович|Б. П. Шереметев]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Александр Данилович Меншиков|А. Д. Меншиков]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Репнин, Аникита Иванович|А. И. Репнин]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Алларт, Людвиг Николай|Л. Н. Алларт]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Ренне, Карл Эвальд|К. Э. Ренне]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Баур, Родион Христианович|Р. Х. Баур]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Брюс, Яков Вилимович|Я. В. Брюс]]<br />{{Флаг|Гетманщина}}[[Иван Ильич Скоропадский|Скоропадский, Иван Ильич]]
                |силы1 = '''Общие силы'''<ref name="А. Васильев">А. А. Васильев. О составе русской и шведской армий в Полтавском сражении. Военно-исторический журнал. 1989. № 7.]</ref>:<br /><small>26 000 шведов (около 11 000 кавалерии и 15 000 пехоты), 1000 валашских гусаров, 41 орудие, около 2 тыс. казаков</small>
                ----
                '''Всего:''' около 37 000. 30 тыс. шведов, 6 тыс. казаков, 1 тыс. валахов.
                ----
                '''Силы в битве:'''<br />8270 пехоты, 7800 драгун и рейтаров, 1000 гусар, 4 орудия
                ----
                <small>Не принимали участия в сражении: казаки</small>
                |силы2 =
                '''Общие силы'''<ref name="А. Васильев"/>:<br /><small>около 37 000 пехоты (87 батальонов), 23 700 кавалерии (27 полков и 5 шквадронов), 102 орудия (по другим данным, 302 орудия<ref name="Кротов 300 лет">П. А. Кротов. Битва при Полтаве: к 300-летней годовщине. СПб., 2009.</ref>)</small>
                ----
                '''Всего:''' около 60 000 (по современным данным, 80 000<ref name="ReferenceA">Все войны мировой истории, по Харперской энциклопедии военной истории Р. Дюпюи и Т. Дюпюи с комментариями Н. Волковского и Д. Волковского. С-Петербург, 2004, книга 3, с.499</ref>). из них 8 тыс. казаков Скоропадского.
                ----
                '''Силы в битве:'''<br />25 000 пехоты, 9000 драгун и калмыков, ещё 3000 калмыков подошло к концу битвы
                ----
                <small>'''Гарнизон Полтавы:'''<br />4200 пехоты, 2000 казаков, 28 орудий </small>
                |потери1 = {{s|6700—9234 убитых и раненых,}}<br />2874 пленных во время сражения и 15−17 тыс. у Переволочны
                |потери2 = {{s|1345 убитых, 3290 раненых}}
                |общие потери =
                |примечание =
                }}
                """,
        'weight': 1,
        'coordinates': [49.3743, 34.3240],
        'start_date': '1709-07-08',  # 8 июля 1709 года
        'end_date': '1709-07-08',  # 8 июля 1709 года
        'text': """
            == Предыстория ==
            После [[Битва при Нарве|поражения русской армии при Нарве]] в [[1700 год]]у [[Карл XII]] возобновил [[военные действия]] против саксонского [[курфюрст]]а и польского короля [[Август II|Августа II]], нанося ему одно поражение за другим.

            Возвращение русских земель в [[Ингерманландия|Ингерманландии]], основание русским царём Петром I в устье Невы нового города-крепости Санкт-Петербург (1703) и успехи русских в [[Курляндия|Курляндии]] (1705) побудили Карла XII принять решение после разгрома [[Август II|Августа II]] вернуться к действиям против России и захватить [[Москва|Москву]]. В 1706 году Август II потерпел [[Сражение при Фрауштадте|тяжёлое поражение]] и [[Альтранштедтский мир|лишился короны Речи Посполитой]]. В июне 1708 года Карл XII начал поход против России.
            {{main|Русский поход Карла XII}}
            Пётр I понимал неизбежность наступления шведов в глубь России. После того как русская армия избежала [[Гродненская операция (1706)|разгрома под Гродно]] в 1706 году, вскоре после приезда царя 28 декабря 1706 года в польском городке [[Жолкиев]] состоялся военный совет. На вопрос, «''…давать ли с неприятелем баталии в Польше, или при своих границах''» — решено не давать (если такое несчастие случится, трудно учинить ретираду), «''и для того положено дать баталию при своих границах, когда того необходимая нужда будет; а в Польше на переправах, и партиями, так же оголожением провианта и [[фураж]]а, томить неприятеля, к чему и польские сенаторы многие в том согласились''»<ref name="Тарле">[http://militera.lib.ru/h/tarle2/index.html [[Тарле, Евгений Викторович|Е. В. Тарле]]. Северная война и шведское нашествие на Россию (1958)].</ref>.

            [[1708 год]] прошел в столкновениях шведской и русской армий на территории [[Великое княжество Литовское|Великого княжества Литовского]] (сражения [[Битва при Головчине|при Головчине]], [[Сражение при Добром|при Добром]], [[Бой у Раевки|Раёвке]] и [[Битва при Лесной|Лесной]]). Шведы в полной мере ощутили «оголожение» в [[провиант]]е и фураже, в чём немало способствовало крестьянство Белой Руси, которое прятало хлеб, корм для лошадей, убивало [[фуражир]]ов.

            Осенью 1708 года [[гетман]] [[Мазепа, Иван Степанович|И. С. Мазепа]] изменил Петру и принял сторону Карла, заверив его в союзнических чувствах населения Малороссии к шведской короне. Вследствие болезней и плохого обеспечения питанием и амуницией шведской армии необходим был отдых, поэтому шведы из-под Смоленска повернули на земли Малороссии, чтобы отдохнув там, продолжить наступление на Москву с юга<ref name="Тарле" />. Однако, зима для шведской армии оказалась тяжёлой, несмотря на то, что русская армия на землях Малороссии прекратила тактику «выжженной земли»<ref name=Artamonov>В. А. Артамонов [http://www.zlev.ru/index.php?p=article&nomer=25&article=1315 Полтавская битва и Восточная Европа], Журнал «Золотой Лев» № 213—214 — издание русской консервативной мысли.</ref>. Крестьяне Малой России, как и белорусы, с ненавистью встретили иноземцев. Они убегали в леса, прятали хлеб и корм для лошадей, убивали фуражиров. Шведская армия голодала.

            К тому моменту, когда армия Карла подошла к [[Полтава|Полтаве]], она потеряла до трети состава и насчитывала 35 тыс. человек. Стремясь создать выгодные предпосылки для наступления, Карл решает овладеть Полтавой, которая с фортификационной точки зрения казалась «лёгкой добычей».

            === Союзники — [[Запорожские казаки]] ===
            В октябре 1708 года Петру I стало известно об измене и переходе на сторону Карла XII гетмана Мазепы, который вёл с королём длительные переговоры, обещая ему, в случае прихода шведов на Малую Россию, до 50 тысяч казацкого войска, продовольствие и удобную зимовку<ref>Документальных свидетельств о деталях предварительных предложений Мазепы Карлу не сохранилось. Однако известно, что переговоры велись и довольно долго. По данным [[Таирова-Яковлева, Татьяна Геннадьевна|Т. Г. Таировой-Яковлевой]], он открылся своим приближённым {{сс3|17.09.1707}} года. Она приводит высказывание Мазепы, записанное его верным последователем писарем Орликом: «Я не желал и не хотел христианского кровопролития, но намеревался, придя в [[Батурин]] с шведским королём, писать к царскому величеству благодарственное за протекцию письмо, в нём описав все наши обиды…». Тем самым, планы привести Карла в Батурин существовали. Кроме того, в подписанном позднее договоре с Карлом Мазепа обязуется отдать ему как базу на время войны, помимо прочих городов, Батурин (который уже полностью сожжён и не подходит для этих целей). По всей видимости, само соглашение готовилось до [[Взятие Батурина|сожжения Батурина]].</ref>. {{сс3|28.10.1708}} года Мазепа во главе отряда казаков прибыл в ставку Карла.

            В ответ [[Меншиков, Александр Данилович|А. Д. Меншиков]] {{сс3|2.11.1708}} года [[Взятие Батурина|захватил и разорил Батурин]] — ставку гетмана. Кроме того, Пётр I амнистировал и отозвал из ссылки украинского [[полковник]]а [[Семён Палий|С. Палия]], пытаясь заручиться поддержкой казачества.

            {{OldStyleDate4|17|ноября||6}} в [[Глухов]]е был избран новый гетман — по настоянию Петра I им стал [[Скоропадский, Иван Ильич|И. И. Скоропадский]].

            В марте 1709 года на сторону шведов перешли казаки [[Запорожская Сечь|Запорожской Сечи]]. Направленный на юг русский кавалерийский отряд полковника Кемпбелла (3000 сабель) не смог перехватить запорожских казаков. {{OldStyleDate4|27|марта||16}} запорожцы перебили русский отряд в Царичанке и привели к шведам 115 пленных русских драгун, однако Кемпбеллу удалось прорваться на север.

            {{СС|22|апреля|1709 год|11}}а казаки (мазепинцы и запорожские) участвовали вместе со шведами в сражении против русских [[Сражение у Соколки|у Соколки]]. В ответ русский отряд полковника [[Яковлев, Пётр Иванович (военачальник)|П. И. Яковлева]] {{OldStyleDate4|27|апреля||16}} сжёг [[Келеберда (Полтавская область)|Келеберду]] (пощадив только церковь), {{OldStyleDate4|29|апреля||18}} — [[Переволочна|Переволочну]], затем крепости Старый и Новый Кодак. Наконец, {{OldStyleDate4|21|мая||10}} он подошёл к Сечи. Первый приступ был неудачен, но {{OldStyleDate4|25|мая||14}} подошла помощь от генерал-майора [[Волконский, Григорий Семёнович (1721)|Г. С. Волконского]] (полковник [[Галаган, Игнатий Иванович|И. Галаган]]), и Сечь была [[Запорожская Сечь#Уничтожение Запорожской Сечи (1709 год)|взята и уничтожена]].

            Разгром Запорожской Сечи поднял боевитость запорожцев отстоять свою свободу, и количество запорожцев при короле стало расти. Однако дисциплина казаков, по мнению шведов, оставляла желать лучшего: как любое нерегулярное войско, они были неустойчивы под огнём ядер и гранат. В траншеях под Полтавой «ночной обстрел необычайно большими гранатами заставил разбежаться запорожцев с работ, ибо они так боялись гранат и пушек, что готовы от них бежать на край света». Шведы использовали их для охраны пленных и на землекопных работах, выдавая каждому за день работы «по полкаролина» (по 10 копеек). При традиционно высокой самооценке запорожцев такое отношение вызывало у них недовольство<ref name="HistoryProblems">В. А. Артамонов. Осада Полтавы в 1709 году (по шведским источникам), Вопросы Истории, 2004-11-30VPI — № 11.</ref>.

            В итоге из многотысячного украинского казачества ([[Реестровые казаки|реестровых казаков]] насчитывалось 30 тыс., [[Запорожская Сечь|запорожских казаков]] — 10−12 тыс.) на сторону Карла XII перешли около 10 тысяч человек: около 3 тысяч реестровых казаков и около 7 тысяч запорожцев<ref name="А. Васильев" />. Но и те вскоре начали разбегаться из походного лагеря шведской армии. Таких ненадёжных союзников, которых осталось около 2 тысяч, король Карл XII не рискнул использовать в сражении и поэтому оставил их в обозе под присмотром 7 кавалерийских полков. В бою участвовал только небольшой отряд казаков-добровольцев.

            Пётр I, не вполне доверяя казакам нового гетмана И. И. Скоропадского, также не использовал их в битве. Для присмотра за ними он направил 6 драгунских полков под началом генерал-майора [[Волконский, Григорий Семёнович (1721)|Г. С. Волконского]].

            == Осада Полтавы ==
            Ещё находясь главными силами в Будищах, {{СС|13|апреля|1709 год|2}}а Карл XII произвёл рекогносцировку Полтавы, а {{СС|6|мая||25|апреля}} приказал генералу [[Спарре, Аксель|А. Спарре]] с 8 пехотными полками, артиллерийским полком и всем обозом перейти из Будищ под Полтаву, генералу [[Крейц, Карл Густав|К. Г. Крейцу]] с кавалерией — из Решетиловки перейти к Ворскле<ref name="Леер">Энциклопедия военных и морских наук под ред. Леера. Том 6. СПб. 1893.</ref>. Русский отряд [[Ренне, Карл Эвальд|К. Э. Ренне]] (7 тыс. кавалерии), направленный под Полтаву, принужден был отойти к главной армии<ref name="Лексикон">[[Военный энциклопедический лексикон]]. Часть 10. СПб. 1846.</ref>.

            {{СС|8|мая||27|апреля}} шведами под Полтаву направлен ещё один пехотный полк — Далекарлийский, на следующий день к Полтаве пришёл сам король. Шведское командование было настроено благодушно: Полтава не выглядела неприступной крепостью. В начале осады фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]] отметил: «''Неужели русские до такой степени безрассудны и станут защищаться?''»<ref name="Гилленкрок">[http://memoirs.ru/texts/Gillenkrok1844.htm [[Гилленкрок, Аксель|А. Гилленкрок]]. Сказание о выступлении его величества короля Карла XII из Саксонии и о том, что во время похода к Полтаве, при осаде её и после случилось / Пер. с нем., введ. и примеч. Я. Турунова // Военный журнал, 1844. — № 6. — С. 1—105.]</ref> Два следующих дня (28 и 29 апреля) они пытались взять слабо укреплённый, по их мнению, город штурмом. После этих неудачных попыток {{СС|11|мая||30|апреля}} (1 мая по шведскому календарю) начаты осадные работы<ref name="Леер" />.

            [[Тарле, Евгений Викторович|Е. В. Тарле]] отсчитывает «борьбу у валов» Полтавы с {{СС|17|апреля||6}}, {{СС|26|апреля||15}} осада «стала крепкой», а на следующий день начался обстрел Полтавы из [[мортира|мортир]].

            Однако осада, порученная [[генерал-квартирмейстер]]у [[Гилленкрок, Аксель|А. Гилленкроку]], шла медленно и производилась небольшим числом войск (преимущественно запорожцами, что не прибавляло им энтузиазма: принуждение к лопате и кирке они сочли унижением). Кроме того, шведы не имели осадных орудий, только полевые<ref name="Лексикон" />. Под руководством полковника [[Келин, Иван Степанович|А. С. Келина]] её гарнизон в составе 4,2 тыс. солдат (Тверской и Устюжский солдатские полки и по одному батальону ещё от трёх полков — Пермского, Апраксина и Фехтенгейма) и 2,6 тыс. вооружённых горожан успешно отбил ряд штурмов.

            А. Гилленкрок сообщает, что один казацкий офицер, состоявший при Мазепе, рассказал ему, что подполковник Зильфергельм вел переговоры с казацким полковником [[Левенец, Иван Прокофьевич|Левенцом]], находившимся с русскими в Полтаве. Этот полковник хотел доставить шведам случай напасть врасплох на Полтаву. Но переговоры не имели успеха. Русское командование узнало про переговоры, арестовало и выпроводило из города казацкого полковника<ref name="Гилленкрок" />. Об измене полковника Полтавского казацкого полка Ивана Левенца сообщает и Тарле<ref name="Тарле" />.

            С апреля по июнь шведы предприняли 20 штурмов Полтавы и потеряли под её стенами более 6 тысяч человек<ref name="Леер" />.

            Гарнизон Полтавы к началу битвы составлял 2200 человек<ref name="Кротов Оборона Полтавской крепости">П. А. Кротов. Оборона Полтавской крепости. // ВИЖ и Цейхгауз. Спецвыпуск «300 лет Полтавской битве». 2009.</ref>.

            При этом помимо собственно гарнизона, на защиту Полтавы поднялось практически всё население города (в том числе женщины и дети), участвовавшее не только в строительстве укреплений, но и непосредственно в военных действиях. При этом отмечается твёрдое намерение горожан погибнуть при обороне, но не сдаться. Так например, в 20-х числах июня, когда шведы предпринимали последние отчаянные попытки штурма города, толпа горожан растерзала человека, заговорившего о сдаче<ref>{{Книга|автор = Тарле Е. В.|заглавие = Северная война: Северная война и шведское нашествие на Россию. Русский флот и внешняя политика Петра 1.|ответственный = |издание = |место = М.|издательство = АСТ:Астрель|год = 2011|страницы = 434-435|страниц = 701|isbn = 978-5-17-058044-6}}</ref>.

            == Попытки русских снять осаду ==
            В начале мая, вскоре после начала осады, к Полтаве подошёл [[Меншиков, Александр Данилович|А. Д. Меншиков]] с частью русской армии. Пытаясь помочь гарнизону Полтавы, он планировал атаковать окоп, прикрывающий осаждающих шведов, а с целью отвлечения противника направил против Опошни отряд генерал-лейтенанта [[Беллинг, Фёдор Иванович|Ф. И. Беллинга]]. Однако предпринятая {{СС|18|мая||7}} диверсия к [[Опошня|Опошне]] не удалась. Безуспешны были и другие действия по облегчению положения осаждённых (создание редута у моста через Ворсклу, строительство плотины). В то же время бригадир Алексей Головин сумел {{СС|26|мая||15}} провести в крепость 2 батальона (900 человек)<ref name="Леер" />. После этого гарнизон Полтавы стал вести себя активнее и предпринял ряд вылазок, в одной из которых А. Головин попал в плен<ref name="Куракин">[http://memoirs.ru/texts/KRSH_890.htm Б. И. Куракин. Русско-шведская война. Записки. 1700—1710 // Архив кн. Ф. А. Куракина. — Кн. 1. — СПб., 1890 — с. 291—328.]</ref>.

            {{СС|6|июня||26|мая}} под Полтаву прибыл [[Шереметев, Борис Петрович|Б. П. Шереметев]] с главной армией; таким образом, вся русская армия собралась у деревни Крутой берег в укреплённом лагере. Шведы противопоставили русским свою линию укреплений, усиленную на флангах редутами. Все их штурмы по-прежнему успешно отбивались осаждёнными.

            Для ослабления противника русские отряды совершали частые нападения на его расположение. Наиболее значительное произведено генерал-лейтенантом [[Гейнскин, Иоганн|И. Гейнскином]] (6 драгунских полков = 2500 сабель и Астраханский пехотный полк) на деревню [[Старые Санжары]], где содержались русские пленные, взятые в [[Веприк (Гадячский район)|Веприке]]. В результате шведы были разбиты, 1200 русских пленных освобождены. У неприятеля были взяты 2 орудия и 8 знамен, потери русских — 60 убитых и 181 раненых.

            == Переправа русской армии через Ворсклу ==
            {{СС|15|июня||4}} в русскую армию под Полтавой прибыл [[Пётр I]]. Вскоре на военном совете было принято решение переправляться через Ворсклу. Однако грозы и наводнение сорвали замыслы царя: попытка переправы в месте укреплённого лагеря через трудно проходимые болота {{СС|24|июня||13}} не удалась.

            Тогда {{СС|26|июня||15}} Пётр решил перейти Ворсклу в другом месте; на военном совете решили «''город Полтаву выручить без генеральной баталии (яко зело опасного дела)''»<ref name="Артамонов два полководца">[http://www.russkie.org/index.php?module=fullitem&id=15878 В. Артамонов. Два полководца в Полтавской битве.]</ref>. Однако уже на следующий день на новом военном совете Пётр решился дать Карлу XII генеральное сражение.

            Пётр I направил генерала [[Алларт, Людвиг Николай|Л. Н. Алларта]] подготовить переправу южнее Полтавы, а [[Ренне, Карл Эвальд|К. Э. Ренне]] с тремя полками пехоты и несколькими полками драгун — севернее, в район деревни Петровка, а также продолжил строительство плотины, начатой Меншиковым. Узнав о переправе русских через Ворсклу, Карл XII направил против Ренне фельдмаршала [[Реншильд, Карл Густав|К. Г. Реншильда]], а сам направился против Алларта. При [[Рекогносцировка (военное дело)|рекогносцировке]] {{СС|27|июня||16}} (17 июня по шведскому календарю), в свой день рождения, шведский король был ранен в ногу, после чего шведы возвратились в лагерь.

            {{СС|30|июня||19}} русская армия перешла к деревне Черняковка, к месту переправы, подготовленной генералом Ренне. На следующий день она перешла Ворсклу и стала укрепленным лагерем у деревень Петровка и Семёновка (в 8 верстах севернее Полтавы).

            {{СС|2|июля||21|июня}} шведское командование, получив ложное известие о начале русской атаки, построило свою армию в боевой порядок, а также предприняло очередной неудачный приступ к Полтаве. Вечером Карл отвёл пехоту к Крестовоздвиженскому монастырю, а фельдмаршал К. Г. Реншильд отвёл кавалерию на другую сторону Полтавы<ref name="Леер" />.

            Стремясь собрать как можно больше войск, Пётр I приказал гетману И. И. Скоропадскому и калмыкам [[Аюка]]-хана присоединиться к главной армии. {{СС|5|июля||24|июня}} казаки Скоропадского соединились с армией Петра; основные силы калмыков к сражению опоздали.

            {{СС|6|июля||25|июня}} русская армия перешла ближе к Полтаве и расположилась в новом укреплённом лагере у деревни Яковцы. Идя атаковать грозного противника, Пётр I при каждой остановке окапывается: возводит [[тет-де-пон]] (предмостное укрепление) у Петровки, создает укреплённый лагерь у Семёновки, другой южнее в 3 верстах, а также велел построить 6 редутов между Яковецким и Малобудищенским лесами. Всё это должно было уравновесить тактическое превосходство неприятеля в случае неожиданного нападения ранее 29 июня<ref name="Леер" />.

            В. Артамонов полагает, что [[ретраншемент]] имел форму неправильного многоугольника, как показано на первичных схемах генерала Л. Н. Алларта 1709 года и плане Я.Шварца, а не чёткой трапеции или прямоугольника, как потом вычерчивалось на всех «парадных» схемах. Он состоял, возможно, из четырёх бастионов и шести реданов, соединённых валами. Конницу расположили на открытом поле между Яковчанским и Малобудищенским лесом за шестью поперечными редутами. В лесу у Малых Будищ подрубили деревья и сделали завалы<ref name="Артамонов два полководца" />.

            Узнав через перебежчика о подходе к русским усиления в виде калмыцкой конницы и лишившись надежды получить собственное подкрепление (отказ турецкого султана вступить в войну против России и невозможность [[Станислав Лещинский|Станислава Лещинского]] и корпуса [[Крассов, Эрнст Дитлев фон|Крассова]] прийти на помощь из Польши), Карл XII решился ещё раз атаковать Полтаву ({{СС|3|июля||22|июня}}), а после неудачи штурма (который стоил шведам 1676 человек, русским — 278 убитых и 603 раненых<ref name="Леер" />) — дать русским генеральное сражение.

            {{СС|7|июля||26|июня}} Пётр вместе с генералитетом снова осматривал поле и неприятельский лагерь и принял ещё одно решение, повлиявшее на исход битвы — построить ещё 4 продольных редута посередине прохода между лесками у д. Малые Будищи и Малые Павленки. Строить их было приказано ночью, чтобы об этом не знал противник. Однако, к началу битвы были окончены лишь два из них<ref>{{Книга|автор = Е. В. Тарле|заглавие = Северная война: Северная война и шведское нашествие на Россию. Русский флот и внешняя политика Петра 1.|ответственный = |издание = |место = М.|издательство = АСТ:Астрель,|год = 2011.|страницы = 441|страниц = 701|isbn = 978-5-17-0580440-6}}</ref>.

            == План Карла XII на битву ==
            На военном совете шведского командования (кроме Карла XII, участвовали фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]], первый министр короля [[Пипер, Карл|К. Пипер]] и командир Далекарлийского полка полковник {{нп3|Сигрот, Густав Генрик фон|Сигрот|sv|Gustaf Henrik von Siegroth}}) было решено атаковать русскую армию. План включал два этапа и строился он на внезапности атаки и на убеждении, что русская армия, также как и в [[Битва при Головчине|битве при Головчине]], будет пассивна в наступлении и в основном будет обороняться<ref name="Энглунд">Энглунд П. [http://militera.lib.ru/h/englund_p/ Полтава: Рассказ о гибели одной армии.] — М: Новое книжное обозрение, 1995. — 288 с. ISBN 5-86793-005-X</ref>:
            * Шведская пехота ранним утром под прикрытием темноты неожиданно для противника начинает атаку и прорывается в тыл русских в пространстве между их редутами, устроенными между Будыщанским и Яковецким лесами. Затем следует удар шведской кавалерии по русской коннице, сосредоточенной за [[редут]]ами.
            * На втором этапе атаки шведы штурмуют русский опорный пункт ([[ретраншемент]]) и одновременно с этим их кавалерия охватывает его с севера, тем самым, обрезая пути отступления русским войскам, что в конце концов должно было привести к их полному разгрому.

            Этот план короля не был сообщён даже ближайшим лицам из главного штаба армии<ref name="Лексикон" />. Не все командиры уяснили его смысл: часть из них полагала, что речь идет о штурме редутов, другая — о проходе линии укреплений противника насквозь.
            [[Файл:Start of Poltava.gif|thumb |300px|right|Положение войск в начале битвы]]

            == Силы сторон ==

            === Шведская армия ===
            Карл XII располагал до 37 тыс. солдат (в том числе несколько тысяч реестровых и низовых запорожских казаков)<ref name="ReferenceA"/>. Оставив против Полтавы 2 полка с небольшим отрядом кавалерии и отрядив 4 поста кавалерии (2 тыс.) для занятия переправ через Ворсклу от Полтавы до Переволочной, у Карла XII осталось 26 батальонов пехоты, 22 полка кавалерии; всего 25 тыс. человек<ref name="Леер" />.

            Непосредственно в Полтавском сражении принимало участие около 8000 пехоты (18 батальонов), 7800 кавалерии (14 полков кавалерии и корпус [[драбант]]ов = 109 эскадронов) и около тысячи нерегулярной кавалерии ([[валахи|валахов]]).

            === Русская армия ===
            Русская армия насчитывала, по разным данным, от 60<ref name="А. Васильев"/> до 80 тыс. солдат<ref name="ReferenceA" />.

            Непосредственно в Полтавском сражении участвовали 25 тысяч пехоты, часть из которых, даже присутствуя на поле, не принимали участие в сражении.

            Русская кавалерия насчитывала около 21 тысяч человек (24 драгунских полка, 3 конно-гренадерских и 2 отдельных «шквадрона»)<ref name="Кротов кавалерия">П. А. Кротов. Численность русской кавалерии в Полтавской битве.</ref>. Кроме того, с русской стороны в бою участвовал небольшой отряд калмыков (единственные нерегулярные соединения, использованные Петром I непосредственно в сражении)<ref name=Artamonov />.

            === Артиллерия ===
            Карл XII располагал 41 орудием (30 пушек, 2 гаубицы, 8 мортир и 1 дробовик)<ref name="А. Васильев"/>, однако в сражении с шведской стороны участвовали только 4 орудия. Полагают, что шведы растратили все заряды при осаде Полтавы и остались без зарядов и пороха<ref name="Тарле" />.

            Энглунд пишет, что на вооружении артиллерийского полка под началом полковника Рудольфа фон Бюнова имелось 28 орудий: 16 3-фунтовых, 5 6-фунтовых, 2 16-фунтовые гаубицы и 5 6-фунтовых мортир. Однако план короля, предусматривающий скрытный подход и неожиданную атаку русского лагеря, исключал использование тяжёлой артиллерии, именно поэтому шведская артиллерия практически не использовалась в битве<ref name="Энглунд" />.

            Кроме того, для шведской армии того времени характерна недооценка артиллерии в бою; весь упор делался на мощную атаку [[каролины|каролинов]] сомкнутым строем.

            Напротив, Пётр I уделял огромное внимание артиллерии. В итоге в Полтавской битве превосходство русских в материальной части стало подавляющим. Энглунд описывает участие в бою 102 русских орудий; согласно исследованию П. А. Кротова, орудий в битве было 302<ref name="Кротов 300 лет" />.

            Часть русских орудий находилась в распоряжении воинских частей; артиллерийский полк (32 орудия) был рассредоточен между полками. Всей русской артиллерией командовал генерал-поручик [[Брюс, Яков Вилимович|Я. В. Брюс]].

            == Накануне ==
            Накануне сражения Пётр I объехал все полки. Его краткие патриотические обращения к солдатам и офицерам легли в основу знаменитого приказа, требовавшего от воинов биться не за Петра, а за «Россию и российское благочестие…»

            В свою очередь, воодушевляя солдат, Карл XII объявил, что завтра они будут обедать в русском обозе, где их ожидает большая добыча.

            == Ход битвы ==

            === Выдвижение шведской армии ===
            Около 23.00 накануне битвы спящих шведов разбудили и приказали строиться в колонны. Шведская пехота (18 батальонов под командованием генерала инфантерии [[Левенгаупт, Адам Людвиг|А. Л. Левенгаупта]]) построилась в 4 колонны: генерал-майоров [[Спарре, Аксель|А. Спарре]], [[Стакельберг, Берндт Отто|Б. О. Стакельберга]], [[Роос, Карл Густав|К. Г. Рооса]] и [[Лагеркруна, Андерс|А. Лагеркроны]].

            Шведская кавалерия построилась в 6 колонн; правым её флангом командовал генерал-майор [[Крейц, Карл Густав|К. Г. Крейц]], левым — генерал-майор [[Гамильтон, Хуго Юхан|Х. Ю. Гамильтон]]. Генерал-майор [[Шлиппенбах, Вольмар Антон|В. А. Шлиппенбах]] возглавил передовой кавалерийский отряд (12 эскадронов). Кавалерией командовал фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]]; ему же раненый король вверил общее командование на поле боя. Ещё 3 кавалерийских и 4 драгунских полка и 3 тыс. казаков оставлены для охраны лагеря и обоза<ref name="Энглунд" />.

            Однако шведы задержались с построением в колонны и выходом на исходные позиции. Только около 2 ч утра {{СС|8|июля||27|июня}} (28 июня по шведскому календарю) шведская армия двинулась вперёд. В итоге внезапность была утрачена.

            === Атака шведов на редуты ===
            Шведы вышли на поле перед русскими [[редут]]ами к рассвету. Шведская пехота атаковала русские редуты, а шведская кавалерия, проскакав между ними — русскую кавалерию, стоявшую лагерем на поле за редутами.

            Существуют разногласия относительно численности оборонявшихся в редутах русской пехоты: энциклопедии сообщают о двух батальонах Белгородского полка [[бригадир]]а [[Айгустов, Савва Васильевич|С. В. Айгустова]]<ref name="Лексикон" />. Энглунд сообщает, что в редутах находились Белгородский, Нечаевский и Неклюдовский пехотные полки (около 4000 человек, 14—16 3-фунтовых пушек и несколько более мощных орудий)<ref name="Энглунд" />, В. Артамонов — о шести пехотных полках (4730 чел.)<ref name="Артамонов два полководца" />.

            Шведам удалось быстро захватить два первых недостроенных редута. Пленных не брали. Однако третий редут взять с ходу не удалось.

            Тем временем русские [[драгун]]ы, выстроившись в боевой порядок, под командованием [[Меншиков, Александр Данилович|А. Д. Меншикова]] (в команде были также [[Ренне, Карл Эвальд|К. Э. Ренне]] и [[Баур, Родион Христианович|Р. Х. Баур]]) двинулись навстречу шведам. Общепринято, что в первой фазе битвы с русской стороны участвовало 17 драгунских полков (10 тыс. человек при 13 орудиях); П. А. Кротов считает, что здесь сражалась вся русская кавалерия (21 тыс.)<ref name="Кротов кавалерия" />.

            В. А. Молтусов подчёркивает, что кавалерийский бой произошёл на линии поперечных русских редутов, и что именно поддержка кавалерии позволила русским редутам выполнить своё предназначение<ref>[http://www.regiment.ru/Lib/A/39.htm В. А. Молтусов. Полтавская битва. Новые факты и интерпретация. — Автореф. дисс. … канд. наук. — М. 2002.]</ref>. Русская конница несколько раз отбила атаки шведской кавалерии, которая потеряла к концу боя 14 знамён и штандартов<ref name="Леер" />. Тогда Карл XII приказал шведской пехоте двинуться на помощь кавалерии сквозь линию редутов.

            Около 4 ч утра Пётр I приказал своей кавалерии отойти на главную позицию возле укреплённого лагеря. Однако Меншиков не подчинился приказу царя и, желая покончить с шведами у редутов, продолжил бой. Князь извещал, что разворачивать эскадроны, когда шведская конница находится рядом — опасно. Выдержать медленный темп отхода можно было только при поддержке пехоты. Пётр отказал в присылке пехоты, отозвал Меншикова и вручил командование [[Баур, Родион Христианович|Р. Х. Бауру]] (Ренне к этому времени уже был ранен), который стал повёртывать конницу. Случилось то, чего опасался Меншиков: всадникам пришлось почти 3 км отрываться полным галопом и проскочить мимо ретраншемента. Сложилось впечатление, что русская кавалерия побежала<ref name="Артамонов два полководца" />. Шведская кавалерия организовала преследование, однако К. Г. Реншильд вернул кавалерию назад, боясь оставить пехоту на поле боя без прикрытия.

            А шведская пехота (10 батальонов), пройдя линию редутов, оказалась прямо перед русским укреплённым лагерем, при этом Гренадерский батальон лейб-гвардии понёс большие потери от огня русской артиллерии<ref name="Энглунд" />. Левенгаупт уже собирался начать атаку, но был остановлен приказом отойти к Будищенскому лесу и ожидать возвращения кавалерии и отставшей пехоты.

            В это время ядро из русского ретраншемента разбило носилки Карла XII, но сам король не пострадал.

            Таким образом, в битве наступила пауза. В шведском лагере царило приподнятое настроение, приближённые поздравляли короля с победой. Шведы полагали, что осталось только добить русскую армию. Часть казаков гетмана И. И. Скоропадского собрались перейти на сторону шведов, но {{нп3|Вюртемберг, Максимилиан|принц Максимилиан Вюртембергский|de|Maximilian Emanuel von Württemberg-Winnental}} счёл не вправе решать этот вопрос без короля<ref name="Энглунд" />.

            === Разгром Рооса ===
            Проход линии [[редут]]ов привёл в расстройство шведскую пехоту. Особенно это касалось колонны генерал-майора [[Роос, Карл Густав|К. Г. Рооса]]: часть батальонов прошла линию русских укреплений вместе с остальной пехотой Левенгаупта, другая часть осталась штурмовать 3-й русский редут. К штурмующим присоединились батальоны соседних колонн. Всего в отряде Рооса оказалось 6 батальонов.

            Неподготовленный штурм 3-го редута шведами (не собираясь штурмовать укрепления, они не заготовили лестницы, фашины, канаты и другое необходимое снаряжение) привёл к большим потерям, особенно в офицерах. Погибли командир Далекарлийского полка полковник {{нп3|Сигрот, Густав Генрик фон|Сигрот|sv|Gustaf Henrik von Siegroth}} и командир Йончёпигского полка полковник фон Бухвальд, ранен командир Вестерботтенского полка полковник Гидеон Фок. Из 2600 человек в начале боя в отряде Рооса осталось к этому времени около 1500. Отказавшись от штурма редута, Роос приказал отойти к Яковецкому лесу, при этом он потерял из виду главные силы.

            Пётр I увидел отрыв части шведской пехоты от основных сил и отправил против неё 5 пехотных батальонов под началом генерал-лейтенанта [[Ренцель, Самуил|С. Ренцеля]] (Тобольский и Копорские полки двухбатальонного состава, а также батальон полка Феленгейма) и 5 драгунских полков генерал-лейтенанта [[Гейнскин, Иоганн|И. Гейнскина]].

            К отряду Рооса присоединилась кавалерия генерал-майора [[Шлиппенбах, Вольмар Антон|В. А. Шлиппенбаха]], игравшая в начале битвы роль передового отряда. Шлиппенбах отправился на поиск главной армии, но натолкнулся на русскую кавалерию и попал в плен. Это был первый пленный генерал шведской армии в Полтавской битве.

            Вскоре и Роос увидел перед собой окружавших его русских. После короткого, но жаркого боя остатки отряда Рооса (к этому времени 300—400 человек) бежали на юг через лес к шведским укреплениям у Полтавы. Здесь отряд укрылся в так называемом «Гвардейском шанце» и вскоре сдался на капитуляцию перед С. Ренцелем.

            === Построение армий перед решающим боем ===

            ==== Построение русской армии ====
            После преодоления линии русских редутов в сражении наступила пауза. Шведская армия приводила себя в порядок; её командование ожидало возвращения своей кавалерии и пехоты и ничего не знало о судьбе отряда Рооса.

            Царь Пётр, потеряв шведскую армию из виду и не зная замыслов шведов, начал выводить свои войска из ретраншемента: сначала для удержания линии обороны справа от укрепления (севернее) были поставлены в две линии 13 батальонов, слева (южнее) — 10 батальонов, также в 2 линии.

            Около шести часов утра Пётр вывел всю армию из лагеря и построил её в две линии, имея в центре пехоту под командованием генерал-фельдмаршала [[Шереметев, Борис Петрович|Б. П. Шереметева]] и генерала [[Репнин, Аникита Иванович|А. И. Репнина]], на левом фланге кавалерию генерала [[Меншиков, Александр Данилович|А. Д. Меншикова]], кавалерией правого фланга командовал [[Баур, Родион Христианович|Р. Х. Баур]] (до его прибытия кавалерией командовал бригадир [[Вейсбах, Иоганн Бернгард|И. Б. Вейсбах]]). Русской артиллерией командовал генерал-поручик [[Брюс, Яков Вилимович|Я. В. Брюс]]. В лагере был оставлен резерв из девяти пехотных батальонов (генерал-майор [[Гинтер, Иван Яковлевич|И. Я. Гинтер]]).

            И. Ф. Павловский представил следующий боевой порядок противоборствующих войск в решающей фазе сражения:
            {{цитата|Боевую часть составили 40 батальонов пехоты, 17 полков кавалерии и вся артиллерия, расположенные впереди и по флангам редута в следующем порядке: дивизия генерал-лейтенанта [[Голицын, Михаил Михайлович|князя Голицына]], в числе 12 батальонов и в составе пехотных полков [[Преображенский полк|преображенского]], [[Семёновский полк|семёновского]], [[Ингерманландский 9-й пехотный полк|ингерманландского]] и астраханского, расположились на правом фланге боевого порядка под прикрытием 11 полков кавалерии генерал-лейтенанта [[Баур, Родион Христианович|Бауера]]; в числе этих частей находился и самый старейший, ныне драгунский, полк, доблестный [[Нижегородский 17-й драгунский полк|нижегородский]]. Начальником правого фланга позиции был назначен генерал-фельдмаршал [[Шереметев, Борис Петрович|Шереметев]]. Генералы [[Вейсбах, Иоганн Бернгард|Вейсбах]], [[Отто Рудольф фон и цу Шауенбург|Шомбург]] и Бем и полковник [[Долгоруков, Василий Владимирович|кн. Долгоруков]] командовали различными частями боевой линии.

            В центре, в две линии, расположились 16 батальонов дивизии [[Репнин, Аникита Иванович|кн. Репнина]]. В составе первой линии вошли 2 батальона гренадер, два батальона киевского полка, два батальона нарвского, один шлиссельбургского, один новгородского и один [[Эриванский 13-й гренадерский полк|бутырского]]. В состав второй линии вошли два батальона белгородского полка и по одному батальону киевского, нарвского, шлиссельбургского, новгородского и бутырского пехотных полков. Начальником первой линии был назначен [[Айгустов, Савва Васильевич|бригадир Августов]], второй — бригадир [[Феленгейм, Иван Самуилович фон|Феленгейм]]. Участки позиции, распределенные между бригадирами Нечаевым, Левом и Полонским, находились под командой начальника центра — самого царя, объединявшего в то же время начальство над всеми войсками, находящимися на поле сражения.

            Кн. Репнин, оставаясь на позиции и руководя непосредственно действиями своей дивизии, получил еще назначение заменять Петра в случае его отсутствия и принять начальство над всей боевой линией, если бы Шереметев был убит.

            Левый фланг составили 12 батальонов дивизии генерала [[Алларт, Людвиг Николай|Алларта]] из полков гренадерского, псковского, сибирского, нижегородского, московского и фон Дельдина, под прикрытием 6 полков конницы генералов [[Волконский, Александр Григорьевич|князя Волконского]] и [[Беллинг, Фёдор Иванович|Беллинга]] и бригадира Бема, под общим начальством над всем левым флангом генерала от кавалерии [[Меншиков, Александр Данилович|князя Меншикова]]. Артиллерия расположилась между полками под общим начальством генерал-лейтенанта от артиллерии [[Брюс, Яков Вилимович|Брюса]].

            Из 9 батальонов, оставленных в лагере, три и части сборных команд, под начальством [[Головин, Иван Михайлович|полковника Головина]], направлены были для занятия полтавского Крестовоздвиженского монастыря с назначением войти в связь с гарнизоном крепости Полтавы<ref>[http://histpol.pl.ua/index.php/ru/?option=com_content&view=article&id=3707#02 И. Ф. Павловский. Полтавская битва 27 июня 1709 года // Типография И. А. Дохмана. Полтава. 1908.]</ref>.}}

            В решающей стадии битвы численность русской кавалерии составила 7709 «нижних чинов» на правом фланге и 4459 на левом (итого 12,168 человек)<ref name="Кротов кавалерия" />.

            ==== Построение шведской армии ====
            Фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]] не поверил, что русские выстроились для боя, и лично выехал чтобы удостовериться<ref name="Энглунд" />. Однако факт оставался фактом: русские изменили своей «пассивной тактике», стоившей им так дорого [[Битва при Головчине|при Головчине]].

            Не дождавшись подхода отряда Рооса, шведская пехота (10 батальонов пехоты; около 4000 человек) под началом генерала [[Левенгаупт, Адам Людвиг|А. Л. Левенгаупта]] выстроились в одну линию (справа налево):
            * 1-й батальон лейб-гвардии
            * Гренадерский батальон лейб-гвардии
            * Батальон Скараборгского полка
            * батальон Кальмарского полка
            * 2-й батальон лейб-гвардии
            * 3-й батальон лейб-гвардии
            * два батальона Уппландского полка
            * батальон Эстгётского полка
            * 2-й батальон Нерке-Вермландского полка
            Ещё два батальона Вестманландского полка под началом генерал-майора [[Спарре, Аксель|А. Спарре]] при поддержке драгун Нильса Ельма (Hielm) были направлены на поиск отряда Росса; позже они вернулись на поле боя.

            Кавалерия правого фланга (генерал-майор [[Крейц, Карл Густав|К. Г. Крейц]]; 52 эскадрона) из-за тесноты на поле боя стала не на фланге, а позади шведской пехоты.

            Кавалерией левого фланга по-прежнему командовал генерал-майор [[Гамильтон, Хуго Юхан|Х. Ю. Гамильтон]].

            Русские стояли так плотно, что разрывы между батальонами составляли около 10 м, причём в эти промежутки выкатывали выдвинутые в боевые порядки орудия. Стараясь построить собственную линию не меньше линии противника, шведы сделали разрывы между батальонами около 50 м. И всё равно русская линия (около 2 км) превосходила по длине шведскую (1,4—1,5 км).

            Однако шведское командование не смущало численное превосходство русских: оно делало упор на стремительную атаку [[Каролинская пехота|каролинов]], которая должна была опрокинуть армию противника и обратить в бегство. Кроме того, разница в широте линии могла компенсироваться преимуществом шведов в кавалерии.

            === Решающий бой ===
            [[Файл:King's colour Karl XII.jpg|thumb|300px|Личный штандарт [[Карл XII|Карла XII]], захваченный во время Полтавской битвы <small>([[Петропавловская крепость]], Комендантский дом, экспозиция «История Санкт-Петербурга — Петрограда. 1703—1918»)</small>]]
            В 9 часов утра линия шведской пехоты атаковала русскую пехоту. Шведы были встречены сначала артиллерийским огнём, затем противники обменялись ружейным огнём, после чего начали рукопашную схватку.

            Шведская кавалерия К. Г. Крейца поддержала атаку своей пехоты; 4 левофланговых русских батальона (Нижегородский и Гренадерский полки бригадира де Бука) вынуждены были стать в каре, но кавалерия А. Д. Меншикова атаковала шведов во фланг, расстроив их атаку.

            Воодушевляемое присутствием короля, правое крыло шведской пехоты яростно атаковало левый фланг русской армии. Под натиском шведов первая линия русских войск стала отступать. Напору противника поддались Казанский, Псковский, Сибирский, Московский (дивизии [[Алларт, Людвиг Николай|Л. Н. Алларта]]), а также Бутырский и Новгородский полки левого фланга дивизии [[Репнин, Аникита Иванович|А. И. Репнина]]<ref name="Энглунд" />. В передней линии русской пехоты образовался опасный разрыв боевого порядка: шведы штыковой атакой «опрокинули» 1-й батальон Новгородского полка, захватили свыше десятка русских орудий, некоторые из них они обратили против противника. Российская историография описывает подвиг царя Петра I, который вовремя заметил это, взял 2-й батальон Новгородского полка и во главе его бросился в опасное место. Прибытие царя положило конец успехам шведов и порядок на левом фланге был восстановлен.

            Пока правый фланг шведской пехоты прорывал фронт русской армии, её левый фланг даже не вступил в соприкосновение с русскими. Напротив, русская пехота правого фланга генерал-лейтенанта [[Голицын, Михаил Михайлович|М. М. Голицына]] (самые опытные, в том числе гвардейские полки) атаковала шведскую пехоту и обратила её в бегство. Кавалерия шведского левого фланга не успела поддержать собственную пехоту и вскоре сама была обращена в бегство, при этом командир Нюландского кавалерийского полка полковник Андерс Торстенссон погиб, а генерал-майор [[Гамильтон, Хуго Юхан|Х. Ю. Гамильтон]] попал в плен.

            Бегство пехоты шведского левого фланга обнажило центр боевых порядков. Русская пехота усилила напор на противника, а таявшая тонкая линия шведов сломалась, разрывы между батальонами достигли 100—150 м. Фланги русской армии охватили боевой порядок шведов. Шведы уже устали от напряжённого боя. Оба стоявших в центре батальона Уппландского полка были окружены и полностью уничтожены (из 700 человек к своим вышли только 14; погибли полковник Густав Шернхёк (Stiernhook) и подполковник Арендт фон Пост)<ref name="Энглунд" />. В бою погибли также полковники Карл Густав Ульфспарре (командир Скараборгского полка), Густав Ранк (командир Кальмарского полка) и Георг Юхан Врангель (командир 2-го батальона Нерке-Вермландского полка). Под натиском русских сил потерявшие строй шведы начали беспорядочное отступление, превратившееся к 11 часам в настоящее бегство.

            === Разгром ===
            Осознав неизбежность поражения, король под охраной [[драбант]]ов и кавалерии генерал-майора [[Крейц, Карл Густав|К. Г. Крейца]] покинул поле боя, при этом проходя назад через линию русских редутов (которые опять заняли русские) охрана короля понесла большие потери. Здесь погиб историограф короля [[Адлерфельд, Густав|Густав Адлерфельт]].

            Добравшись до обоза в Пушкарёвке (где находились около 7000 кавалерии и верные Карлу XII казаки), шведская армия начала приводить себя в порядок. Здесь к армии присоединились два полка, которые вели осаду Полтавы (при вылазке А. С. Келина против шведов убит командир Зёдерманландского полка полковник Габриэль фон Вайденхайм).

            Вечером шведская армия с королём направилась на юг, к переправе через Днепр. К Днепру был послан [[генерал-квартирмейстер]] [[Гилленкрок, Аксель|А. Гилленкрок]]. В [[арьергард]]е следовал отряд генерал-майора [[Крузе, Карл Густав|К. Г. Крузе]].

            На поле боя были взяты в плен (кроме генералов Шлиппенбаха, Рооса и Гамильтона) фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]], генерал-майор [[Стакельберг, Берндт Отто|Б. О. Стакельберг]], {{нп3|Вюртемберг, Максимилиан|принц Вюртембергский|de|Maximilian Emanuel von Württemberg-Winnental}}, командир Северо-Сконского драгунского полка полковник Густав Горн, командир Эстгётского полка полковник Андерс Аппельгрен, командир собственного драгунского полка полковник Нильс Юлленштерна. В руках русских оказались 137 знамён и штандартов. 1-й министр короля [[Пипер, Карл|Карл Пипер]] с двумя государственными секретарями были взяты вылазкой Полтавского гарнизона.

            Одна дивизия Алларта захватила 22 стяга, в том числе 6 знамён лейб-гвардии и 2 штандарта конногвардейцев и драгунов Ельма<ref name="Энглунд" />.

            Ещё звучали звуки боя, а Пётр I вновь построил свою армию и начал праздновать победу. Пленные шведские генералы были приглашены в праздничный шатёр; фельдмаршалу Реншильду и принцу Вюртембергскому были возвращены шпаги. За столом Пётр пил за верность и храбрость шведов и за здоровье своих учителей в ратном деле.

            === Преследование ===
            Уже вечером в день баталии царь Пётр отрядил в погоню 10 драгунских полков [[Баур, Родион Христианович|Р. Х. Баура]] и Семёновский лейб-гвардии полк [[Голицын, Михаил Михайлович|М. М. Голицына]], посаженный на лошадей. На следующий день в преследование включился [[Меншиков, Александр Данилович|А. Д. Меншиков]] с ротой лейб-шквадрона.

            Карл XII, пытаясь выиграть время, направил навстречу русским генерал-майора [[Мейерфельдт, Юхан Август|Ю. А. Мейерфельдта]] с посланием: министр Пипер наделялся правом вести переговоры о мире и об обмене военнопленными. Однако эта уловка задержала русских только на 2 часа.

            Вскоре остатки шведской армии были настигнуты русскими и блокированы у Переволочной. [[Капитуляция у Переволочны|Здесь на капитуляцию сдались]] 16 тысяч человек, в их числе 3 генерала (Левенгаупт, Крейц и Крузе), 11 полковников, 16 подполковников, 23 майора, 1 фельдцейхмейстер, 12 575 унтер-офицеров и рядовых, а также большое количество некомбатантов.

            Карл XII с Мазепой сумели бежать. Шведский король скрылся на территории [[Османская империя|Османской империи]] в [[Бендеры|Бендерах]]. Однако его отряд, направленный для установления связи со шведскими войсками в Польше генерала [[Крассов, Эрнст Дитлев фон|Крассова]], был разгромлен под Черновцами русским отрядом, а [[генерал-квартирмейстер]] [[Гилленкрок, Аксель|А. Гилленкрок]] попал в плен<ref>[http://www.battle.poltava.ua/russian/gyllenkrok.htm Полтавская битва. Аксель Юлленкрук.]</ref>.

            Вскоре после битвы начались многочисленные казни изменников-казаков<ref>П. Энглунд. Полтава: Рассказ о гибели одной армии. — М: Новое книжное обозрение, 1995. Глава 28. «Невозможно было взирать без слез»</ref>.

            == Потери сторон ==
            [[Файл:Church at Battelfield near Poltava.jpg|thumb|230px|Церковь на месте битвы]]
            Потери шведов в битве составили 9224 человека, в плен попали 2973 чел. (итого 12 197 чел.).

            Потери русских составили 1345 человек убитыми и 3290 ранеными. В [[Братская могила русских воинов павших в Полтавской битве|братской могиле под Полтавой]] «Погребены бригадир [[Феленгейм, Иван Самуилович фон|Феленгейм]], полковники Нечаев и Лов, подполковник Козлов, майоры Кропотов, Эрнст и Гельд, обер-офицеров 45, капралов и рядовых 1293, всего погребено 1345 человек».

            Ранение получили генерал-лейтенант [[Ренне, Карл Эвальд|К. Э. Ренне]], бригадир [[Полонский, Яков Васильевич|Я. Полонский]], 5 полковников, 11 штаб- и 94 обер-офицеров<ref name="Лексикон" />.

            == Итоги ==
            В результате Полтавской битвы армия короля [[Карл XII|Карла XII]] была настолько обескровлена, что уже не могла вести активных наступательных действий. Военное могущество Швеции было подорвано, и в [[Великая Северная война|Северной войне]] произошёл перелом в пользу [[Россия|России]]. На встрече с саксонским курфюрстом [[Август II|Августом II]] в [[Торунь|Торуни]] был вновь заключен [[Торуньский союзный договор|военный союз]] [[Саксония (курфюршество)|Саксонии]] с Россией. Датский король также вновь выступил против Швеции, причём теперь, благодаря приобретенному авторитету, России это не стоило ни денежных субсидий, ни посылки воинского контингента.

            === Награждения ===
            За одержанную победу были награждены не только военные, но и гражданские лица<ref name="Куракин" />:
            * [[Пётр I]] объявлен был «первым генерал-лейтенантом» и [[шаутбенахт]]ом «от синего флага».
            * Генерал-фельдмаршал [[Шереметев, Борис Петрович|Б. П. Шереметев]] одарён поместьями. Кроме него, поместья получили генералы [[Баур, Родион Христианович|Р. Х. Баур]], [[Голицын, Михаил Михайлович|М. М. Голицын]], [[Гейнскин, Иоганн|И. Гейнскин]] и [[Волконский, Григорий Семёнович (1721)|Г. С. Волконский]].
            * [[Меншиков, Александр Данилович|А. Д. Меншиков]] был наименован вторым [[генерал-фельдмаршал (Россия)|генерал-фельдмаршалом]].
            * [[Ренне, Карл Эвальд|К. Э. Ренне]] получил чин [[генерал от кавалерии|генерала от кавалерии]].
            * генералы [[Репнин, Аникита Иванович|А. И. Репнин]], [[Алларт, Людвиг Николай|Л. Н. Алларт]], [[Ренцель, Самуил|С. Ренцель]] и [[Брюс, Яков Вилимович|Я. В. Брюс]] награждены [[орден Святого Андрея Первозванного|орденом Святого Андрея Первозванного]]. Этим же орденом и чином тайного советника (геемрата) награждён князь [[Долгоруков, Григорий Фёдорович|Г. Ф. Долгоруков]].
            * [[Головкин, Гавриил Иванович|Г. И. Головкин]] получил чин [[канцлер]]а, [[Шафиров, Пётр Павлович|П. П. Шафиров]] — подканцлера (вице-канцлера), [[Мусин-Пушкин, Иван Алексеевич (1659)|И. А. Мусин-Пушкин]] — тайного советника (геемрата).
            * [[Верден, Николай Григорьевич|Н. Г. фон Верден]] стал генерал-лейтенантом.
            * Бук, Алексей Головин, [[Келин, Алексей Степанович|А. С. Келин]], [[Айгустов, Савва Васильевич|С. В. Айгустов]], [[Шидловский, Фёдор Владимирович|Ф. М. Шидловский]], [[Полонский, Яков Васильевич|Я. В. Полонский]], [[Долгоруков, Василий Владимирович|В. В. Долгоруков]], а позже [[Вейсбах, Иоганн Бернгард|И. Б. Вейсбах]] сделаны генерал-майорами.
            * [[Головин, Иван Михайлович|Иван Головин]], [[Чернышёв, Григорий Петрович|Г. П. Чернышев]], [[Бон, Герман Иоганн де|Г. Бон]], [[Кропотов, Гаврила Семёнович|Г. С. Кропотов]] и генерал-адъютант {{Нет АИ 2|[[Чириковы|Л. С. Чириков]]|28|02|2016}} произведены в [[бригадир]]ы.
            В честь битвы были выбиты [[Медаль «За Полтавскую баталию»|медали]] для всех офицеров и солдат, участвовавших в ней.

            === [[Триумф]] ===
            Пленные вначале содержались в крепости [[Ломоносов (город)|Ораниенбаум]], затем перевезены в [[Москва|Москву]], где {{СС|1|января|1710 года|21|декабря|1709 года}} прошли по улицам столицы при торжественном въезде Петра I. В этот день по русской столице провели огромное количество военнопленных — 22 085 шведов, финнов, немцев и других, взятых за 9 лет войны<ref>
            [http://www.russkie.org/index.php?module=fullitem&id=17343 В. Шестаков. «Полтавский парад» в Москве.]</ref>.

            Как утверждает историк [[Артамонов, Владимир Алексеевич|В. А. Артамонов]], ''«Полтавская победа была самым блистательным триумфом петровского времени. Пётр I законно гордился главной битвой своей жизни. „В свете неслыханная виктория“, „русское воскресение“, „начало нашего спасения и благополучия“ — так именовал он её»''<ref name="Павленко"/>.

            == Интересные факты ==
            * На поле битвы остались 22 представителя рода [[Врангели|Врангелей]].
            * 8 июля всех пленных шведов опрашивали на предмет поступления на службу царю. В русской армии сформировали два пехотных полка из шведских военнопленных (стояли в Астрахани и Казани). Драгунский полк из шведов участвовал в экспедиции [[Бекович]]а в Хиву в [[1717 год]]у.
            * Из 23 тысяч шведских военнопленных, взятых под Полтавой и Переволочной, лишь около 4000 снова увидели родину. В некоторых полках, которые начали военную кампанию с тысячным составом, возвратились домой около десятка человек. Ещё в 1729 году, через восемь лет после окончания войны и через двадцать лет после Полтавы, в Швецию продолжали приезжать бывшие пленные. Едва ли не самым последним среди них стал гвардеец Ханс Аппельман: он вернулся в 1745 году, после 36 лет плена<ref name="Энглунд" />.

            == Мифы Полтавской битвы ==
            Мифотворчество вокруг Полтавской битвы началось вскоре после её окончания. Литературной обработке подверглась речь Петра перед баталией. Так, известный текст: «''Воины! Вот пришёл час, который решит судьбу Отечества. Итак, не должны помышлять, что сражаетесь за Петра, но за государство, Петру вручённое, за род свой, за Отечество. А о Петре ведайте, что ему жизнь не дорога, только бы жила Россия, благочестие, слава и благосостояние её''», — скорее всего, имеет более позднее происхождение (возможно, обработан [[Феофан Прокопович|Феофаном Прокоповичем]]). Реальная речь была иной и более обыденной: «''Делайте, братия, так, как я буду делать, и всё, помощию Всевышнего, будет добро. За победою, после трудов, воспоследует покой''»<ref name="Анисимов">Е. Анисимов. Миф Великой Виктории. // Родина. № 7. 2009.</ref>.

            Пуля, попавшая Петру в шляпу, в мифе превратились в три пули, попавшие в шляпу, седло и нательный крест Петра (последнее призвано сакрализировать участие Петра в битве).

            Некоторые мифы были сотворены литератором середины XVIII века [[Крёкшин, Пётр Никифорович|П. Н. Крёкшиным]], который при описании истории Петра I дополнил известные факты собственными домыслами. Сочинения Крекшина были использованы И. И. Голиковым в своей истории Петра, откуда вымыслы перекочевали в научную историческую литературу, включая произведения [[Тарле, Евгений Викторович|Е. В. Тарле]] и современных историков. В числе мифов, созданных Крекшиным<ref>П. А. Кротов Сотворение Полтавской легенды // Родина. № 7. 2009.</ref>:
            * Про переодевание солдат Новгородского полка: будто бы Пётр I использовал тактическую уловку и незадолго до битвы переодел опытных солдат Новгородского пехотного полка в неокрашенную форму молодых. Карл XII, зная от перебежчика о том, что форма опытных бойцов отличается от формы молодых, повёл своё войско на молодых бойцов и попал в ловушку.
            * Про прорыв линии 1-го батальона Новгородского полка и спасение Петром баталии за счёт ввода в бой 2-го батальона. — В походном журнале Петра I указано, что вторая линия русской пехоты в бой не вступала.
            * Про торжественный въезд Петра I в Полтаву на следующий день после битвы и отдание им чести коменданту А. С. Келину. — Согласно походному журналу, царь въехал в Полтаву только в ночь на 30 июня, а наутро отбыл к Переволочной.
            * Участие 2,6 тысяч вооружённых горожан Полтавы в отражении осады не подтверждается ни русскими, ни шведскими источниками и также, скорее всего, является плодом фантазии Крекшина.

            == Карты ==
            {{external media
             |topic    =
             |subtopic =
             |width    =
             |image1   = [http://img.encyc.yandex.net/illustrations/bse/pictures/02013/811770.jpg Схема Полтавской битвы из БСЭ] Показаны действия русских войск с момента попытки освобождения Полтавы из-за Ворсклы и до окончания Полтавского сражения.
             |audio1   =
             |video1   =
            }}

            <center><gallery perrow=5 widths=160 heights=160 caption="Этапы Полтавской битвы по Шведской Википедии:">
            Файл:poltava_inledning.png|<small>Развертывание и наступление</small>
            Файл:poltava_skanslinjen1.png|<small>Первая атака на редуты</small>
            Файл:poltava_skanslinjen2.png|<small>Прорыв сквозь линию редутов - 1</small>
            Файл:poltava_skanslinjen3.png|<small>Прорыв сквозь линию редутов - 2</small>
            Файл:poltava_skanslinjen4.png|<small>Группа Рооса теряет контакт с основной армией</small>
            Файл:poltava_manövrer5.png|<small>Шведская армия сместилась на север. Группа Рооса разбита</small>
            Файл:poltava_slutstriden1.png|<small>Последующее сражение</small>
            Файл:poltava_slutstriden2.png|<small>Последняя атака</small>
            Файл:poltava_reträtten.png|<small>Отступление шведов</small>
            </gallery></center>

            == Память о событии ==
            [[Файл:Музей-заповедник Поле Полтавской битвы.jpg|thumb|260px|Музей-заповедник «Поле Полтавской битвы»]]
            Вскоре после победы, в декабре 1709 года, Пётр I заложил в [[Санкт-Петербург]]е [[Полтава (линейный корабль, 1712)|линейный корабль «Полтава»]] (позже имя «Полтава» носили ещё несколько боевых кораблей русского флота); в 1710 году там же в Санкт-Петербурге в честь битвы, состоявшейся в день святого Сампсония Странноприимца, построена Сампсониевская церковь (позже перестроена в [[Сампсониевский собор]]).

            К 25-летнему юбилею битвы в [[1735 год]]у в [[Петергоф]]е была установлена скульптурная группа «[[Самсон, разрывающий пасть льву]]», созданная по проекту [[Растрелли, Бартоломео Карло|Карло Растрелли]]. Лев ассоциировался со Швецией, герб которой содержит этого геральдического зверя.

            Само поле Полтавской битвы длительное время никак не отмечалось. Хотя Пётр распорядился построить на месте сражения мужской монастырь и воздвигнуть каменную пирамиду, однако в условиях военного времени ограничились деревянным крестом. Первый памятник на поле битвы построен частным лицом в [[1778 год]]у на месте гибели его отца<ref name="Анисимов" />. И только в [[1852 год]]у там же заложена [[Сампсониевская церковь]].

            Несмотря на то, что первое празднование победы под Полтавой в России состоялось уже в 1710 году, а с 1739 года день Полтавской битвы формально считался праздничным, отмечали его лишь эпизодически<ref name="kamensky"/>. Накануне войны с Турцией в [[1787 год]]у [[Потёмкин, Григорий Александрович|Г. А. Потёмкин]] устроил для [[Екатерина II|Екатерины II]] грандиозные манёвры на Полтавском поле, воспроизводя события битвы. Следующие «мемориальные манёвры» провёл император [[Александр I]] в [[1817 год]]у<ref>[http://histpol.pl.ua/ru/poltava-istoricheskie-ocherki/istoricheskie-ocherki/3856-zapiski-o-poltave-i-ee-pamyatnikakh В. Е. Бучневич. Записки о Полтаве и её памятниках. — Полтава. 1902.]</ref>. В 1812 году, во время [[Отечественная война|Отечественной войны]], он же в манифесте напомнил российской армии о победе под Полтавой<ref name="kamensky"/>.

            Крупное празднование было организовано к 200-летию Полтавской битвы в [[1909 год]]у: учреждена [[медаль «В память 200-летия Полтавской битвы»]], на месте битвы основан музей-заповедник «[[Поле Полтавской битвы]]» (ныне Национальный музей-заповедник), на территории которого построен музей, установлены памятники [[Пётр I|Петру I]], русским и шведским воинам, на месте лагеря Петра I и другие.

            При Советской власти о Полтаве надолго забыли. В [[1939 год]]у попытка отметить 230-летний юбилей ограничилась ремонтом памятников на поле битвы. Только в [[1950 год]]у был открыт музей истории Полтавской битвы; в 1981 году, при подготовке к 275-летию битвы, Полтавское поле объявлено государственным историко-культурным заповедником. Советская историография с конца 1930-х годов рассматривала Полтавскую битву в ключе пропаганды патриотизма и мифа о непобедимости России и русской армии, часто увязывая её со сражениями [[отечественная война 1812 года|Отечественной]] и [[Великая Отечественная война|Великой Отечественной войн]], а также с послевоенной советской национальной политикой; так, в официальном буклете музея, выпущенном в 1954 году, Полтавская битва характеризуется как «общая победа русского, украинского и белорусского народов» и, в частности, русской армии. При этом советское правительство запрещало контакты сотрудников заповедника со шведской стороной.<ref>Jörg-Peter Findeisen. Poltava — Mythos und Wirklichkeit. Einige kritische Anmerkungen zur bisherigen Darstellung dieser welthistorischen Schlacht durch die sowjetische Militärhistoriographie // Militärgeschichtliche Zeitschrift. — Bd. 51 (1992). — H. 1. — S. 1—2.{{Ref-de}}</ref><ref name="hausmann">[http://chtyvo.org.ua/authors/Guido_Hausmann/Poltava_2009_Deimperializing_an_Imperial_Site_of_Memory_anhl/ Guido Hausmann. Poltava 2009: Deimperializing an Imperial Site of Memory] // Harvard Ukrainian Studies. — Vol. 31. — No. 1/4: Poltava 1709: The Battle and the Myth. — PP. 657—677.</ref>

            10 февраля 1995 года был принят Федеральный закон Российской Федерации «О днях воинской славы и памятных датах России». Согласно ему среди дней воинской славы России — 10 июля — День победы русской армии под командованием Петра Первого над шведами в Полтавском сражении (1709 год).

            Есть противоположные мнения по поводу памяти Полтавской битвы. Так, по мнению историка [[Каменский, Александр Борисович|А. Б. Каменского]], несмотря на все усилия властей, битва в далекой [[Гетманщина|Гетманщине]] так и не заняла места в коллективной памяти русского народа. Историк отмечает, что даже мемуаров военных, участвовавших в Полтавской битве, не осталось, а оценивая эпоху Петра, российские мыслители XIX века (за исключением [[Вяземский, Пётр Андреевич|Петра Вяземского]], пытавшегося сделать слово «Полтава» символом всех российских военных побед) редко обращали внимание на Полтавскую битву<ref name="kamensky">[http://www.reenactor.ru/ARH/PDF/Kamenskiy_00.pdf Alexander Kamenskii. The Battle of Poltava in Russian Historical Memory // Harvard Ukrainian Studies. — Vol. 31. — No. 1/4: Poltava 1709: The Battle And The Myth (2009—2010). — PP. 195—204.]{{Ref-en}}</ref>.

            В свою очередь, историк [[Павленко, Николай Иванович|Н. И. Павленко]] писал: ''"Северная война на века сохранилась в народной памяти. От того времени осталось немало песен, посвященных отдельным эпизодам долголетней эпопеи… но центральное место среди них занимает Полтавская баталия… Выразительнее и лаконичнее всего происшедшее под Полтавой передает пословица, имеющая хождение и в наши дни: «Пропал, как швед под Полтавой»''<ref name="Павленко">Павленко Н. И., Артамонов В. А. 27 июня 1709 — М.: Молодая гвардия, 1989. — 270[2] с., ил.</ref>.

            Историк Гидо Хаусманн характеризует Полтаву как «имперское [[место памяти]]» для России, отмечая, что в концепции Полтавского историко-культурного заповедника украинская и шведская точки зрения представлены в недостаточной степени. В 2009 году, в день 300-летия битвы, состоялось торжественное открытие на месте сражения Ротонды примирения, увековечивающей память погибших в Полтавском бою солдат всех армий. Однако планы украинского правительства воздвигнуть рядом с памятником Петру I монументы Карлу XII и Ивану Мазепе посол РФ на Украине [[Черномырдин, Виктор Степанович|Виктор Черномырдин]] сравнил с гипотетическим памятником Гитлеру.<ref name="hausmann"/><ref name="gerner"/>.

            В шведской исторической памяти Полтавская битва характеризуется преимущественно положительно как ознаменовавшая окончание для Шведского королевства эпохи империализма и превращение Швеции в «обычное малое европейское государство»<ref name="gerner">Kristian Gerner. The Battle of Poltava as a Realm of Memory and a Bone of Contention // Harvard Ukrainian Studies. — Vol. 31. — No. 1/4: Poltava 1709: The Battle And The Myth (2009—2010). — PP. 679—693.</ref>.

            Русский мыслитель XIX века [[В. Г. Белинский]] высоко оценивал значение Полтавской битвы: «Россия громами Полтавской битвы возвестила миру о своем приобщении к европейской жизни, о своем вступлении на поприще всемирно-исторического существования»<ref> В. Г. Белинский Полное собрание сочинений: в 13 т. — М.: Изд-во АН СССР, 1953—1959.</ref>.""",
        'type': ['battle', 'сражение']
    },
    {
        'name': 'nishtadt_peace_treaty',
        'label': 'Ништадтский мир',
        'description': """
            '''Ништа́дтский мир''' ({{lang-sv|Freden i Nystad}}) — [[мирный договор]] между [[Русское царство|Русским царством]] и [[Шведская империя|Шведской империей]], завершивший [[Северная война|Северную войну]] 1700—1721 годов. Подписан {{OldStyleDate|10|сентября|1721 год|30|августа}}а в городе Ништадт (ныне [[Уусикаупунки]], [[Финляндия]]). Был подписан со стороны [[Русское царство|России]] [[Брюс, Яков Вилимович|Я. В. Брюсом]] и [[Остерман, Андрей Иванович|А. И. Остерманом]], со стороны [[Швеция|Швеции]] — [[Лилльенстедт, Юхан|Ю. Лилльенстедтом]] и [[Стрёмфельд, Отто Рейнхольд|О. Стрёмфельдом]] ({{lang-sv|[[:sv:Otto Reinhold Strömfelt|Otto Reinhold Strömfelt]]}}).

            Договор изменил русско-шведскую границу, ранее закреплённую [[Столбовский мир|Столбовским мирным договором]] от [[1617 год]]а. Швеция признала присоединение к России [[Лифляндия|Лифляндии]], [[Эстляндия|Эстляндии]], [[Ингерманландия|Ингерманландии]], части [[Карелия|Карелии]] (т. н. [[Старая Финляндия|Старой Финляндии]]) и других территорий<ref name="nis">[http://www.hrono.ru/dokum/1700dok/1721nishtadt.php Ништадтский мирный договор между Россией и Швецией. Русский текст.]</ref>. Россия обязалась уплатить Швеции денежную компенсацию и возвратить [[Финляндия|Финляндию]].

            Ратифицирован {{СС|20|сентября||9}}. 10 сентября [[1721 год]]а в [[Москва|Москве]] были устроены торжества по случаю Ништадтского мира. Победа в Северной войне выдвинула{{нет АИ|6|07|2015}} Россию в число крупнейших европейских государств.""",
        'info': None,
        'weight': 1,
        'coordinates': [60.4700, 21.2500],
        'start_date': '1721-09-10',  # 10 сентября 1721 года
        'end_date': '1721-09-10',  # 10 сентября 1721 года
        'text':
            """
                == История ==
            Победами русского оружия в конце Северной войны решили воспользоваться [[Англия]], [[Ганновер]], [[Нидерланды|Голландия]] и [[Дания]], заключившие союз с [[Пётр I|Петром I]] против Швеции. В действительности же Англия и Голландия не желали полного поражения Швеции и усиления России на [[Балтийское море|Балтике]]. Это привело к распаду коалиции и заключению [[4 августа]] [[1717 год]]у союзного договора с [[Франция|Францией]]: [[Париж]] обещал [[посредничество]] в переговорах с Швецией, истощённой до предела длительной войной. [[12 мая]] [[1718 год]]а открылся [[Аландский конгресс]] — на одном из [[Аландские острова|Аландских островов]]. Со стороны России переговоры возглавили [[Брюс, Яков Вилимович|Яков Брюс]] и [[Остерман, Андрей Иванович|Андрей Остерман]]. Однако, надеясь на помощь Англии, шведы всячески их затягивали. Кроме того, после гибели [[Карл XII|Карла XII]] в 1718 году к власти в Швеции пришла [[Реваншизм|реваншистская]] группировка королевы [[Ульрика Элеонора|Ульрики Элеоноры]], выступавшая за сближение с Англией и продолжение военных действий.

            В [[1719 год]]у под воздействием английской дипломатии была организована коалиция европейских государств против России. В её состав вошли [[Австрия]], [[Саксония (курфюршество)|Саксония]] и Ганновер. Англия обещала военную и финансовую помощь шведам. Переговоры на Аландском конгрессе были прекращены. В 1719 году русский флот [[Эзельский бой|победил шведов]] у острова [[Эзель]], а в [[1720 год|1720]] — у острова [[Гренгам]] ([[Сражение при Гренгаме]]). Англия вынуждена была отозвать свою эскадру из Балтики. В 1719—1720 годах были проведены [[Десанты на побережье Швеции (1719)|три успешных десантных операции]] на территории Швеции. Всё это вынудило шведов в мае 1721 года в Ништадте возобновить переговоры. 30 августа (по ст. стилю) 1721 года мирный договор был подписан.

            == Условия договора ==
            [[Файл:Летний сад-Скульптурная группа- (Мир и Победа. Ништадский мир) (До) (001).jpg|right|thumb|Скульптурная группа П.Баратта Ништадский мир (Летний сад, Петербург)]]
            [[Файл:Finland Russian&Sweden Border.png|250px|мини|справа|Карта Финляндии с указанием границ России и Швеции в разное время по договорам, а также по картам генерального штаба, Гермелина, Лоттера, Аф-Кнорринга и друг. Ордин, Кесарь Филиппович «Покорение Финляндии. Опыт описания по неизданным источникам». Том I. — СПб: Тип. И. Н. Скороходова, 1889]]
            Договор состоял из преамбулы и 24 статей. По договору Россия закрепила выход к [[Балтийское море|Балтийскому морю]]: к ней отошли часть Карелии к северу от [[Ладожское озеро|Ладожского озера]], [[Ингерманландия]] от Ладоги до [[Нарва (река)|Нарвы]], часть [[Эстляндия|Эстляндии]] с [[Таллин|Ревелем]], часть [[Лифляндия|Лифляндии]] с [[Рига|Ригой]], острова [[Сааремаа|Эзель]] и [[Хийумаа|Даго]]. За эти земли Россия выплатила Швеции компенсацию в 2 млн [[ефимок|ефимков]] (1,3 млн рублей). Предусматривался обмен пленными<ref name="bse2-30">Большая Советская Энциклопедия. Гл. ред. Б. А. Введенский, 2-е изд. Т. 30. Николаев — Олонки. 1954. 656 стр., илл. и карты; 52 л. илл. и карт.</ref>, амнистия «преступникам и перебежчикам» (кроме сторонников [[Мазепа, Иван Степанович|Ивана Мазепы]]). Финляндия возвращалась Швеции, которая также получила право ежегодно беспошлинно закупать и вывозить из России хлеба на 50 тыс. рублей. Договор подтверждал все привилегии, предоставленные остзейскому дворянству шведским правительством: дворянство сохранило своё самоуправление, сословные органы и т. д.

            Основные положения договора<ref>''Балязин В. Н.'' Неофициальная история России. — М.: Олма Медиа Групп, 2007. — ISBN 978-5-373-01229-4 </ref>:

            # Вечный и неразрывный мир между царём русским и королем шведским и их преемниками;
            # Полная амнистия с обеих сторон, за исключением [[Казачество|казаков]], последовавших за [[Мазепа|Мазепой]];
            # Все действия прекращаются в 14-дневный срок;
            # Шведы уступают во вечное владение России: [[Лифляндия|Лифляндию]], [[Эстляндия|Эстляндию]], [[Ингерманландия|Ингерманландию]], часть [[Карелия|Карелии]]<ref name="nis"/>;
            # Швеции возвращается [[Финляндия]];
            # Исповедание веры на данных территориях свободно.

            == Результаты ==
            Россия стала{{нет АИ|6|07|2015}} великой европейской державой, в ознаменование чего 22 октября ([[2 ноября]]) [[1721 год]]а [[Пётр I]] по прошению сенаторов принял титул '''Отца Отечества, [[Император Всероссийский|Императора Всероссийского]], Петра Великого'''.""",
        'type': ['peace_treaty', 'мирный договор']
    }
]

test_hist_regions = [
    {
        'name': 'russian_state',
        'label': 'Российское государство',
        'description': 'Российское государство в XV-XVII веке, от Ивана III до Петра I',
        'start_date': '1480-01-01',
        'end_date': '1721-11-02',
        'text': '',
        'shapes': [],
        'facts': [1,2]
    },
    {
        'name': 'russian_empire',
        'label': 'Российская империя',
        'description': 'Российская империя от Петра I до Февральской революции 1917г.',
        'start_date': '1721-11-02',
        'end_date': '1917-02-27',
        'text': '',
        'shapes': [],
        'facts': [2]

    },
    {
        'name': 'sweden_kingdom',
        'label': 'Королевство Швеция',
        'description': 'Королевство Швеция',
        'text': '',
        'start_date': '900-01-01',
        'end_date': None,
        'shapes': [],
        'facts': [1,2]
    }
]

test_hist_places = [
    {
    }
]

test_processes = [
    {
        'name': 'great_north_war',
        'label': 'Северная война',
        'description': """
            '''Северная война''' ('''Великая Северная война''', '''Двадцатилетняя война''') — война, длившаяся с [[1700]] по [[1721 год]] между [[Шведское великодержавие|Швецией]] и коалицией северо-европейских государств за обладание [[Прибалтика|прибалтийскими]] землями и закончившаяся поражением Швеции<ref name=autogenerated3>{{книга|автор=Robert Frost.|заглавие=The Northern Wars. War, State and Society in Northeastern Europe 1558—1721|издательство=Longman|год=2000|страниц=416|страницы=296—301|isbn=978-0-582-06429-4}}</ref>. С окончанием войны в Европе возникла новая империя — [[Российская империя|Российская]], имеющая выход в Балтийское море и обладающая мощной армией и флотом. Столицей империи стал [[Санкт-Петербург]]<ref name=autogenerated3 />, расположенный в месте впадения реки [[Нева|Невы]] в [[Балтийское море]].""",
        'start_date': '1700-2-22',
        'end_date': '1721-9-10',
        'text': """
            Первоначально войну Швеции объявил [[Северный союз]], созданный по инициативе курфюрста [[Саксония (курфюршество)|Саксонии]] и короля [[Речь Посполитая|польского]] [[Август Сильный|Августа II]]. В Северный союз вошли также [[Датско-норвежская уния|Датско-норвежское королевство]], возглавляемое королём [[Кристиан V|Кристианом V]], и Россия, возглавляемая [[Пётр I|Петром I]]<!--, причём Август II и Кристиан V в начале войны считали Россию своим младшим компаньоном --><ref>История русской армии. — М.: [[Эксмо]], 2007. — С. 38. — ISBN 978-5-699-18397-5</ref>{{sfn|Hughes|1998|страницы=26—27}}.

            В 1700 году после ряда быстрых шведских побед Северный союз распался, Дания вышла из войны в 1700 году, а Саксония — в [[1706 год|1706]]. После этого до [[1709 год]]а, когда Северный союз был восстановлен, [[Русское государство]] воевало со шведами в основном самостоятельно. На разных этапах в войне также принимали участие: на стороне России — [[Ганновер (королевство)|Ганновер]], [[Нидерланды|Голландия]], [[Пруссия (королевство)|Пруссия]]; на стороне [[Шведское великодержавие|Швеции]] — [[Англия]] (c [[1707 год]]а — [[Великобритания]]), [[Османская империя]], [[Гольштейн]]. Украинское казачество, включая [[Запорожские казаки|Запорожских казаков]], разделилось и частично поддерживало [[шведы|шведов]] и [[турки|турок]], но большей частью — русские войска{{sfn|Hughes|1998|страницы=36—38}}. [[Россия]] возвратила контроль над древними русскими землями ([[вотчина]]ми) в Прибалтике, утраченными в [[Смутное время]].

            == Причины войны ==
            [[Файл:Sweden 1658.jpg|thumb|320px|left|[[Шведская империя]] в конце XVII века]]
            {{кратное изображение|зона=right|направление=horizontal|заголовок=Главы государств [[Северный союз|Северного союза]]|зона_заголовка=center|фон_заголовка=|подпись=|зона_подписи=center|фон_подписи=|ширина=|изобр1=August II the Strong.PNG|ширина1=105|подпись1=[[Август Сильный|Август II]]|изобр2=Frederik den 4.jpg|ширина2=105|подпись2=[[Фредерик IV (король Дании)|Фредерик IV]]|изобр3=Jean-Marc Nattier, Pierre Ier (1717).jpg|ширина3=100|подпись3=[[Пётр I]]}}
            К концу XVII — началу XVIII века [[Шведская империя]] была господствующей державой на [[Балтийское море|Балтийском море]] и одной из ведущих европейских держав. Территория страны включала значительную часть побережья Балтики: всё побережье [[Финский залив|Финского залива]], современную [[Прибалтика|Прибалтику]], часть южного побережья Балтийского моря. В 1697 году Швецию возглавил пятнадцатилетний [[Карл XII]], и юный возраст монарха дал повод соседям Швеции — [[Датско-норвежская уния|Датско-норвежскому королевству]], [[Саксония (курфюршество)|Саксонии]] и [[Русское царство|России]] — рассчитывать на лёгкую победу и реализовать свои территориальные претензии к Швеции. Эти три государства образовали [[Северный союз]], инициатором которого был [[курфюрст]] Саксонии и король польский [[Август Сильный|Август II]], который хотел подчинить себе входящую в Швецию [[Ливония|Ливонию]] (Лифляндию), что позволило бы ему упрочить свою власть в [[Речь Посполитая|Речи Посполитой]]{{sfn|Hughes|1998|страницы=27}}. Ливония оказалась в руках Швеции по [[Оливский мир|Оливскому мирному договору]] [[1660 год]]а.

            Данию подталкивало к конфликту со Швецией давнее соперничество за господство на Балтийском море. В [[1658 год]]у [[Карл X Густав]] разбил датчан в ходе похода в [[Ютландия|Ютландию]] и [[Зеландия (остров)|Зеландию]] и отторг часть провинций на юге [[Скандинавский полуостров|Скандинавского полуострова]]. Дания отказалась от сбора пошлины при проходе судов через [[Зундский пролив]]. Кроме того, две страны остро соперничали за влияние на южного соседа Дании — герцогство [[Шлезвиг-Гольштейн]].

            Русский царь [[Пётр I]] последним присоединился к Северному союзу после переговоров с Августом, что было оформлено [[Преображенский договор|Преображенским договором]]. Территориальные претензии России к Швеции включали прежде всего [[Ингерманландия|Ингрию]] и [[Карелия|Карелию]], которые были отторгнуты Швецией в Смутное время по [[Столбовский мир|Столбовскому договору]] 1617 года, но распространялись и на земли Ливонии, о подвластности которых Руси в XI — начале XIII вв. помнили по летописям и считали их древними «отчинами» русских государей. В ходе [[Русско-шведская война (1656—1658)|войны 1656—1658 годов]] была сделана попытка возвратить эти земли, и русским войскам удалось временно оккупировать Ингрию и восточную часть Лифляндии: были захвачены [[Ниеншанц]], [[Нотебург]] и [[Динабург]]; была осаждена [[Рига]]. Однако возобновление войны с Речью Посполитой вынудило Россию подписать [[Кардисский мирный договор]] и вернуть Швеции все завоёванные земли.

            К началу Северной войны единственным портом, обеспечивающим Русскому государству торговые отношения с [[Европа|Европой]], был [[Архангельск]] на [[Белое море|Белом море]]; нерегулярная и тяжёлая [[навигация]] в Белом море осложняла торговлю, в дополнение к значительному отставанию в области [[Морской транспорт|мореплавания]] и [[судостроение|судостроения]].

            Получение выхода к [[Балтийское море|Балтийскому морю]] было для России важной экономической задачей.<ref>{{книга|автор=Покровский М.|заглавие=Русская история с древнейших времён|ответственный=Н. Никольский и В. Сторожев|год=1911|том=III|страницы=104—105}}</ref>

            Дополнительным фактором вступления России в войну послужило окончание войны [[Азовские походы Петра I|с Турцией]]. {{СС|14|июля|1700 год|3}} был заключён [[Константинопольский мирный договор (1700)|Константинопольский мирный договор]], {{СС|29|августа||18}} был объявлен окончательный мир с Турцией, а {{СС|30|августа||19}} Россия объявила войну Швеции. Одновременно был издан указ о конфискации всех шведских товаров, находящихся в Москве, в пользу русской казны, а шведский посланник в Москве был арестован<ref>{{статья|автор=Петров А.|заглавие=Нарвская операция|оригинал=|ссылка=http://www.memoirs.ru/texts/PetrovVS1872.htm|издание=Военный сборник|место=СПб.|издательство=Изд. Военного министерства Российской империи|год=1872|номер=7|страницы=5—38}}</ref>.

            Как повод для объявления войны, были указаны «неправды и обиды», в особенности личная обида 1697 года, когда Петра I, путешествующего по Европе, шведы холодно приняли в Риге{{sfn|Hughes|1998|страницы=28}}<ref>[http://www.memoirs.ru/texts/Dalberg_RA89K1V3.htm Рижский губернатор Дальберг в 1697 году не позволил русскому посольству, в котором инкогнито находился Пётр I, осмотреть укрепления Риги]</ref>. При этом территориальные притязания не упоминались<ref>''Петров А. В.'' [http://www.rusarch.ru/petrov1.htm Город Нарва, его прошлое и достопримечательности.] — СПб, 1901.</ref>:
            {{начало цитаты}}
            Изволили мы, великий государь, наше царское величество, с королевством свейским за многие их свейские неправды и нашим царского величества подданным учинённые обиды, наипаче за самое главное безчестие, учинённое нашим царского величества великим и полномочным послам в Риге в прошлом 1697 году, которое касалось самой нашей царского величества персоны, о чём свейским послам, на Москве будучим, ближний боярин наш Ф. А. Головин с товарищи в ответе говорили и на письме дали, а свейские послы о том до короля своего хотели донести и обнадёжили учинить за то над рижским генералом оборон; а после того на Москве живущий торговых дел королевского величества фактор иноземец Томас Книпер объявил с листа королевского величества, к нему посланного, список, в котором никакого удовольствования на оное предложение не учинено. И за тое Богом дарованную нам честь и за многие их свейския неправды и подданным нашим обиды указали мы, наше царское величество, всчать войну.
            {{конец цитаты}}

            == Начало войны ==

            === Карл XII ===
            18-летний шведский король [[Карл XII]], обладая выдающимся тактическим талантом<ref name="Тарле-7">''Тарле Е. В.'' Северная война и шведское нашествие на Россию. Глава II. Шведское вторжение в пределы России. Битва под Лесной. Начало народной войны против шведов, раздел 7</ref>, был «влюблён в войну»{{sfn|Hughes|1998|страницы=29—30}}, и с начала войны шведы быстро одержали череду важных побед. В то же время Карл XII оказался «совсем плохим политиком», поставив себе и своей армии цели, недостижимые при имеющихся в распоряжении шведов силах<ref name="Тарле-7" />.

            === Пётр I ===
            Его главный противник Пётр I оказался не только талантливым и проницательным дипломатом, но и высокоодарённым стратегом, полководцем и военным организатором. Несмотря на начальные неудачи, в итоге ему удалось добиться намеченных целей, во многом из-за ошибок самого Карла XII<ref>''Тарле Е. В.'' Северная война и шведское нашествие на Россию. Глава 1. Северная война до вторжения шведской армии в пределы России. 1700—1708 гг., раздел 3</ref>.

            === Датская кампания Карла XII ===
            {{main|Датская кампания Карла XII}}
            {{сс3|12.2.1700}} года войска [[Саксония (курфюршество)|Саксонии]] осадили [[Рига|Ригу]], однако, вопреки ожиданиям Августа II, ливонская знать не поддержала наступающих, и армии Августа успеха не добились<ref name=autogenerated2 />. В августе того же года датский король [[Фредерик IV]] начал вторжение в [[Гольштейн-Готторп|Гольштейн-Готторпское герцогство]] на юге страны. Однако 15 тысяч шведских солдат под руководством Карла XII неожиданно для датчан [[Высадка Карла XII на Зеландии|высадились]] под [[Копенгаген]]ом, и [[Датско-норвежская уния|Дания]] была вынуждена заключить {{СС|18|августа||7}} [[Травендальский мирный договор]] и отказаться от союза с [[Август Сильный|Августом II]].

            === Русский поход на Ингерманландию ===
            {{main|Битва при Нарве}}
            [[Файл:Victory at Narva.jpg|thumb|300px|«Победа шведов в битве при Нарве, [[1700]]». [[Сёдерстрём, Густаф|Густав Седерстрём]], 1910]]
            18 августа Пётр получил известие о заключении [[Константинопольский мирный договор (1700)|Константинопольского мирного договора]] с турками и {{СС|30|августа||19}}, ещё не зная о выходе Дании из войны, объявил войну [[Швеция|Швеции]], и {{СС|3|сентября||24|августа}} русские войска выступили с наступательным походом. Согласно союзному договору с Августом II России должна была отойти [[Шведская Ингерманландия|Ингерманландия (иначе «Шведская Ингрия»)]] — территория примерно соответствующая нынешней [[Ленинградская область|Ленинградской области]]. На границе между Ингерманландией и [[Шведская Эстляндия|Эстляндией]] находился крупный город и самая крупная шведская крепость в регионе — Нарва, которая стала основной мишенью русских командиров.

            Поход к Нарве был организован неудачно, под осень: солдаты систематически недоедали, лошади, перевозящие снаряжение, питались настолько плохо, что к концу похода начался их падёж, а кроме этого в связи с начавшимися дождями и плохим состоянием дорог у обоза регулярно ломались телеги. Пётр I планировал сосредоточить у Нарвы свыше 60 тыс. солдат, однако медленный темп продвижения войска к Нарве срывал сроки и планы царя. В конце концов осада Нарвы началась только {{СС|25|октября||14}} силами по разным оценкам от 34 тыс. до 40 тыс. солдат.<ref name="autogenerated2"/><ref>{{статья|автор=Великанов В. С.|заглавие=К вопросу об организации и численности русской армии в Нарвском походе 1700 года|ссылка=http://www.reenactor.ru/ARH/PDF/Velikanov_01.pdf|издание=Война и оружие: Новые исследования и материалы. Вторая Международная научно-практическая конференция, 18-20 мая 2011 года|место=Санкт Петербург|издательство=Вимаививс|год=2011|том=1|страницы=130—143|isbn=978-5-903501-12-0|язык=}}</ref>

            Осада Нарвы также была организована неудачно. Обстрел города из пушек оказался неэффективным в связи с тем, что русская армия использовала слишком лёгкие орудия, более того, боеприпасов хватило всего на две недели. Нарва фактически представляла собой сдвоенную крепость вместе с соседним [[Ивангород]]ом, и Пётр I, лично спланировавший осаду, вынужден был сильно растянуть русские войска, окружив одновременно обе крепости. Такое неудачное расположение русских войск впоследствии отрицательно сказалось на их боеспособности во время последующей битвы при Нарве.{{sfn|Hughes|1998|страницы=29—30}}{{sfn|Беспалов|1998|страницы=41—42}}

            Тем временем Август II, узнав о скором выходе Дании из войны, снял осаду [[Рига|Риги]] и отступил в [[Курляндия и Семигалия|Курляндию]], что позволило Карлу XII перебросить часть своего войска по морю в [[Пернов]] (Пярну). Высадившись там 6 октября, он направился к осаждаемой русскими войсками Нарве. Пётр I вместе с генерал-фельдмаршалом графом Головиным в ночь на 18 ноября покинул армию и отправился в Новгород. Высшее командование армией было поручено царём старшему в чине — иностранцу, герцогу [[Круа, Карл-Евгений|де Круа]]. {{СС|30|ноября|1700 год|19}}а войско Карла XII численностью 25 тысяч человек нанесло русскому войску численностью по разным оценкам от 34 до 40 тысяч человек тяжёлое поражение в сражении под Нарвой. Герцог де Круа со своим штабом, состоящим также из иностранцев, ещё до решающего момента сражения сдался Карлу XII. К {{СС|2|декабря||21|ноября}} основная часть русской армии, которая после всех потерь всё ещё превосходила по численности шведскую, по приказу герцога де Круа капитулировала.{{sfn|Беспалов|1998|страницы=43}} Стойко оборонялись от шведов [[Преображенский лейб-гвардии полк|лейб-гвардии Преображенский]] и [[Лейб-гвардии Семёновский полк|лейб-гвардии Семёновский]] полки, которые не только сами сумели избежать позорной капитуляции, но и прикрыли отход части русской армии, тем самым спасли её от полного разгрома. За мужество, проявленное в этой битве, солдаты полка в 1700—1740 гг. носили красные чулки (в память о том, что «в сей битве стояли они по колено в крови»). Результаты кампании для российской стороны были катастрофическими: потери убитыми, смертельно ранеными, утонувшими, дезертировавшими и умершими от голода и мороза составили от 8 тыс. до 10 тыс. человек, 700 человек, включая 10 генералов и 56 офицеров, попали в плен, было потеряно 179 из 184 пушек.{{sfn|Беспалов|1998|страницы=43}}{{sfn|Hughes|1998|страницы=30}}

            Среди причин поражения русской армии называют следующие: плохая подготовленность к войне (русская армия находилась в стадии реорганизации) с сильным противником; войска не умели воевать по правилам линейной тактики, вести разведку, были слабо вооружены; артиллерия была устаревшей и многокалиберной (на тот период в артиллерии существовало более 25 различных калибров, что во многом затрудняло снабжение артиллерии боеприпасами) и самое главное русская армия не имела своего национального командного состава, на всех основных командных должностях находились иностранные офицеры{{sfn|Hughes|1998|страницы=29—30}}{{sfn|Беспалов|1998|страницы=42}}.

            После этого поражения на несколько лет в [[Европа|Европе]] утвердилось мнение о полной небоеспособности русской армии, а Карл XII получил прозвище шведского «[[Александр Македонский|Александра Македонского]]». После поражения под Нарвой Пётр I ограничил количество иностранных офицеров в войсках. Они могли составлять лишь 1/3 от общей численности офицеров подразделения.

            Поражение под Нарвой сыграло огромную роль в развитии русской армии и истории страны. Как указывал историк [[Покровский, Михаил Николаевич|М. Н. Покровский]], все интересы России в войне сводились к торговле, к завоеванию выхода к морю и получению контроля над торговыми портами на Балтике. Поэтому Пётр с самого начала войны взял под особый прицел балтийские порты Нарву и Ригу, но потерпев сокрушительное поражение под Нарвой и будучи отброшен в район нынешнего Санкт-Петербурга, принял решение о строительстве нового порта и города в устье Невы — будущей столицы Российской империи.

            == Продолжение войны, 1701—1704 ==

            === Русская кампания ===
            [[Файл:Sw BalticProv ru.png|311px|thumb|Карта театра военных действий русской армии в Северной войне, 1701—1704]]
            После поражения под Нарвой, оценив причины поражения русских войск, [[Пётр I]] всю свою энергию направил на подготовку армии и страны к войне со Швецией. Именно в этот период создаётся новая регулярная армия, совершенствуется её организационная структура, система обучения и воспитания, появляется новое вооружение. При обновлении артиллерии сокращается количество калибров, их становится только 12. За короткий срок по приказу Петра I было отлито 300 новых орудий, причём часть орудий была изготовлена из изъятых в казну и переплавленных церковных колоколов.<ref>{{книга|автор=Николаев И. М., Барабанов В. В., Рожков Б. Г.|заглавие=История России с древнейших времён до конца XX века. Пособие для поступающих в ВУЗы|место=М.|издательство=Астрель|год=2003|страниц=308|страницы=71|isbn=5-17-016808-X}}</ref>

            Некоторые современные историки считают, что после поражения под Нарвой [[Пётр I]] предпринимал дипломатические усилия, чтобы прекратить войну. Высказывается мнение, что в 1701—1702 годах при посредничестве сначала австрийцев, а потом французского монарха [[Людовик XIV|Людовикa XIV]] Пётр I предлагал Карлу XII мирный договор, при котором Россия отказывалась от претензий на [[Прибалтика|прибалтийские]] земли, однако инициативы Петра I, якобы, остались без ответа — шведский король был настроен воинственно и после победы под Нарвой пренебрежительно относился к русской армии. В качестве дополнительной причины провала мирного договора указывается следующее соображение: правительства других стран Европы устраивало то, что воинственный король могущественной [[Шведская империя|Шведской империи]] посвятил себя войне с далёкой Россией, и в ближайшее время вряд ли обратит свой взор на Европу.{{sfn|Hughes|1998|страницы=30}}
            Стремление Петра I к заключению мира в 1701—1702 годах оспаривается{{Нет АИ|29|07|2013}}.

            В России шла подготовка к войне со шведами, Пётр I принимал меры по срочному восстановлению и строительству укреплений у [[Псков]]а, [[Великий Новгород|Новгорода]] и [[Москва|Москвы]]. Однако, вопреки ожиданиям, Карл XII принял решение о вторжении в [[Саксония (курфюршество)|Саксонию]] и [[Речь Посполитая|Польшу]]. На шведском военном совете часть генералов высказалась за наступление на Москву, но Карл XII посчитал, что русская армия слишком слабая, чтобы в ближайшие годы угрожать шведам на севере. Это решение дало Петру возможность восстановить силы после [[Битва при Нарве|поражения под Нарвой]] и возобновить наступательные действия на севере.{{sfn|Hughes|1998|страницы=30}}

            ==== Сражения в Ингерманландии, «Окно в Европу» ====
            {{Также|Битва при Эрестфере|Сражение при Гуммельсгофе|Осада Нотебурга (1702)|История Санкт-Петербурга}}
            [[Файл:Storm of Noteburg 1702.jpg|thumb|311px|«Штурм крепости [[Орешек (крепость)|Нотебург]] 11 октября [[1702 год]]а». [[Коцебу, Александр Евстафиевич|А. Е. Коцебу]], [[1846]]]]
            Воспользовавшись тем, что основные силы шведов приняли участие в сражениях в Саксонии и [[Речь Посполитая|Речи Посполитой]], [[Пётр I]] в [[1701 год]]у приказал начать новое наступление на севере. Но сначала русским войскам и патриотам удалось отбить шведское нападение на Архангельск [[25 июня]] [[1701]] в составе 1 яхты, 2 [[фрегат]]ов и 4 [[Линейный корабль (парусный)|линейных кораблей]] с десантом адмирала Шееблада (Шёблада). Благодаря героизму Ивана Седунова (Рябова) и Дмитрия Борисова, которые посадили на мель яхту и фрегат напротив недостроенной Новодвинской крепости и её шаутбенахту Сильвестру Иевлеву. [[Пётр I]] писал об этом Апраксину : «Зело чудесно…, нечаянное счастье… что отразили злобнейших шведов». Русские войска под командованием [[Шереметев, Борис Петрович|Бориса Шереметева]] вторглись в [[Шведская Ингерманландия|Шведскую Ингерманландию (Ингрию)]] и [[30 декабря]] [[1701 год]]а одержали свою первую на поле боя победу в Северной войне в [[Битва при Эрестфере|битве при Эрестфере]]. Шведской армией командовал генерал [[Шлиппенбах, Вольмар Антон|Шлиппенбах]]. В июле 1702 года русские войска одержали вторую победу над войсками Шлиппенбаха в [[Сражение при Гуммельсгофе|сражении у Гуммельсгофа]].{{sfn|Hughes|1998|страницы=30—31}}

            [[27 сентября]] [[1702 год]]а русские войска под командованием Шереметева осадили шведскую крепость [[Орешек (крепость)|Нотебург]], расположенную у истока [[Нева|Невы]] из [[Ладожское озеро|Ладожского озера]]. [[11 октября]] [[1702 год]]а русские войска пошли на штурм и одержали победу. Весной [[1703 год]]а, после недельной осады, русскими войсками была взята крепость [[Ниеншанц]] при впадении реки Охты в Неву.

            Таким образом, к началу [[1703 год]]а в руках русских оказалось всё течение Невы. Поселение Нотебург, построенное шведами на месте основанной ещё в [[1323 год]]у князем [[Юрий Данилович|Юрием Даниловичем]] крепости Орешек, Пётр переименовал в [[Шлиссельбург]] (ключ-город), а в устье Невы [[Пётр I]] {{СС|27|мая|1703 год|16}}а заложил новый город [[Санкт-Петербург]].

            ==== Сражения в Ливонии и Эстляндии ====
            {{main|Осада Дерпта (1704)|Осада Нарвы (1704)}}
            В [[1704 год]]у русские войска продолжили своё наступление. К концу 1703 года Россия контролировала почти всю территорию [[Шведская Ингерманландия|Ингерманландии]]. Русские войска под командованием [[Шереметев, Борис Петрович|Бориса Шереметева]] к лету 1704 года вошли в [[Ливония|Ливонию]] и осадили Дерпт. В июле 1704 года при личном участии Петра I крепость была взята.

            Летом 1704 года вторая группа русских войск под командованием [[Огильви, Георг Бенедикт|генерала Огильви]] вошла в [[Шведская Эстляндия|Эстляндию]] и [[Осада Нарвы (1704)|осадила Нарву]]. К концу лета после приезда Петра I из Дерпта и эта крепость была взята. Успешный штурм крепостей продемонстрировал возросшее мастерство и оснащённость русской армии.

            === Польская кампания ===
            {{Также|Сражение при Клишове|Битва при Пултуске (1703)}}
            Карл XII принял решение не продолжать активные военные действия против русской армии, а нанести основной удар по войскам [[Август Сильный|Августа II]]. Шведский король намеревался установить в [[Речь Посполитая|Польше]] власть выгодного ему монарха, сменив Августа II, чтобы превратить Речь Посполитую в [[Буферная зона|буферную зону]] между [[Шведская империя|шведами]] и [[Русское царство|русскими]]. В июле 1701 года шведские войска, не встретив серьёзного сопротивления, пересекли [[Западная Двина|Двину]] и заняли [[Ливония|Ливонию]].{{sfn|Hughes|1998|страницы=30}}

            Шведские войска вторглись на польскую территорию и нанесли несколько крупных поражений армии Августа II. В [[1702 год]]у была взята [[Варшава]], одержаны победы у Клишова около [[Краков]]а, в [[1703 год]]у — под Пултуском у [[Данциг]]а, взяты [[Торунь]] и [[Познань]]. Зиму 1703—1704 главные силы шведов провели в польской части Пруссии. Тем временем [[14 января]] [[1704 год]]а [[Варшавская конфедерация (1704)|часть депутатов сейма]] низложили Августа II в качестве короля Речи Посполитой. Летом 1704 года новым королём был провозглашен шведский ставленник [[Станислав Лещинский]].

            Действия [[Карл XII|Карла XII]] вызвали недовольство в Речи Посполитой. Собравшаяся в 1704 году [[Сандомирская конференция]] объединила сторонников Августа II и объявила о непризнании Станислава Лещинского королём.

            {{СС|30|августа||19}} 1704 года был заключён [[Нарвский договор]] между Россией и представителями [[Речь Посполитая|Речи Посполитой]] о союзе против Швеции; согласно этому договору Речь Посполитая официально вступала в войну на стороне Северного союза. Россия совместно с [[Саксония (курфюршество)|Саксонией]] развернула военные действия на польской территории.

            В [[1705 год]]у была одержана победа над войсками Лещинского у Варшавы. В конце 1705 года основные русско-польские силы под командованием короля Августа остановились на зимовку в [[Гродно]]. Вскоре король покинул расположение армии, сдав командование фельдмаршалу [[Огильви, Георг Бенедикт|Георгу Огильви]].<ref name=autogenerated2>Бой со шведами у местечка Клецка. Журнал С. И. Неплюева. 19 апреля 1706 г. // Русская старина. — 1891, октябрь. — С. 25—32.</ref> Неожиданно в январе [[1706 год]]а Карл XII выдвинул в этом направлении крупные силы. Союзники рассчитывали дать бой после подхода саксонских подкреплений. Но {{СС|13|февраля||2}} шведы нанесли сокрушительное поражение саксонской армии в [[битва при Фрауштадте|битве при Фрауштадте]], разбив вдвое превосходящие силы противника. Оставшись без надежды на подкрепление, русская армия была вынуждена отступить в направлении [[Киев]]а. Фельдмаршал Огильви сумел осуществить блестящий манёвр, воспользовавшись вскрытием рек. Король Карл, не ожидавший такого, только через две недели сумел собрать армию и выступить в преследование.{{sfn|Hughes|1998|страницы=28}} Ввиду весенней распутицы шведская армия застряла в Пинских болотах и король отказался от преследования армии Огильви. Вместо этого он бросил свои силы на истребление городов и крепостей, где находились польские и казацкие гарнизоны. В Ляховичах шведы заперли отряд переяславского полковника Ивана Мировича. В апреле 1706 года по приказу «Войска Запорожского обеих сторон Днепра гетмана и славного чина святого апостола Андрея кавалера» [[Мазепа, Иван Степанович|Ивана Мазепы]] к Ляховичам, для вызволения Мировича, посылается полк Семёна Неплюева, который должен был соединиться с миргородским полком Войска Запорожского полковника Даниила Апостола. В результате [[Бой у Клецка|боя у Клецка]] казацкая конница, поддавшись панике, растоптала пехоту Неплюева, и шведы смогли нанести поражение русско-казацким войскам. 1 мая Ляховичи сдались шведам.

            [[Файл:Карл XII и Герцог Мальборо.jpg|thumb|Встреча Карла XII и герцога Мальборо в Альтранштадте весной 1707 года]]
            Карл простоял с основными силами в Пинске около месяца, пережидая распутицу и подтягивая отставшие полки, затем в начале лета перевел свою армию в район Дубно-Луцк. Здесь, на незатронутой боевыми действиями и изобильной продовольствием Волыни, армия провела ещё месяц. Карл не последовал к Днепру за войсками Петра, а, опустошив Полесье, в июле 1706 года развернул свою армию против саксонцев. В августе армия короля перешла Вислу и соединилась с войсками Реншильда юго-западнее Варшавы. На этот раз шведы не остановились в Польше, а пройдя через австрийскую Силезию, в начале сентября вторглись уже на территорию самой [[Саксония (курфюршество)|Саксонии]]. {{СС|5|октября|1706 год|24|сентября}}а Август II втайне заключил [[Альтранштедтский мир|мирное соглашение]] со Швецией. По договору он отказывался от польского престола в пользу Станислава Лещинского, разрывал союз с Россией и обязывался выплатить контрибуцию на содержание шведской армии.

            Тем не менее, не решаясь объявить о предательстве в присутствии русской армии под командованием [[Меншиков, Александр Данилович|Меншикова]], Август II вынужден был со своими войсками участвовать в [[битва при Калише|сражении при Калише]] {{СС|29|октября||18}}. Битва закончилась полной победой русской армии и пленением шведского командующего. Это сражение стало крупнейшим с участием русской армии с начала войны. Но несмотря на блестящую победу, [[Российское царство|Россия]] осталась в войне со [[Швеция|Швецией]] в одиночестве.

            == Вторжение в Россию ==
            {{Нет ссылок в разделе|дата=12 мая 2011}}
            {{Основная статья|Русский поход Карла XII|битва при Головчине|Битва при Лесной}}
            [[Файл:Battle of Lesnaya.jpg|thumb|300px|«Сражение при Лесной» [[Натье, Жан-Марк|Жан-Марк Натье]], [[1717]]]]

            Весной 1707 года появились первые слухи о том, что [[Карл XII]] готовит свою главную армию, расквартированную в капитулировавшей [[Саксония (курфюршество)|Саксонии]] к походу на Россию. Выступление ожидалось в мае-июне. Однако Карл XII решил оказать дипломатическое давление на Австрию с целью выбить привилегии для шведской торговли в Германии и защитить права протестантов в Силезии. Австрийские войска в это время воевали на два фронта: против Франции и восставших венгров. При таких обстоятельствах тридцатитысячная шведская армия в десяти переходах от Вены была очень весомым аргументом и 31 августа Австрия подписала договор на шведских условиях.

            1 сентября 1707 года шведская армия выступила из Саксонии в направлении Польши. За 11 месяцев пребывания в Саксонии [[Карл XII|Карлу XII]] удалось восполнить потери и существенно укрепить свои войска. Перейдя Одер, Карл повел свою армию к Торуню, около которого в ноябре по льду перешёл Вислу. Обойденный с севера, Меншиков отступил от Варшавы к реке Нарев. Однако главные силы шведской армии совершили тяжелый переход по фактическому бездорожью через Мазурские болота и
            в феврале 1708 года вышли к Гродно. Русская армия снова без боя отступила уже к Минску. На этот раз измученная 500 км переходом шведская армия вынуждена была остановиться для пополнения запасов провианта и фуража, подтягивания отставших.

            === Летняя кампания 1708 ===

            В июне [[1708 год]]а шведы двинулись в направлении [[Смоленск]]а. Принято считать, что первоначально они планировали основной удар в направлении [[Москва|Москвы]]. Положение русских осложнялось тем, что [[Пётр I|Петру I]] не были известны планы противника и направление его движения.

            Планы Карла XII отчасти раскрылись в конце июня, когда главные силы шведской армии перешли Березину южнее Борисова, а Левенгаупт с огромным обозом вышел на юг из Риги.

            {{СС|14|июля|1708 год|3}}а Карл одержал победу в [[битва при Головчине|битве при Головчине]] над русскими войсками под командованием генерала [[Репнин, Аникита Иванович|Репнина]]. Это сражение стало последним крупным успехом шведской армии.

            Через три дня после победы под Головчином Карл XII занял Могилев и захватил переправы через Днепр.

            Дальнейшее продвижение шведской армии замедлилось. Стараниями Петра I были выжжены десятки белорусских селений, и шведам приходилось передвигаться по опустошённой местности, испытывая острый дефицит провизии.

            Простояв три недели у Могилева, шведская армия двинулась на юго-восток к Рославлю, чтобы обойти полосу опустошения перед Смоленском и создать угрозу с тыла русской армии, сосредоточенной у села Горки. Петр отвел армию к Мстиславлю. На реке Сож у Черикова Карл XII уперся в кавалерию Меншикова. Стало понятно, что за Сожем провиант достать не удастся.

            22 августа шведские войска повернули на северо-восток к Смоленску. Петр уводил пехоту и обозы на восток и северо-восток, а русская кавалерия все сильнее тревожила шведов. 30 августа у села [[Сражение при Добром|Доброе]] под угрозой разгрома оказался шведский авангард. А 9 сентября в стычке у [[Бой у Раевки|Раевки]] на волосок от гибели или плена был сам Карл XII.

            Шведской армии нужны были запас продовольствия на шесть недель и артиллерия, чтобы идти к Москве, а Левенгаупта с обозом или достоверных вестей о его местонахождении все не было.

            === Военный совет в Старишах, 11—13 сентября 1708 г. ===
            В этой крайней восточной точке движения шведской армии при вторжении в Россию, в небольшом смоленском селе состоялся военный совет короля с его генералами. Решался вопрос о дальнейшем движении шведской армии: через Смоленск прямо на Москву или на юг на Украину. Без тяжелой артиллерии осада или штурм укрепленного Смоленска выглядели бесперспективными. Движение по опустошенной местности на Москву без обоза Левенгаупта, который все не мог нагнать главные силы, грозило шведской армии голодной смертью. Вследствие болезней и плохого обеспечения питанием и амуницией, шведская армия нуждалась в отдыхе, поэтому, учитывая щедрые посулы Мазепы и его заверения в поддержке населения Украины, было выбрано движение на Украину<ref name="Tarle">''Тарле Е. В.'' [http://militera.lib.ru/h/tarle2/index.html Сочинения. Северная война и шведское нашествии на Россию. Т. 10, Гл. 2.] — М.: Изд-во АН СССР, 1959.</ref>.

            === Осеннее-зимняя кампания 1708—1709 ===
            [[File:15-07-05-Schloß-Caputh-RalfR-N3S 1712.jpg|thumb|left|200px|В 1709 г. короли Пруссии, Дании и Польши собрались в Потсдаме и заключили антишведский союз.]]
            Однако в Стариши шведский король привел только авангард. Главные силы оставались южнее в ожидании решения Карла. План обхода Смоленска с юга начал складываться у него, возможно, уже в Могилеве. Поэтому бросок от Доброго к Старишам можно считать последним отвлекающим манёвром перед решающим ударом. Да и Левенгаупт получил указание вести свой корпус не к Смоленску, а к Пропойску. Так или иначе, но уже 17 сентября царь Петр получил сведения, что шведы переходят Сож у Кричева и разведывают дороги на Стародуб и Почеп. На военном совете было принято решение разделить русскую армию: Шереметев уходил с главными силами параллельно армии шведского короля на юг к Брянску, Боур с конницей должен был тревожить тылы Карла XII, а Петр и Меншиков с наиболее мобильными частями отправлялись на поиск и перехват Левенгаупта.

            В начале октября шведский король с главной армией перешёл реку Ипуть и с разочарованием узнал, что русские его опередили. В Почеп, Мглин и Стародуб Шереметев ввел сильные гарнизоны, а извещенные о приближении шведов крестьяне с запасами на зиму и скотиной разбежались подальше от дорог по глухим лесам и болотам. Путь на Москву для шведской армии снова был перекрыт зоной опустошения, отбирать провиант и фураж было не у кого.

            {{СС|9|октября||28|сентября}} 1708 г. в [[Битва при Лесной|битве]] у деревни [[Лесная (Славгородский район)|Лесной]] войска Петра I разгромили корпус [[Левенгаупт, Адам Людвиг|Левенгаупта]], двигавшийся из [[Рига|Риги]], чтобы присоединиться к главной армии Карла. Это была не просто победа над отборными шведскими войсками — впервые была одержана победа над превосходящими силами противника. Царь Пётр назвал её «матерью Полтавской баталии». Петр Алексеевич лично командовал одной из двух колонн «летучего» корпуса русской армии — [[корволант]]а. Под его командованием находились Преображенский и Семёновский полки, батальон Астраханского полка и три драгунских полка. Другой колонной (левой) командовал генерал [[Меншиков, Александр Данилович|А. Д. Меншиков]]. Неприятельский корпус был настигнут близ деревни Лесной. Шведскому военачальнику пришлось принимать бой, который начался с атаки русских. Пётр I с приходом свежей драгунской конницы отрезал противнику дорогу на [[Славгород (Белоруссия)|Пропойск]] и усилил натиск на шведов. Вечером сражение прекратилось из-за наступивших сумерек и начавшейся вьюги, которая слепила глаза. Левенгаупту пришлось уничтожить остатки своего огромного обоза (бо́льшая часть его стала русской добычей), и остатки его корпуса, преследуемые русской кавалерией, сумели добраться до королевского походного лагеря.

            Общие потери шведов составили 8,5 тысяч убитыми и ранеными, 45 офицеров и 700 солдат попали в плен. Трофеями русской армии стали 17 орудий, 44 знамени и около 3 тысяч повозок с провиантом и боеприпасами. К королю генерал Левенгаупт смог привести всего лишь около 6 тысяч деморализованных солдат.

            После получения первых известий о неудаче под Лесной Карл XII приказал 10 октября выступить далее на юг в направлении Десны. Уже по пути к основной армии присоединились остатки корпуса Левенгаупта.

            В октябре 1708 года стало известно о переходе гетмана [[Мазепа, Иван Степанович|Ивана Мазепы]] на сторону Швеции. Гетман Мазепа состоял в переписке с Карлом XII и обещал ему, в случае прибытия на [[Украина|Украину]], 50 тысяч казацкого войска, продовольствие и удобную зимовку. [[28 октября]] [[1708 год]]а Мазепа во главе отряда [[Казаки|казаков]] прибыл в ставку Карла.

            Из многотысячного украинского казачества Мазепе удалось привести всего около 5 тысяч человек. Это было связано с тем, что Мазепа слишком медлил с оглашением своего решения народу. Пётр оказался более смекалистым и первым огласил о предательстве Мазепы. Поэтому гетмана поддержали только запорожцы. Впрочем, им так и не пришлось принять участие в битве под Полтавой, что тоже повлияло на исход боя.

            Вместо обильных припасов, которые Мазепа собрал в Батурине, шведская армия нашла там пепелище, так как Меншиков на три дня опередил авангард Карла XII, [[Взятие Батурина|взял Батурин]] и ускользнул от подходивших шведов, уничтожив все, что не смогли забрать его полки.

            Для полуголодной шведской армии оставался только один путь — все дальше на юг, в ещё не разоренные войной районы, где можно было в достаточном для армии количестве отбирать продовольствие у населения.

            17 ноября 1708 Карл XII с армией вошёл в Ромны, здесь впервые после Могилева шведы получили продолжительный отдых и нормальное питание. Тем временем Петр разместил свою ставку в Лебедине. Другая часть русской армии расположилась в Сумах.

            В середине декабря Карл XII решил взять инициативу в свои руки, отправив отдохнувшие войска на захват Гадяча. Почти всю зиму шведская армия провела в походе, потеряв тысячи солдат из-за лютых холодов и в бессчетных мелких стычках. 11 февраля сражавшийся в первых рядах наступавшей кавалерии король вновь оказался под угрозой плена, когда потесненный от Краснокутска Меншиков получил у Городно подкрепление и контратаковал шведов. После сражений у Краснокутска и Городно Карл XII двинул армию вновь на юг. 13 февраля, достигнув Коломака (83 км от Харькова), Карл приказал армии повернуть назад к Опошне на Ворскле, так как русские начали планомерно выдавливать шведские гарнизоны с Гетманщины, угрожая отрезать шведов от Днепра. В итоге, до наступления весенней распутицы ни навязать Петру генеральное сражение, ни открыть дорогу для наступления на Москву у Карла не получилось.

            Отрезанная от баз снабжения шведская армия к весне 1709 стала испытывать недостаток ручных гранат, пушечных ядер, свинца и пороха. Мазепа указал, что военные припасы, собранные на случай войны с Крымом или Турцией, в большом количестве находятся в крепости [[Полтава]].

            === Полтава ===
            {{Основная статья|Полтавская битва}}
            По приказу немецкой принцессы Мирославы Янколий XII были направлены полки в Россию. В ноябре на всеукраинской раде в городе Глухове был избран новый гетман — стародубский полковник [[Скоропадский, Иван Ильич|И. И. Скоропадский]].

            [[Файл:Poltava (Kotzebue).jpg|300px|thumb|«Полтавская битва», [[Коцебу, Александр Евстафиевич|А. Е. Коцебу]]]]
            Несмотря на то, что шведская армия сильно пострадала во время холодной зимы [[1708]]—[[1709 год]]ов, Карл XII жаждал генерального сражения.

            Весенняя распутица создала двухмесячную паузу в боевых действиях, во время которой шведы не смогли взять Полтаву несмотря на серьёзные потери (порядка 7 тысяч человек). 15 мая Меншикову удалось переправить подкрепления в осажденный город. Теперь в фактическом окружении оказалась уже шведская армия, из расположения которой осмелевшие казаки начали регулярно угонять пасшихся лошадей. Вскоре стало известно о поражении 13 (24) мая под Лядуховым двигавшегося к Днепру литовского гетмана [[Сапега, Ян Казимир|Яна Сапеги]] (сторонника Станислава Лещинского), что перечеркнуло надежды Карла XII на подкрепления из Польши.

            Почувствовав безынициативность обессилевших шведов, Петр в июне прибыл к войскам и отдал приказ готовиться к решающему бою. С 15 (26) июня по 20 июня (01 июля) русская армия осуществила переход на западный берег реки Ворсклы севернее Полтавы и начала сближение со шведской для завязки генерального сражения. Оно произошло {{СС|8|июля||27|июня}} 1709 г. близ [[Полтава|Полтавы]], где продолжал стоять Карл XII, тщетно ожидая помощи от турок или поляков.

            Русской армии, благодаря успешным действиям под Калишем и Лесной, удалось создать и закрепить подавляющее численное преимущество в людском составе и артиллерии. В армии Петра I было в общей сложности 40-50 тыс. человек и 100 пушек, а у Карла XII — 20-30 тыс. человек и 34 пушки при крайней ограниченности пороха и без каких-либо надежд на подход резервов. Превосходство русской армии было ещё более усилено тактически грамотным выбором поля боя (лес препятствовал широкому фланговому охвату, если бы шведы на него решились) и его заблаговременной фортификационной подготовкой — в форме буквы Т были построены редуты, огонь с которых поражал бы шведов с флангов и в лоб при попытке их обойти. Шведы вынуждены были брать редут за редутом, что не только уменьшало их силы, но и давало хуже управляемым главным силам русских время на безопасное боевое развёртывание<ref name="ReferenceA">Все войны мировой истории, по Харперской энциклопедии военной истории Р. Дюпюи и Т. Дюпюи с комментариями Н. Волковского и Д. Волковского. СПб., 2004. Кн. 3. С. 499</ref>

            После разгрома под Полтавой армия шведов бежала к Переволочной — местечку у впадения [[Ворскла (река)|Ворсклы]] в [[Днепр]]. Но переправить армию через Днепр оказалось невозможно. Тогда Карл XII вверил остатки своей армии Левенгаупту и вместе с Мазепой бежал в [[Очаков]].

            {{СС|11|июля|1709 год|30|июня}}а деморализованная шведская армия была окружена войсками под командованием [[Меншиков, Александр Данилович|Меншикова]] и капитулировала. На берегах Днепра у Переволочны русскому 9-тысячному отряду в плен сдались 16 947 деморализованных вражеских солдат и офицеров во главе с генералом Левенгауптом. Всего же в результате Полтавской битвы Швеция потеряла более 9000 человек убитыми и 18000 пленными, потери России составили 1345 человек убитыми и 3290 ранеными. Трофеями победителей стали 28 орудий, 127 знамён и штандартов и вся королевская казна.
            Испытанная в походах по Северной Европе королевская армия Швеции перестала существовать.

            Карл XII укрылся в [[Османская империя|Османской империи]], где старался убедить султана [[Ахмед III|Ахмеда III]] начать войну против [[Российское царство|России]].

            За участие в Полтавской битве государь Пётр I удостоил Меншикова, одного из героев разгрома королевской армии Швеции, званием генерал-фельдмаршала.

            == Военные действия в 1710—1718 годах ==
            {{Нет ссылок в разделе|дата=12 мая 2011}}
            После победы под Полтавой [[Пётр I|Петру]] удалось восстановить Северный союз. [[9 октября]] [[1709 год]]а в [[Торунь|Торуни]] был подписан новый союзный договор с [[Саксония (курфюршество)|Саксонией]]. А [[11 октября]] был заключён новый мирный договор с [[Дания|Данией]], по которому она обязалась объявить войну [[Швеция|Швеции]], а [[Российское царство|Россия]] — начать военные действия в [[Прибалтика|Прибалтике]] и [[Финляндия|Финляндии]].

            В ходе военной кампании [[1710 год]]а русской армии удалось малой кровью взять семь прибалтийских крепостей ([[Выборг]], [[Эльбинг]], [[Рига]], [[Дюнамюнде]], [[Пернов]], [[Кексгольм]], [[Ревель]]). Россия [[Капитуляция Эстляндии и Лифляндии|полностью заняла]] [[Эстляндия|Эстляндию]] и [[Лифляндия|Лифляндию]].

            В конце [[1710 год]]а Пётр получил сообщение о подготовке турецкой армии к войне с Россией. В начале [[1711 год]]а он объявил войну [[Османская империя|Османской империи]] и начал [[Прутский поход]]. Кампания окончилась полной неудачей. Пётр, по его собственному признанию, едва избежал пленения и разгрома своей армии. [[Россия]] уступила Турции [[Азов]] и Запорожье, разрушила укрепления [[Таганрог]]а и корабли на [[Чёрное море|Чёрном море]], то есть потеряла выход в Азовское море. Однако [[Османская империя]] не вступила в войну на стороне Швеции.

            Пётр трезво оценил ситуацию: «Сие дело есть хотя и не без печали, что лишиться тех мест, где столько труда и убытков положено, однакож чаю сим лишением другой стороне великое укрепление, которая несравнительно прибылью нам есть».

            В [[1712 год]]у действия партнёров по Северному союзу были направлены на завоевание [[Померания|Померании]] — владения Швеции на южном берегу [[Балтийское море|Балтики]] в северной [[Германия|Германии]]. Но из-за разногласий союзников существенных успехов добиться не удалось. По выражению Петра I, «кампания пропала даром».

            [[10 декабря]] [[1712 год]]а шведы под командованием фельдмаршала [[Стенбок, Магнус|Стенбока]] нанесли крупное поражение датско-саксонским войскам в [[сражение при Гадебуше|сражении при Гадебуше]]. Русская армия под командованием [[Меншиков, Александр Данилович|Меншикова]] не успела прийти на помощь союзникам. Русские войска прибыли в Германию в марте 1713 года. Под их натиском Стенбок отступил к городу Тенинген. Последовала осада, в результате которой, [[15 мая]] шведские войска капитулировали.

            В 1712—[[1713 год]]ах заметно активизируется создание флота на [[Балтийское море|Балтике]], начало которому было положено сразу после основания [[Санкт-Петербург]]а. [[Пётр I]] не только активно строит, но и поручает своим агентам в [[Лондон]]е и [[Амстердам]]е ([[Салтыков, Фёдор Степанович|Салтыкову]] и [[Куракин, Борис Иванович|князю Куракину]]) купить военные корабли. Только за [[1712 год]] было приобретено 10 военных кораблей и торговых судов. Параллельно парусному флоту открытого моря создаётся гребной флот, качественно отличный от гребных флотов других государств. Проект основного гребного корабля — скампавеи — был выработан путём сравнения генуэзских, венецианских, турецких и шведских проектов («маниров»). Лёгкая скампавея уступала по огневой мощи двухмачтовым галерам, но зато была лучше приспособлена к шхерам и, главное, ей не требовались ни каторжники, ни сложная техника гребли, когда на одном весле работало по 5 и более человек. Вместо этого посменно гребли солдаты, что на порядок повышало боеспособность гребного флота. Весь экипаж мог участвовать в походе, бою, абордаже и, наконец, в десанте. В отличие от парусных кораблей, строившихся по индивидуальным проектам и требовавших обученных экипажей (не только командиров, но и матросов поначалу приходилось нанимать за границей), скампавеи по итальянскому опыту строились поточным методом из стандартных деталей. Комплектовались в основном не матросами, а солдатами, что и позволило в короткое время поднять численность гребного флота. По сути в одном лице был создан шхерный флот и мобильная морская пехота, без чего не возможны были бы масштабные морские десанты заключительного периода войны.

            [[18 сентября]] [[1713 год]]а капитулировал [[Штеттин]]. Меншиков заключил с [[Пруссия|Пруссией]] мирный договор. В обмен на нейтралитет и денежную компенсацию Пруссия получила Штеттин, [[Померания]] была разделена между Пруссией и [[Голштиния|Голштинией]] (союзницей [[Саксония (курфюршество)|Саксонии]]).

            [[Файл:Bakua.jpg|thumb|300px|[[Гангутское сражение]]]]
            В этом же [[1713 год]]у русские начали финскую кампанию, в которой большую роль впервые стал играть русский флот. [[10 мая]] после обстрела с моря сдался [[Хельсинки|Гельсингфорс]]. Затем без боя был взят [[Брег]]. [[28 августа]] десантом под командованием [[Апраксин, Фёдор Матвеевич|Апраксина]] была занята столица Финляндии — [[Або]]. А 26—27 июля ([[6 августа|6]]—[[7 августа]]) [[1714 год]]а в [[Гангутское сражение|Гангутском сражении]] русский флот одержал первую крупную победу на море. На суше же, русские войска под командованием князя [[Голицын, Михаил Михайлович|Голицына]] нанесли [[Битва у реки Пялькане|поражение шведам у р. Пялькане]] (1713), а затем [[Битва при Лапполе|под с. Лаппола]] (1714).

            Высланный из [[Османская империя|Османской империи]] [[Карл XII]] в [[1714 год]]у вернулся в Швецию и сосредоточился на войне в Померании. Центром военных действий стал [[Штральзунд]].

            [[1 мая]] [[1715 год]]а в ответ на требование о возвращении Штеттина и других территорий [[Пруссия]] объявила Швеции войну. Датский флот одержал победу в [[сражение у Фемарна|сражении у Фемарна]], а затем у [[сражение у Бюлка|Бюлка]]. В плен попал шаутбенахт [[Вахтмейстер, Карл Ханс|Вахмейстер]], датчане захватили 6 шведских кораблей. После этого Пруссия и [[Ганновер (королевство)|Ганновер]], захвативший шведские владения [[Бремен]] и [[Ферден (Аллер)|Верден]], заключили с Данией союзный договор. [[23 декабря]] [[Штральзунд]] капитулировал.

            В [[1716 год]]у Карл XII [[Норвежский театр Северной войны|вторгся в Норвегию]]. [[25 марта]] была взята [[Осло|Христиания]], но штурм приграничных крепостей [[Хальден|Фредриксхальда]] и [[Фредрикстен]]а провалился. Когда в [[1718 год]]у Карл был убит, шведы были вынуждены отступить. Столкновения между датчанами и шведами на границе с [[Норвегия|Норвегией]] продолжались вплоть до [[1720 год]]а.

            == Заключительный период войны (1718—1721) ==
            {{Нет ссылок в разделе|дата=12 мая 2011}}
            В мае [[1718 год]]а открылся [[Аландский конгресс]], призванный выработать условия мирного договора между [[Российское царство|Россией]] и [[Швеция|Швецией]]. Однако шведы всячески затягивали переговоры. Этому способствовала и позиция других европейских держав: [[Дания|Дании]], опасающейся заключения сепаратного мира между Швецией и Россией, и [[Англия|Англии]], король которой [[Георг I (король Великобритании)|Георг I]] одновременно являлся правителем [[Ганновер (королевство)|Ганновера]].

            [[30 ноября]] 1718 года при осаде [[Халден|Фредриксхальда]] был убит [[Карл XII]]. На шведский престол вступила его сестра — [[Ульрика Элеонора]]. Позиции Англии при шведском дворе усилились.

            В июле [[1719 год]]а русский флот под командованием [[Апраксин, Фёдор Матвеевич|Апраксина]] провёл [[Десанты на побережье Швеции|высадку десантов в районе Стокгольма]] и рейды по пригородам шведской столицы.

            [[9 ноября]] Швеция подписала союзный договор с Англией и Ганновером. Последнему были уступлены [[Бремен]] и [[Ферден]]. <!-- В [[Балтийское море]] вышла английская эскадра [[Норрис, Джон|Норриса]] с приказом уничтожить русский флот.-->

            Весь 1720 год шведы подписывали в Стокгольме мирные договоры с противниками:
            * [[7 января]] был заключён мир с Саксонией и Речью Посполитой.
            * [[1 февраля]] Швеция помирилась с [[Пруссия (королевство)|Пруссией]] и окончательно уступила ей владения в [[Померания|Померании]].
            * [[14 июля]] шведы заключили мир с Данией, которая получила небольшие территории в [[Шлезвиг-Гольштейн]]е, денежную контрибуцию и возобновила сбор пошлины со шведских судов за проход через [[Эресунн|Зундский пролив]].

            Тем не менее, в 1720 году рейд на шведское побережье повторён в районе [[Мангден]]а, а [[27 июля]] гребным русским флотом была одержана победа над парусным шведским флотом в [[сражение при Гренгаме|сражении при Гренгаме]]. Шведский отряд (один 52-пушечный линейный корабль, 4 фрегата, несколько мелких судов, в бою не участвовавших) под прикрытием английской эскадры вышел в море чтобы перехватить и уничтожить русский гребной флот, занятый высадкой десантов. 61 русская скампавея и 29 лодок (в совокупности 52 пушки) под командованием генерала (не адмирала — специфика гребного флота) М. М. Голицына притворным отступлением заманили шведов в узкий пролив, после чего неожиданно бросились в атаку. При попытке развернуться 4 фрегата один за другим сели на мель и были взяты на абордаж после упорного 4-часового боя. Спастись удалось лишь линейному кораблю при помощи хитроумного манёвра — разворачиваясь, он отдал якорь, сразу лёгший на грунт, и тут же обрубил канат — развернуться удалось на месте. Шведы потеряли 103 человека убитыми и 407 пленными, русские — 82 убитыми и 246 ранеными. Кроме того, 43 скампавеи были так повреждены шведской артиллерией, что их не стали чинить, а сожгли сами русские — учитывая поточный метод строительства скампавей и приобретение 4 фрегатов, потеря не была серьёзной. Но главное — англичане, на глазах у которых 4 фрегата, имевшие в совокупности 104 орудия, были пленены, а линейный корабль близок к пленению, воочию убедились в бесполезности своего парусного флота против шхерного русского. Своего гребного флота англичане не имели, русская торговля на Балтике имела микроскопические размеры, иными словами, англичане не имели никаких перспектив оказать какое-либо давление на Россию, не ввязываясь в серьёзную войну на суше. Вскоре английская эскадра покинула Балтику. Гребной флот в первый раз после [[Битва при Лепанто|битвы при Лепанто 1571 года]] продемонстрировал своё стратегическое значение.

            [[8 мая]] [[1721 год]]а начались новые переговоры о мире с Россией в [[Ништадт]]е. [[30 августа]] был подписан [[Ништадтский мирный договор]].

            == Итоги войны ==
            {{Нет ссылок в разделе|дата=12 мая 2011}}
            Итоги войны неоднозначны и оцениваются по-разному. Ряд авторов указывает, что для разгрома Швеции, тем более в составе крупной коалиции (Дания, Саксония, Речь Посполитая), и обеспечения России выхода к Балтике вовсе не требовалось 20 лет. По словам историка [[Ключевский, Василий Осипович|В. О. Ключевского]], «Ништадтский мир 1721 г. положил запоздалый конец 21-летней войне, которую сам Пётр называл своей „троевременной кровавой и весьма опасной школой“, где ученики обыкновенно сидят по семи лет, а он, как туго понятливый школьник, засиделся целых три курса…»<ref>''Ключевский В. О.'' Курс русской истории. Лекция LXI</ref> Однако сам Пётр пояснял: «Все ученики науки в семь лет оканчивают обыкновенно, но наша школа троекратное время была. Однако ж, слава Богу, так хорошо окончилась, как лучше быть невозможно» и добавлял: «такого полезного мира [Россия] не получала. Правда, долго ждали, да дождались».

            [[Файл:МедальОкончаниеСевернойВойны.jpg|thumb|left|200px]]
            Большинство авторов признают, что она полностью изменила (в пользу России) соотношение сил на [[Балтийское море|Балтике]]; в то же время война не решила ситуацию на юге России (где ей противостоял союзник Швеции — Османская империя), которая к концу войны ухудшилась.

            По итогам войны к России были присоединены [[Ингерманландия|Ингрия]] (Ижора), [[Карелия]], [[Эстляндия]], Лифляндия ([[Ливония]]), основан [[Санкт-Петербург]]. Российское влияние прочно утвердилось и в [[Курляндия и Семигалия|Курляндии]]. Однако согласно Ништадскому договору указанные территории не были уступлены, а были проданы Швецией России за 2 млн [[Иоахимсталер|талеров (ефимков)]], что легло тяжёлым дополнительным бременем на страну.

            Была решена ключевая задача, поставленная [[Пётр I|Петром I]] — обеспечение выхода к морю и налаживание морской торговли с [[Европа|Европой]].

            Однако, в ходе войны Россия пережила серьёзный экономический и демографический кризис. Сумма налогов, собираемых с населения с 1701 по 1724 год (вследствие их увеличения), выросла в 3,5 раза, что, по словам историка [[Рожков, Николай Александрович|Н. А. Рожкова]], было достигнуто «ценою разорения страны»<ref>''Рожков Н. А.'' Русская история в сравнительно-историческом освещении (основы социальной динамики). — Л.—М.: Книга, 1928. Т. 5. — С. 161.</ref>. По результатам переписи населения 1710 года общая численность населения страны сократилась на 20 %, причём, в областях, прилегавших к основным театрам военных действий, сокращение населения достигало 40 %<ref>''Рожков Н. А.'' Русская история в сравнительно-историческом освещении (основы социальной динамики). Т. 5. — Л.—М.: Книга, 1928. — С. 127.</ref>.

            В историю Финляндии самый тяжёлый период войны с 1714 по 1721 год вошёл под названием ''[[Большая ненависть]]''. До заключения мира страна подвергалась многочисленным грабежам и насилию со стороны шведских и русских войск, что было нормой при ведении войны в XVIII веке.

            [[Швеция]] утратила своё былое могущество и превратилась во второстепенную державу. Были потеряны не только территории, уступленные [[Россия|России]], но и многие владения Швеции на южном берегу [[Балтийское море|Балтийского моря]] (в руках Швеции остались лишь Висмар и небольшая часть Померании).

            Прямым результатом катастрофической для Швеции Северной войны становится наступление ''[[Эра свободы|Эры свободы]]'', которая характеризуется урезанием власти короля и резким усилением парламента.
        """,
        'type': ['war', 'война'],
        'facts': [1,2],
        'hist_regions': [1,2,3],
        'hist_places': None,
        'subprocesses': None

    }
]
