test_facts = [
    {
        'name': 'poltava_battle',
        'label': 'Полтавская битва',
        'description': """
            '''Полта́вская би́тва''' — крупнейшее [[генеральное сражение]] [[Великая Северная война|Северной войны]] между [[русская императорская армия|русскими войсками]] под командованием [[Пётр I|Петра I]] и [[Швеция|шведской]] армией [[Карл XII|Карла XII]].

            [[Битва]] состоялась утром {{СС|8|июля|1709 год|27|июня}} (28 июня по шведскому календарю) в 6 [[верста]]х от города [[Полтава|Полтавы]] ([[Гетманщина]]). Разгром шведской армии привёл к перелому в Северной войне в пользу [[Русское царство|России]] и к концу господства [[Шведское великодержавие|Швеции]] в [[Европа (часть света)|Европе]].
            """,
        'info': """
            {{Вооружённый конфликт
                |конфликт    = Полтавская битва
                |часть       = [[Великая Северная война]]
                |изображение = [[Файл:Lomonosov_Poltava_1762_1764_small.jpg|380px|«Полтавская баталия». Фрагмент мозаики М. В. Ломоносова]]
                |заголовок   = «Полтавская баталия».<br />Фрагмент мозаики [[Ломоносов, Михаил Васильевич|М. В. Ломоносова]]
                |дата        = {{СС|8|июля|1709 год|27|июня}}а
                |место = близ [[Полтава|Полтавы]], [[Гетманщина]]
                |причина =
                |итог = Решительная победа русской армии
                |противник1 = {{Флаг Швеции (1562-1761)|25px}}[[Шведское великодержавие|Швеция]]<br />{{Флаг|Гетманщина}} [[Гетманщина|Войско Запорожское]]
                |противник2 = [[Файл:Flag of Russia.svg|border|20px|Флаг России]] [[Русское царство|Россия]]<br />{{Флаг|Гетманщина}} [[Гетманщина|Войско Запорожское]] (казаки И. Скоропадского)
                |командир1 = {{Флаг Швеции (1562-1761)|25px}}'''[[Карл XII]]'''<br />{{Флаг Швеции (1562-1761)|25px}}[[Реншильд, Карл Густав|К. Г. Реншильд]]<br />{{Флаг Швеции (1562-1761)|25px}}[[Левенгаупт, Адам Людвиг|А. Л. Левенгаупт]]<br />{{Флаг Швеции (1562-1761)|25px}}[[Роос, Карл Густав|К. Г. Роос]]<br />{{Флаг|Гетманщина}}[[Мазепа, Иван Степанович|И. С. Мазепа]]<br />[[Файл:Прапор В.З..png|border|20px]][[Кость Гордиенко|К. Гордиенко]]
                |командир2 = [[Файл:Flag of Russia.svg|border|20px|Флаг России]]'''[[Пётр I]]'''<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Шереметев, Борис Петрович|Б. П. Шереметев]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Александр Данилович Меншиков|А. Д. Меншиков]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Репнин, Аникита Иванович|А. И. Репнин]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Алларт, Людвиг Николай|Л. Н. Алларт]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Ренне, Карл Эвальд|К. Э. Ренне]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Баур, Родион Христианович|Р. Х. Баур]]<br />[[Файл:Flag of Russia.svg|border|20px|Флаг России]][[Брюс, Яков Вилимович|Я. В. Брюс]]<br />{{Флаг|Гетманщина}}[[Иван Ильич Скоропадский|Скоропадский, Иван Ильич]]
                |силы1 = '''Общие силы'''<ref name="А. Васильев">А. А. Васильев. О составе русской и шведской армий в Полтавском сражении. Военно-исторический журнал. 1989. № 7.]</ref>:<br /><small>26 000 шведов (около 11 000 кавалерии и 15 000 пехоты), 1000 валашских гусаров, 41 орудие, около 2 тыс. казаков</small>
                ----
                '''Всего:''' около 37 000. 30 тыс. шведов, 6 тыс. казаков, 1 тыс. валахов.
                ----
                '''Силы в битве:'''<br />8270 пехоты, 7800 драгун и рейтаров, 1000 гусар, 4 орудия
                ----
                <small>Не принимали участия в сражении: казаки</small>
                |силы2 =
                '''Общие силы'''<ref name="А. Васильев"/>:<br /><small>около 37 000 пехоты (87 батальонов), 23 700 кавалерии (27 полков и 5 шквадронов), 102 орудия (по другим данным, 302 орудия<ref name="Кротов 300 лет">П. А. Кротов. Битва при Полтаве: к 300-летней годовщине. СПб., 2009.</ref>)</small>
                ----
                '''Всего:''' около 60 000 (по современным данным, 80 000<ref name="ReferenceA">Все войны мировой истории, по Харперской энциклопедии военной истории Р. Дюпюи и Т. Дюпюи с комментариями Н. Волковского и Д. Волковского. С-Петербург, 2004, книга 3, с.499</ref>). из них 8 тыс. казаков Скоропадского.
                ----
                '''Силы в битве:'''<br />25 000 пехоты, 9000 драгун и калмыков, ещё 3000 калмыков подошло к концу битвы
                ----
                <small>'''Гарнизон Полтавы:'''<br />4200 пехоты, 2000 казаков, 28 орудий </small>
                |потери1 = {{s|6700—9234 убитых и раненых,}}<br />2874 пленных во время сражения и 15−17 тыс. у Переволочны
                |потери2 = {{s|1345 убитых, 3290 раненых}}
                |общие потери =
                |примечание =
                }}
                """,
        'weight': 1,
        'coordinates': [49.3743, 34.3240],
        'start_date': '1709-07-08',  # 8 июля 1709 года
        'end_date': '1709-07-08',  # 8 июля 1709 года
        'text': """
            == Предыстория ==
            После [[Битва при Нарве|поражения русской армии при Нарве]] в [[1700 год]]у [[Карл XII]] возобновил [[военные действия]] против саксонского [[курфюрст]]а и польского короля [[Август II|Августа II]], нанося ему одно поражение за другим.

            Возвращение русских земель в [[Ингерманландия|Ингерманландии]], основание русским царём Петром I в устье Невы нового города-крепости Санкт-Петербург (1703) и успехи русских в [[Курляндия|Курляндии]] (1705) побудили Карла XII принять решение после разгрома [[Август II|Августа II]] вернуться к действиям против России и захватить [[Москва|Москву]]. В 1706 году Август II потерпел [[Сражение при Фрауштадте|тяжёлое поражение]] и [[Альтранштедтский мир|лишился короны Речи Посполитой]]. В июне 1708 года Карл XII начал поход против России.
            {{main|Русский поход Карла XII}}
            Пётр I понимал неизбежность наступления шведов в глубь России. После того как русская армия избежала [[Гродненская операция (1706)|разгрома под Гродно]] в 1706 году, вскоре после приезда царя 28 декабря 1706 года в польском городке [[Жолкиев]] состоялся военный совет. На вопрос, «''…давать ли с неприятелем баталии в Польше, или при своих границах''» — решено не давать (если такое несчастие случится, трудно учинить ретираду), «''и для того положено дать баталию при своих границах, когда того необходимая нужда будет; а в Польше на переправах, и партиями, так же оголожением провианта и [[фураж]]а, томить неприятеля, к чему и польские сенаторы многие в том согласились''»<ref name="Тарле">[http://militera.lib.ru/h/tarle2/index.html [[Тарле, Евгений Викторович|Е. В. Тарле]]. Северная война и шведское нашествие на Россию (1958)].</ref>.

            [[1708 год]] прошел в столкновениях шведской и русской армий на территории [[Великое княжество Литовское|Великого княжества Литовского]] (сражения [[Битва при Головчине|при Головчине]], [[Сражение при Добром|при Добром]], [[Бой у Раевки|Раёвке]] и [[Битва при Лесной|Лесной]]). Шведы в полной мере ощутили «оголожение» в [[провиант]]е и фураже, в чём немало способствовало крестьянство Белой Руси, которое прятало хлеб, корм для лошадей, убивало [[фуражир]]ов.

            Осенью 1708 года [[гетман]] [[Мазепа, Иван Степанович|И. С. Мазепа]] изменил Петру и принял сторону Карла, заверив его в союзнических чувствах населения Малороссии к шведской короне. Вследствие болезней и плохого обеспечения питанием и амуницией шведской армии необходим был отдых, поэтому шведы из-под Смоленска повернули на земли Малороссии, чтобы отдохнув там, продолжить наступление на Москву с юга<ref name="Тарле" />. Однако, зима для шведской армии оказалась тяжёлой, несмотря на то, что русская армия на землях Малороссии прекратила тактику «выжженной земли»<ref name=Artamonov>В. А. Артамонов [http://www.zlev.ru/index.php?p=article&nomer=25&article=1315 Полтавская битва и Восточная Европа], Журнал «Золотой Лев» № 213—214 — издание русской консервативной мысли.</ref>. Крестьяне Малой России, как и белорусы, с ненавистью встретили иноземцев. Они убегали в леса, прятали хлеб и корм для лошадей, убивали фуражиров. Шведская армия голодала.

            К тому моменту, когда армия Карла подошла к [[Полтава|Полтаве]], она потеряла до трети состава и насчитывала 35 тыс. человек. Стремясь создать выгодные предпосылки для наступления, Карл решает овладеть Полтавой, которая с фортификационной точки зрения казалась «лёгкой добычей».

            === Союзники — [[Запорожские казаки]] ===
            В октябре 1708 года Петру I стало известно об измене и переходе на сторону Карла XII гетмана Мазепы, который вёл с королём длительные переговоры, обещая ему, в случае прихода шведов на Малую Россию, до 50 тысяч казацкого войска, продовольствие и удобную зимовку<ref>Документальных свидетельств о деталях предварительных предложений Мазепы Карлу не сохранилось. Однако известно, что переговоры велись и довольно долго. По данным [[Таирова-Яковлева, Татьяна Геннадьевна|Т. Г. Таировой-Яковлевой]], он открылся своим приближённым {{сс3|17.09.1707}} года. Она приводит высказывание Мазепы, записанное его верным последователем писарем Орликом: «Я не желал и не хотел христианского кровопролития, но намеревался, придя в [[Батурин]] с шведским королём, писать к царскому величеству благодарственное за протекцию письмо, в нём описав все наши обиды…». Тем самым, планы привести Карла в Батурин существовали. Кроме того, в подписанном позднее договоре с Карлом Мазепа обязуется отдать ему как базу на время войны, помимо прочих городов, Батурин (который уже полностью сожжён и не подходит для этих целей). По всей видимости, само соглашение готовилось до [[Взятие Батурина|сожжения Батурина]].</ref>. {{сс3|28.10.1708}} года Мазепа во главе отряда казаков прибыл в ставку Карла.

            В ответ [[Меншиков, Александр Данилович|А. Д. Меншиков]] {{сс3|2.11.1708}} года [[Взятие Батурина|захватил и разорил Батурин]] — ставку гетмана. Кроме того, Пётр I амнистировал и отозвал из ссылки украинского [[полковник]]а [[Семён Палий|С. Палия]], пытаясь заручиться поддержкой казачества.

            {{OldStyleDate4|17|ноября||6}} в [[Глухов]]е был избран новый гетман — по настоянию Петра I им стал [[Скоропадский, Иван Ильич|И. И. Скоропадский]].

            В марте 1709 года на сторону шведов перешли казаки [[Запорожская Сечь|Запорожской Сечи]]. Направленный на юг русский кавалерийский отряд полковника Кемпбелла (3000 сабель) не смог перехватить запорожских казаков. {{OldStyleDate4|27|марта||16}} запорожцы перебили русский отряд в Царичанке и привели к шведам 115 пленных русских драгун, однако Кемпбеллу удалось прорваться на север.

            {{СС|22|апреля|1709 год|11}}а казаки (мазепинцы и запорожские) участвовали вместе со шведами в сражении против русских [[Сражение у Соколки|у Соколки]]. В ответ русский отряд полковника [[Яковлев, Пётр Иванович (военачальник)|П. И. Яковлева]] {{OldStyleDate4|27|апреля||16}} сжёг [[Келеберда (Полтавская область)|Келеберду]] (пощадив только церковь), {{OldStyleDate4|29|апреля||18}} — [[Переволочна|Переволочну]], затем крепости Старый и Новый Кодак. Наконец, {{OldStyleDate4|21|мая||10}} он подошёл к Сечи. Первый приступ был неудачен, но {{OldStyleDate4|25|мая||14}} подошла помощь от генерал-майора [[Волконский, Григорий Семёнович (1721)|Г. С. Волконского]] (полковник [[Галаган, Игнатий Иванович|И. Галаган]]), и Сечь была [[Запорожская Сечь#Уничтожение Запорожской Сечи (1709 год)|взята и уничтожена]].

            Разгром Запорожской Сечи поднял боевитость запорожцев отстоять свою свободу, и количество запорожцев при короле стало расти. Однако дисциплина казаков, по мнению шведов, оставляла желать лучшего: как любое нерегулярное войско, они были неустойчивы под огнём ядер и гранат. В траншеях под Полтавой «ночной обстрел необычайно большими гранатами заставил разбежаться запорожцев с работ, ибо они так боялись гранат и пушек, что готовы от них бежать на край света». Шведы использовали их для охраны пленных и на землекопных работах, выдавая каждому за день работы «по полкаролина» (по 10 копеек). При традиционно высокой самооценке запорожцев такое отношение вызывало у них недовольство<ref name="HistoryProblems">В. А. Артамонов. Осада Полтавы в 1709 году (по шведским источникам), Вопросы Истории, 2004-11-30VPI — № 11.</ref>.

            В итоге из многотысячного украинского казачества ([[Реестровые казаки|реестровых казаков]] насчитывалось 30 тыс., [[Запорожская Сечь|запорожских казаков]] — 10−12 тыс.) на сторону Карла XII перешли около 10 тысяч человек: около 3 тысяч реестровых казаков и около 7 тысяч запорожцев<ref name="А. Васильев" />. Но и те вскоре начали разбегаться из походного лагеря шведской армии. Таких ненадёжных союзников, которых осталось около 2 тысяч, король Карл XII не рискнул использовать в сражении и поэтому оставил их в обозе под присмотром 7 кавалерийских полков. В бою участвовал только небольшой отряд казаков-добровольцев.

            Пётр I, не вполне доверяя казакам нового гетмана И. И. Скоропадского, также не использовал их в битве. Для присмотра за ними он направил 6 драгунских полков под началом генерал-майора [[Волконский, Григорий Семёнович (1721)|Г. С. Волконского]].

            == Осада Полтавы ==
            Ещё находясь главными силами в Будищах, {{СС|13|апреля|1709 год|2}}а Карл XII произвёл рекогносцировку Полтавы, а {{СС|6|мая||25|апреля}} приказал генералу [[Спарре, Аксель|А. Спарре]] с 8 пехотными полками, артиллерийским полком и всем обозом перейти из Будищ под Полтаву, генералу [[Крейц, Карл Густав|К. Г. Крейцу]] с кавалерией — из Решетиловки перейти к Ворскле<ref name="Леер">Энциклопедия военных и морских наук под ред. Леера. Том 6. СПб. 1893.</ref>. Русский отряд [[Ренне, Карл Эвальд|К. Э. Ренне]] (7 тыс. кавалерии), направленный под Полтаву, принужден был отойти к главной армии<ref name="Лексикон">[[Военный энциклопедический лексикон]]. Часть 10. СПб. 1846.</ref>.

            {{СС|8|мая||27|апреля}} шведами под Полтаву направлен ещё один пехотный полк — Далекарлийский, на следующий день к Полтаве пришёл сам король. Шведское командование было настроено благодушно: Полтава не выглядела неприступной крепостью. В начале осады фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]] отметил: «''Неужели русские до такой степени безрассудны и станут защищаться?''»<ref name="Гилленкрок">[http://memoirs.ru/texts/Gillenkrok1844.htm [[Гилленкрок, Аксель|А. Гилленкрок]]. Сказание о выступлении его величества короля Карла XII из Саксонии и о том, что во время похода к Полтаве, при осаде её и после случилось / Пер. с нем., введ. и примеч. Я. Турунова // Военный журнал, 1844. — № 6. — С. 1—105.]</ref> Два следующих дня (28 и 29 апреля) они пытались взять слабо укреплённый, по их мнению, город штурмом. После этих неудачных попыток {{СС|11|мая||30|апреля}} (1 мая по шведскому календарю) начаты осадные работы<ref name="Леер" />.

            [[Тарле, Евгений Викторович|Е. В. Тарле]] отсчитывает «борьбу у валов» Полтавы с {{СС|17|апреля||6}}, {{СС|26|апреля||15}} осада «стала крепкой», а на следующий день начался обстрел Полтавы из [[мортира|мортир]].

            Однако осада, порученная [[генерал-квартирмейстер]]у [[Гилленкрок, Аксель|А. Гилленкроку]], шла медленно и производилась небольшим числом войск (преимущественно запорожцами, что не прибавляло им энтузиазма: принуждение к лопате и кирке они сочли унижением). Кроме того, шведы не имели осадных орудий, только полевые<ref name="Лексикон" />. Под руководством полковника [[Келин, Иван Степанович|А. С. Келина]] её гарнизон в составе 4,2 тыс. солдат (Тверской и Устюжский солдатские полки и по одному батальону ещё от трёх полков — Пермского, Апраксина и Фехтенгейма) и 2,6 тыс. вооружённых горожан успешно отбил ряд штурмов.

            А. Гилленкрок сообщает, что один казацкий офицер, состоявший при Мазепе, рассказал ему, что подполковник Зильфергельм вел переговоры с казацким полковником [[Левенец, Иван Прокофьевич|Левенцом]], находившимся с русскими в Полтаве. Этот полковник хотел доставить шведам случай напасть врасплох на Полтаву. Но переговоры не имели успеха. Русское командование узнало про переговоры, арестовало и выпроводило из города казацкого полковника<ref name="Гилленкрок" />. Об измене полковника Полтавского казацкого полка Ивана Левенца сообщает и Тарле<ref name="Тарле" />.

            С апреля по июнь шведы предприняли 20 штурмов Полтавы и потеряли под её стенами более 6 тысяч человек<ref name="Леер" />.

            Гарнизон Полтавы к началу битвы составлял 2200 человек<ref name="Кротов Оборона Полтавской крепости">П. А. Кротов. Оборона Полтавской крепости. // ВИЖ и Цейхгауз. Спецвыпуск «300 лет Полтавской битве». 2009.</ref>.

            При этом помимо собственно гарнизона, на защиту Полтавы поднялось практически всё население города (в том числе женщины и дети), участвовавшее не только в строительстве укреплений, но и непосредственно в военных действиях. При этом отмечается твёрдое намерение горожан погибнуть при обороне, но не сдаться. Так например, в 20-х числах июня, когда шведы предпринимали последние отчаянные попытки штурма города, толпа горожан растерзала человека, заговорившего о сдаче<ref>{{Книга|автор = Тарле Е. В.|заглавие = Северная война: Северная война и шведское нашествие на Россию. Русский флот и внешняя политика Петра 1.|ответственный = |издание = |место = М.|издательство = АСТ:Астрель|год = 2011|страницы = 434-435|страниц = 701|isbn = 978-5-17-058044-6}}</ref>.

            == Попытки русских снять осаду ==
            В начале мая, вскоре после начала осады, к Полтаве подошёл [[Меншиков, Александр Данилович|А. Д. Меншиков]] с частью русской армии. Пытаясь помочь гарнизону Полтавы, он планировал атаковать окоп, прикрывающий осаждающих шведов, а с целью отвлечения противника направил против Опошни отряд генерал-лейтенанта [[Беллинг, Фёдор Иванович|Ф. И. Беллинга]]. Однако предпринятая {{СС|18|мая||7}} диверсия к [[Опошня|Опошне]] не удалась. Безуспешны были и другие действия по облегчению положения осаждённых (создание редута у моста через Ворсклу, строительство плотины). В то же время бригадир Алексей Головин сумел {{СС|26|мая||15}} провести в крепость 2 батальона (900 человек)<ref name="Леер" />. После этого гарнизон Полтавы стал вести себя активнее и предпринял ряд вылазок, в одной из которых А. Головин попал в плен<ref name="Куракин">[http://memoirs.ru/texts/KRSH_890.htm Б. И. Куракин. Русско-шведская война. Записки. 1700—1710 // Архив кн. Ф. А. Куракина. — Кн. 1. — СПб., 1890 — с. 291—328.]</ref>.

            {{СС|6|июня||26|мая}} под Полтаву прибыл [[Шереметев, Борис Петрович|Б. П. Шереметев]] с главной армией; таким образом, вся русская армия собралась у деревни Крутой берег в укреплённом лагере. Шведы противопоставили русским свою линию укреплений, усиленную на флангах редутами. Все их штурмы по-прежнему успешно отбивались осаждёнными.

            Для ослабления противника русские отряды совершали частые нападения на его расположение. Наиболее значительное произведено генерал-лейтенантом [[Гейнскин, Иоганн|И. Гейнскином]] (6 драгунских полков = 2500 сабель и Астраханский пехотный полк) на деревню [[Старые Санжары]], где содержались русские пленные, взятые в [[Веприк (Гадячский район)|Веприке]]. В результате шведы были разбиты, 1200 русских пленных освобождены. У неприятеля были взяты 2 орудия и 8 знамен, потери русских — 60 убитых и 181 раненых.

            == Переправа русской армии через Ворсклу ==
            {{СС|15|июня||4}} в русскую армию под Полтавой прибыл [[Пётр I]]. Вскоре на военном совете было принято решение переправляться через Ворсклу. Однако грозы и наводнение сорвали замыслы царя: попытка переправы в месте укреплённого лагеря через трудно проходимые болота {{СС|24|июня||13}} не удалась.

            Тогда {{СС|26|июня||15}} Пётр решил перейти Ворсклу в другом месте; на военном совете решили «''город Полтаву выручить без генеральной баталии (яко зело опасного дела)''»<ref name="Артамонов два полководца">[http://www.russkie.org/index.php?module=fullitem&id=15878 В. Артамонов. Два полководца в Полтавской битве.]</ref>. Однако уже на следующий день на новом военном совете Пётр решился дать Карлу XII генеральное сражение.

            Пётр I направил генерала [[Алларт, Людвиг Николай|Л. Н. Алларта]] подготовить переправу южнее Полтавы, а [[Ренне, Карл Эвальд|К. Э. Ренне]] с тремя полками пехоты и несколькими полками драгун — севернее, в район деревни Петровка, а также продолжил строительство плотины, начатой Меншиковым. Узнав о переправе русских через Ворсклу, Карл XII направил против Ренне фельдмаршала [[Реншильд, Карл Густав|К. Г. Реншильда]], а сам направился против Алларта. При [[Рекогносцировка (военное дело)|рекогносцировке]] {{СС|27|июня||16}} (17 июня по шведскому календарю), в свой день рождения, шведский король был ранен в ногу, после чего шведы возвратились в лагерь.

            {{СС|30|июня||19}} русская армия перешла к деревне Черняковка, к месту переправы, подготовленной генералом Ренне. На следующий день она перешла Ворсклу и стала укрепленным лагерем у деревень Петровка и Семёновка (в 8 верстах севернее Полтавы).

            {{СС|2|июля||21|июня}} шведское командование, получив ложное известие о начале русской атаки, построило свою армию в боевой порядок, а также предприняло очередной неудачный приступ к Полтаве. Вечером Карл отвёл пехоту к Крестовоздвиженскому монастырю, а фельдмаршал К. Г. Реншильд отвёл кавалерию на другую сторону Полтавы<ref name="Леер" />.

            Стремясь собрать как можно больше войск, Пётр I приказал гетману И. И. Скоропадскому и калмыкам [[Аюка]]-хана присоединиться к главной армии. {{СС|5|июля||24|июня}} казаки Скоропадского соединились с армией Петра; основные силы калмыков к сражению опоздали.

            {{СС|6|июля||25|июня}} русская армия перешла ближе к Полтаве и расположилась в новом укреплённом лагере у деревни Яковцы. Идя атаковать грозного противника, Пётр I при каждой остановке окапывается: возводит [[тет-де-пон]] (предмостное укрепление) у Петровки, создает укреплённый лагерь у Семёновки, другой южнее в 3 верстах, а также велел построить 6 редутов между Яковецким и Малобудищенским лесами. Всё это должно было уравновесить тактическое превосходство неприятеля в случае неожиданного нападения ранее 29 июня<ref name="Леер" />.

            В. Артамонов полагает, что [[ретраншемент]] имел форму неправильного многоугольника, как показано на первичных схемах генерала Л. Н. Алларта 1709 года и плане Я.Шварца, а не чёткой трапеции или прямоугольника, как потом вычерчивалось на всех «парадных» схемах. Он состоял, возможно, из четырёх бастионов и шести реданов, соединённых валами. Конницу расположили на открытом поле между Яковчанским и Малобудищенским лесом за шестью поперечными редутами. В лесу у Малых Будищ подрубили деревья и сделали завалы<ref name="Артамонов два полководца" />.

            Узнав через перебежчика о подходе к русским усиления в виде калмыцкой конницы и лишившись надежды получить собственное подкрепление (отказ турецкого султана вступить в войну против России и невозможность [[Станислав Лещинский|Станислава Лещинского]] и корпуса [[Крассов, Эрнст Дитлев фон|Крассова]] прийти на помощь из Польши), Карл XII решился ещё раз атаковать Полтаву ({{СС|3|июля||22|июня}}), а после неудачи штурма (который стоил шведам 1676 человек, русским — 278 убитых и 603 раненых<ref name="Леер" />) — дать русским генеральное сражение.

            {{СС|7|июля||26|июня}} Пётр вместе с генералитетом снова осматривал поле и неприятельский лагерь и принял ещё одно решение, повлиявшее на исход битвы — построить ещё 4 продольных редута посередине прохода между лесками у д. Малые Будищи и Малые Павленки. Строить их было приказано ночью, чтобы об этом не знал противник. Однако, к началу битвы были окончены лишь два из них<ref>{{Книга|автор = Е. В. Тарле|заглавие = Северная война: Северная война и шведское нашествие на Россию. Русский флот и внешняя политика Петра 1.|ответственный = |издание = |место = М.|издательство = АСТ:Астрель,|год = 2011.|страницы = 441|страниц = 701|isbn = 978-5-17-0580440-6}}</ref>.

            == План Карла XII на битву ==
            На военном совете шведского командования (кроме Карла XII, участвовали фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]], первый министр короля [[Пипер, Карл|К. Пипер]] и командир Далекарлийского полка полковник {{нп3|Сигрот, Густав Генрик фон|Сигрот|sv|Gustaf Henrik von Siegroth}}) было решено атаковать русскую армию. План включал два этапа и строился он на внезапности атаки и на убеждении, что русская армия, также как и в [[Битва при Головчине|битве при Головчине]], будет пассивна в наступлении и в основном будет обороняться<ref name="Энглунд">Энглунд П. [http://militera.lib.ru/h/englund_p/ Полтава: Рассказ о гибели одной армии.] — М: Новое книжное обозрение, 1995. — 288 с. ISBN 5-86793-005-X</ref>:
            * Шведская пехота ранним утром под прикрытием темноты неожиданно для противника начинает атаку и прорывается в тыл русских в пространстве между их редутами, устроенными между Будыщанским и Яковецким лесами. Затем следует удар шведской кавалерии по русской коннице, сосредоточенной за [[редут]]ами.
            * На втором этапе атаки шведы штурмуют русский опорный пункт ([[ретраншемент]]) и одновременно с этим их кавалерия охватывает его с севера, тем самым, обрезая пути отступления русским войскам, что в конце концов должно было привести к их полному разгрому.

            Этот план короля не был сообщён даже ближайшим лицам из главного штаба армии<ref name="Лексикон" />. Не все командиры уяснили его смысл: часть из них полагала, что речь идет о штурме редутов, другая — о проходе линии укреплений противника насквозь.
            [[Файл:Start of Poltava.gif|thumb |300px|right|Положение войск в начале битвы]]

            == Силы сторон ==

            === Шведская армия ===
            Карл XII располагал до 37 тыс. солдат (в том числе несколько тысяч реестровых и низовых запорожских казаков)<ref name="ReferenceA"/>. Оставив против Полтавы 2 полка с небольшим отрядом кавалерии и отрядив 4 поста кавалерии (2 тыс.) для занятия переправ через Ворсклу от Полтавы до Переволочной, у Карла XII осталось 26 батальонов пехоты, 22 полка кавалерии; всего 25 тыс. человек<ref name="Леер" />.

            Непосредственно в Полтавском сражении принимало участие около 8000 пехоты (18 батальонов), 7800 кавалерии (14 полков кавалерии и корпус [[драбант]]ов = 109 эскадронов) и около тысячи нерегулярной кавалерии ([[валахи|валахов]]).

            === Русская армия ===
            Русская армия насчитывала, по разным данным, от 60<ref name="А. Васильев"/> до 80 тыс. солдат<ref name="ReferenceA" />.

            Непосредственно в Полтавском сражении участвовали 25 тысяч пехоты, часть из которых, даже присутствуя на поле, не принимали участие в сражении.

            Русская кавалерия насчитывала около 21 тысяч человек (24 драгунских полка, 3 конно-гренадерских и 2 отдельных «шквадрона»)<ref name="Кротов кавалерия">П. А. Кротов. Численность русской кавалерии в Полтавской битве.</ref>. Кроме того, с русской стороны в бою участвовал небольшой отряд калмыков (единственные нерегулярные соединения, использованные Петром I непосредственно в сражении)<ref name=Artamonov />.

            === Артиллерия ===
            Карл XII располагал 41 орудием (30 пушек, 2 гаубицы, 8 мортир и 1 дробовик)<ref name="А. Васильев"/>, однако в сражении с шведской стороны участвовали только 4 орудия. Полагают, что шведы растратили все заряды при осаде Полтавы и остались без зарядов и пороха<ref name="Тарле" />.

            Энглунд пишет, что на вооружении артиллерийского полка под началом полковника Рудольфа фон Бюнова имелось 28 орудий: 16 3-фунтовых, 5 6-фунтовых, 2 16-фунтовые гаубицы и 5 6-фунтовых мортир. Однако план короля, предусматривающий скрытный подход и неожиданную атаку русского лагеря, исключал использование тяжёлой артиллерии, именно поэтому шведская артиллерия практически не использовалась в битве<ref name="Энглунд" />.

            Кроме того, для шведской армии того времени характерна недооценка артиллерии в бою; весь упор делался на мощную атаку [[каролины|каролинов]] сомкнутым строем.

            Напротив, Пётр I уделял огромное внимание артиллерии. В итоге в Полтавской битве превосходство русских в материальной части стало подавляющим. Энглунд описывает участие в бою 102 русских орудий; согласно исследованию П. А. Кротова, орудий в битве было 302<ref name="Кротов 300 лет" />.

            Часть русских орудий находилась в распоряжении воинских частей; артиллерийский полк (32 орудия) был рассредоточен между полками. Всей русской артиллерией командовал генерал-поручик [[Брюс, Яков Вилимович|Я. В. Брюс]].

            == Накануне ==
            Накануне сражения Пётр I объехал все полки. Его краткие патриотические обращения к солдатам и офицерам легли в основу знаменитого приказа, требовавшего от воинов биться не за Петра, а за «Россию и российское благочестие…»

            В свою очередь, воодушевляя солдат, Карл XII объявил, что завтра они будут обедать в русском обозе, где их ожидает большая добыча.

            == Ход битвы ==

            === Выдвижение шведской армии ===
            Около 23.00 накануне битвы спящих шведов разбудили и приказали строиться в колонны. Шведская пехота (18 батальонов под командованием генерала инфантерии [[Левенгаупт, Адам Людвиг|А. Л. Левенгаупта]]) построилась в 4 колонны: генерал-майоров [[Спарре, Аксель|А. Спарре]], [[Стакельберг, Берндт Отто|Б. О. Стакельберга]], [[Роос, Карл Густав|К. Г. Рооса]] и [[Лагеркруна, Андерс|А. Лагеркроны]].

            Шведская кавалерия построилась в 6 колонн; правым её флангом командовал генерал-майор [[Крейц, Карл Густав|К. Г. Крейц]], левым — генерал-майор [[Гамильтон, Хуго Юхан|Х. Ю. Гамильтон]]. Генерал-майор [[Шлиппенбах, Вольмар Антон|В. А. Шлиппенбах]] возглавил передовой кавалерийский отряд (12 эскадронов). Кавалерией командовал фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]]; ему же раненый король вверил общее командование на поле боя. Ещё 3 кавалерийских и 4 драгунских полка и 3 тыс. казаков оставлены для охраны лагеря и обоза<ref name="Энглунд" />.

            Однако шведы задержались с построением в колонны и выходом на исходные позиции. Только около 2 ч утра {{СС|8|июля||27|июня}} (28 июня по шведскому календарю) шведская армия двинулась вперёд. В итоге внезапность была утрачена.

            === Атака шведов на редуты ===
            Шведы вышли на поле перед русскими [[редут]]ами к рассвету. Шведская пехота атаковала русские редуты, а шведская кавалерия, проскакав между ними — русскую кавалерию, стоявшую лагерем на поле за редутами.

            Существуют разногласия относительно численности оборонявшихся в редутах русской пехоты: энциклопедии сообщают о двух батальонах Белгородского полка [[бригадир]]а [[Айгустов, Савва Васильевич|С. В. Айгустова]]<ref name="Лексикон" />. Энглунд сообщает, что в редутах находились Белгородский, Нечаевский и Неклюдовский пехотные полки (около 4000 человек, 14—16 3-фунтовых пушек и несколько более мощных орудий)<ref name="Энглунд" />, В. Артамонов — о шести пехотных полках (4730 чел.)<ref name="Артамонов два полководца" />.

            Шведам удалось быстро захватить два первых недостроенных редута. Пленных не брали. Однако третий редут взять с ходу не удалось.

            Тем временем русские [[драгун]]ы, выстроившись в боевой порядок, под командованием [[Меншиков, Александр Данилович|А. Д. Меншикова]] (в команде были также [[Ренне, Карл Эвальд|К. Э. Ренне]] и [[Баур, Родион Христианович|Р. Х. Баур]]) двинулись навстречу шведам. Общепринято, что в первой фазе битвы с русской стороны участвовало 17 драгунских полков (10 тыс. человек при 13 орудиях); П. А. Кротов считает, что здесь сражалась вся русская кавалерия (21 тыс.)<ref name="Кротов кавалерия" />.

            В. А. Молтусов подчёркивает, что кавалерийский бой произошёл на линии поперечных русских редутов, и что именно поддержка кавалерии позволила русским редутам выполнить своё предназначение<ref>[http://www.regiment.ru/Lib/A/39.htm В. А. Молтусов. Полтавская битва. Новые факты и интерпретация. — Автореф. дисс. … канд. наук. — М. 2002.]</ref>. Русская конница несколько раз отбила атаки шведской кавалерии, которая потеряла к концу боя 14 знамён и штандартов<ref name="Леер" />. Тогда Карл XII приказал шведской пехоте двинуться на помощь кавалерии сквозь линию редутов.

            Около 4 ч утра Пётр I приказал своей кавалерии отойти на главную позицию возле укреплённого лагеря. Однако Меншиков не подчинился приказу царя и, желая покончить с шведами у редутов, продолжил бой. Князь извещал, что разворачивать эскадроны, когда шведская конница находится рядом — опасно. Выдержать медленный темп отхода можно было только при поддержке пехоты. Пётр отказал в присылке пехоты, отозвал Меншикова и вручил командование [[Баур, Родион Христианович|Р. Х. Бауру]] (Ренне к этому времени уже был ранен), который стал повёртывать конницу. Случилось то, чего опасался Меншиков: всадникам пришлось почти 3 км отрываться полным галопом и проскочить мимо ретраншемента. Сложилось впечатление, что русская кавалерия побежала<ref name="Артамонов два полководца" />. Шведская кавалерия организовала преследование, однако К. Г. Реншильд вернул кавалерию назад, боясь оставить пехоту на поле боя без прикрытия.

            А шведская пехота (10 батальонов), пройдя линию редутов, оказалась прямо перед русским укреплённым лагерем, при этом Гренадерский батальон лейб-гвардии понёс большие потери от огня русской артиллерии<ref name="Энглунд" />. Левенгаупт уже собирался начать атаку, но был остановлен приказом отойти к Будищенскому лесу и ожидать возвращения кавалерии и отставшей пехоты.

            В это время ядро из русского ретраншемента разбило носилки Карла XII, но сам король не пострадал.

            Таким образом, в битве наступила пауза. В шведском лагере царило приподнятое настроение, приближённые поздравляли короля с победой. Шведы полагали, что осталось только добить русскую армию. Часть казаков гетмана И. И. Скоропадского собрались перейти на сторону шведов, но {{нп3|Вюртемберг, Максимилиан|принц Максимилиан Вюртембергский|de|Maximilian Emanuel von Württemberg-Winnental}} счёл не вправе решать этот вопрос без короля<ref name="Энглунд" />.

            === Разгром Рооса ===
            Проход линии [[редут]]ов привёл в расстройство шведскую пехоту. Особенно это касалось колонны генерал-майора [[Роос, Карл Густав|К. Г. Рооса]]: часть батальонов прошла линию русских укреплений вместе с остальной пехотой Левенгаупта, другая часть осталась штурмовать 3-й русский редут. К штурмующим присоединились батальоны соседних колонн. Всего в отряде Рооса оказалось 6 батальонов.

            Неподготовленный штурм 3-го редута шведами (не собираясь штурмовать укрепления, они не заготовили лестницы, фашины, канаты и другое необходимое снаряжение) привёл к большим потерям, особенно в офицерах. Погибли командир Далекарлийского полка полковник {{нп3|Сигрот, Густав Генрик фон|Сигрот|sv|Gustaf Henrik von Siegroth}} и командир Йончёпигского полка полковник фон Бухвальд, ранен командир Вестерботтенского полка полковник Гидеон Фок. Из 2600 человек в начале боя в отряде Рооса осталось к этому времени около 1500. Отказавшись от штурма редута, Роос приказал отойти к Яковецкому лесу, при этом он потерял из виду главные силы.

            Пётр I увидел отрыв части шведской пехоты от основных сил и отправил против неё 5 пехотных батальонов под началом генерал-лейтенанта [[Ренцель, Самуил|С. Ренцеля]] (Тобольский и Копорские полки двухбатальонного состава, а также батальон полка Феленгейма) и 5 драгунских полков генерал-лейтенанта [[Гейнскин, Иоганн|И. Гейнскина]].

            К отряду Рооса присоединилась кавалерия генерал-майора [[Шлиппенбах, Вольмар Антон|В. А. Шлиппенбаха]], игравшая в начале битвы роль передового отряда. Шлиппенбах отправился на поиск главной армии, но натолкнулся на русскую кавалерию и попал в плен. Это был первый пленный генерал шведской армии в Полтавской битве.

            Вскоре и Роос увидел перед собой окружавших его русских. После короткого, но жаркого боя остатки отряда Рооса (к этому времени 300—400 человек) бежали на юг через лес к шведским укреплениям у Полтавы. Здесь отряд укрылся в так называемом «Гвардейском шанце» и вскоре сдался на капитуляцию перед С. Ренцелем.

            === Построение армий перед решающим боем ===

            ==== Построение русской армии ====
            После преодоления линии русских редутов в сражении наступила пауза. Шведская армия приводила себя в порядок; её командование ожидало возвращения своей кавалерии и пехоты и ничего не знало о судьбе отряда Рооса.

            Царь Пётр, потеряв шведскую армию из виду и не зная замыслов шведов, начал выводить свои войска из ретраншемента: сначала для удержания линии обороны справа от укрепления (севернее) были поставлены в две линии 13 батальонов, слева (южнее) — 10 батальонов, также в 2 линии.

            Около шести часов утра Пётр вывел всю армию из лагеря и построил её в две линии, имея в центре пехоту под командованием генерал-фельдмаршала [[Шереметев, Борис Петрович|Б. П. Шереметева]] и генерала [[Репнин, Аникита Иванович|А. И. Репнина]], на левом фланге кавалерию генерала [[Меншиков, Александр Данилович|А. Д. Меншикова]], кавалерией правого фланга командовал [[Баур, Родион Христианович|Р. Х. Баур]] (до его прибытия кавалерией командовал бригадир [[Вейсбах, Иоганн Бернгард|И. Б. Вейсбах]]). Русской артиллерией командовал генерал-поручик [[Брюс, Яков Вилимович|Я. В. Брюс]]. В лагере был оставлен резерв из девяти пехотных батальонов (генерал-майор [[Гинтер, Иван Яковлевич|И. Я. Гинтер]]).

            И. Ф. Павловский представил следующий боевой порядок противоборствующих войск в решающей фазе сражения:
            {{цитата|Боевую часть составили 40 батальонов пехоты, 17 полков кавалерии и вся артиллерия, расположенные впереди и по флангам редута в следующем порядке: дивизия генерал-лейтенанта [[Голицын, Михаил Михайлович|князя Голицына]], в числе 12 батальонов и в составе пехотных полков [[Преображенский полк|преображенского]], [[Семёновский полк|семёновского]], [[Ингерманландский 9-й пехотный полк|ингерманландского]] и астраханского, расположились на правом фланге боевого порядка под прикрытием 11 полков кавалерии генерал-лейтенанта [[Баур, Родион Христианович|Бауера]]; в числе этих частей находился и самый старейший, ныне драгунский, полк, доблестный [[Нижегородский 17-й драгунский полк|нижегородский]]. Начальником правого фланга позиции был назначен генерал-фельдмаршал [[Шереметев, Борис Петрович|Шереметев]]. Генералы [[Вейсбах, Иоганн Бернгард|Вейсбах]], [[Отто Рудольф фон и цу Шауенбург|Шомбург]] и Бем и полковник [[Долгоруков, Василий Владимирович|кн. Долгоруков]] командовали различными частями боевой линии.

            В центре, в две линии, расположились 16 батальонов дивизии [[Репнин, Аникита Иванович|кн. Репнина]]. В составе первой линии вошли 2 батальона гренадер, два батальона киевского полка, два батальона нарвского, один шлиссельбургского, один новгородского и один [[Эриванский 13-й гренадерский полк|бутырского]]. В состав второй линии вошли два батальона белгородского полка и по одному батальону киевского, нарвского, шлиссельбургского, новгородского и бутырского пехотных полков. Начальником первой линии был назначен [[Айгустов, Савва Васильевич|бригадир Августов]], второй — бригадир [[Феленгейм, Иван Самуилович фон|Феленгейм]]. Участки позиции, распределенные между бригадирами Нечаевым, Левом и Полонским, находились под командой начальника центра — самого царя, объединявшего в то же время начальство над всеми войсками, находящимися на поле сражения.

            Кн. Репнин, оставаясь на позиции и руководя непосредственно действиями своей дивизии, получил еще назначение заменять Петра в случае его отсутствия и принять начальство над всей боевой линией, если бы Шереметев был убит.

            Левый фланг составили 12 батальонов дивизии генерала [[Алларт, Людвиг Николай|Алларта]] из полков гренадерского, псковского, сибирского, нижегородского, московского и фон Дельдина, под прикрытием 6 полков конницы генералов [[Волконский, Александр Григорьевич|князя Волконского]] и [[Беллинг, Фёдор Иванович|Беллинга]] и бригадира Бема, под общим начальством над всем левым флангом генерала от кавалерии [[Меншиков, Александр Данилович|князя Меншикова]]. Артиллерия расположилась между полками под общим начальством генерал-лейтенанта от артиллерии [[Брюс, Яков Вилимович|Брюса]].

            Из 9 батальонов, оставленных в лагере, три и части сборных команд, под начальством [[Головин, Иван Михайлович|полковника Головина]], направлены были для занятия полтавского Крестовоздвиженского монастыря с назначением войти в связь с гарнизоном крепости Полтавы<ref>[http://histpol.pl.ua/index.php/ru/?option=com_content&view=article&id=3707#02 И. Ф. Павловский. Полтавская битва 27 июня 1709 года // Типография И. А. Дохмана. Полтава. 1908.]</ref>.}}

            В решающей стадии битвы численность русской кавалерии составила 7709 «нижних чинов» на правом фланге и 4459 на левом (итого 12,168 человек)<ref name="Кротов кавалерия" />.

            ==== Построение шведской армии ====
            Фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]] не поверил, что русские выстроились для боя, и лично выехал чтобы удостовериться<ref name="Энглунд" />. Однако факт оставался фактом: русские изменили своей «пассивной тактике», стоившей им так дорого [[Битва при Головчине|при Головчине]].

            Не дождавшись подхода отряда Рооса, шведская пехота (10 батальонов пехоты; около 4000 человек) под началом генерала [[Левенгаупт, Адам Людвиг|А. Л. Левенгаупта]] выстроились в одну линию (справа налево):
            * 1-й батальон лейб-гвардии
            * Гренадерский батальон лейб-гвардии
            * Батальон Скараборгского полка
            * батальон Кальмарского полка
            * 2-й батальон лейб-гвардии
            * 3-й батальон лейб-гвардии
            * два батальона Уппландского полка
            * батальон Эстгётского полка
            * 2-й батальон Нерке-Вермландского полка
            Ещё два батальона Вестманландского полка под началом генерал-майора [[Спарре, Аксель|А. Спарре]] при поддержке драгун Нильса Ельма (Hielm) были направлены на поиск отряда Росса; позже они вернулись на поле боя.

            Кавалерия правого фланга (генерал-майор [[Крейц, Карл Густав|К. Г. Крейц]]; 52 эскадрона) из-за тесноты на поле боя стала не на фланге, а позади шведской пехоты.

            Кавалерией левого фланга по-прежнему командовал генерал-майор [[Гамильтон, Хуго Юхан|Х. Ю. Гамильтон]].

            Русские стояли так плотно, что разрывы между батальонами составляли около 10 м, причём в эти промежутки выкатывали выдвинутые в боевые порядки орудия. Стараясь построить собственную линию не меньше линии противника, шведы сделали разрывы между батальонами около 50 м. И всё равно русская линия (около 2 км) превосходила по длине шведскую (1,4—1,5 км).

            Однако шведское командование не смущало численное превосходство русских: оно делало упор на стремительную атаку [[Каролинская пехота|каролинов]], которая должна была опрокинуть армию противника и обратить в бегство. Кроме того, разница в широте линии могла компенсироваться преимуществом шведов в кавалерии.

            === Решающий бой ===
            [[Файл:King's colour Karl XII.jpg|thumb|300px|Личный штандарт [[Карл XII|Карла XII]], захваченный во время Полтавской битвы <small>([[Петропавловская крепость]], Комендантский дом, экспозиция «История Санкт-Петербурга — Петрограда. 1703—1918»)</small>]]
            В 9 часов утра линия шведской пехоты атаковала русскую пехоту. Шведы были встречены сначала артиллерийским огнём, затем противники обменялись ружейным огнём, после чего начали рукопашную схватку.

            Шведская кавалерия К. Г. Крейца поддержала атаку своей пехоты; 4 левофланговых русских батальона (Нижегородский и Гренадерский полки бригадира де Бука) вынуждены были стать в каре, но кавалерия А. Д. Меншикова атаковала шведов во фланг, расстроив их атаку.

            Воодушевляемое присутствием короля, правое крыло шведской пехоты яростно атаковало левый фланг русской армии. Под натиском шведов первая линия русских войск стала отступать. Напору противника поддались Казанский, Псковский, Сибирский, Московский (дивизии [[Алларт, Людвиг Николай|Л. Н. Алларта]]), а также Бутырский и Новгородский полки левого фланга дивизии [[Репнин, Аникита Иванович|А. И. Репнина]]<ref name="Энглунд" />. В передней линии русской пехоты образовался опасный разрыв боевого порядка: шведы штыковой атакой «опрокинули» 1-й батальон Новгородского полка, захватили свыше десятка русских орудий, некоторые из них они обратили против противника. Российская историография описывает подвиг царя Петра I, который вовремя заметил это, взял 2-й батальон Новгородского полка и во главе его бросился в опасное место. Прибытие царя положило конец успехам шведов и порядок на левом фланге был восстановлен.

            Пока правый фланг шведской пехоты прорывал фронт русской армии, её левый фланг даже не вступил в соприкосновение с русскими. Напротив, русская пехота правого фланга генерал-лейтенанта [[Голицын, Михаил Михайлович|М. М. Голицына]] (самые опытные, в том числе гвардейские полки) атаковала шведскую пехоту и обратила её в бегство. Кавалерия шведского левого фланга не успела поддержать собственную пехоту и вскоре сама была обращена в бегство, при этом командир Нюландского кавалерийского полка полковник Андерс Торстенссон погиб, а генерал-майор [[Гамильтон, Хуго Юхан|Х. Ю. Гамильтон]] попал в плен.

            Бегство пехоты шведского левого фланга обнажило центр боевых порядков. Русская пехота усилила напор на противника, а таявшая тонкая линия шведов сломалась, разрывы между батальонами достигли 100—150 м. Фланги русской армии охватили боевой порядок шведов. Шведы уже устали от напряжённого боя. Оба стоявших в центре батальона Уппландского полка были окружены и полностью уничтожены (из 700 человек к своим вышли только 14; погибли полковник Густав Шернхёк (Stiernhook) и подполковник Арендт фон Пост)<ref name="Энглунд" />. В бою погибли также полковники Карл Густав Ульфспарре (командир Скараборгского полка), Густав Ранк (командир Кальмарского полка) и Георг Юхан Врангель (командир 2-го батальона Нерке-Вермландского полка). Под натиском русских сил потерявшие строй шведы начали беспорядочное отступление, превратившееся к 11 часам в настоящее бегство.

            === Разгром ===
            Осознав неизбежность поражения, король под охраной [[драбант]]ов и кавалерии генерал-майора [[Крейц, Карл Густав|К. Г. Крейца]] покинул поле боя, при этом проходя назад через линию русских редутов (которые опять заняли русские) охрана короля понесла большие потери. Здесь погиб историограф короля [[Адлерфельд, Густав|Густав Адлерфельт]].

            Добравшись до обоза в Пушкарёвке (где находились около 7000 кавалерии и верные Карлу XII казаки), шведская армия начала приводить себя в порядок. Здесь к армии присоединились два полка, которые вели осаду Полтавы (при вылазке А. С. Келина против шведов убит командир Зёдерманландского полка полковник Габриэль фон Вайденхайм).

            Вечером шведская армия с королём направилась на юг, к переправе через Днепр. К Днепру был послан [[генерал-квартирмейстер]] [[Гилленкрок, Аксель|А. Гилленкрок]]. В [[арьергард]]е следовал отряд генерал-майора [[Крузе, Карл Густав|К. Г. Крузе]].

            На поле боя были взяты в плен (кроме генералов Шлиппенбаха, Рооса и Гамильтона) фельдмаршал [[Реншильд, Карл Густав|К. Г. Реншильд]], генерал-майор [[Стакельберг, Берндт Отто|Б. О. Стакельберг]], {{нп3|Вюртемберг, Максимилиан|принц Вюртембергский|de|Maximilian Emanuel von Württemberg-Winnental}}, командир Северо-Сконского драгунского полка полковник Густав Горн, командир Эстгётского полка полковник Андерс Аппельгрен, командир собственного драгунского полка полковник Нильс Юлленштерна. В руках русских оказались 137 знамён и штандартов. 1-й министр короля [[Пипер, Карл|Карл Пипер]] с двумя государственными секретарями были взяты вылазкой Полтавского гарнизона.

            Одна дивизия Алларта захватила 22 стяга, в том числе 6 знамён лейб-гвардии и 2 штандарта конногвардейцев и драгунов Ельма<ref name="Энглунд" />.

            Ещё звучали звуки боя, а Пётр I вновь построил свою армию и начал праздновать победу. Пленные шведские генералы были приглашены в праздничный шатёр; фельдмаршалу Реншильду и принцу Вюртембергскому были возвращены шпаги. За столом Пётр пил за верность и храбрость шведов и за здоровье своих учителей в ратном деле.

            === Преследование ===
            Уже вечером в день баталии царь Пётр отрядил в погоню 10 драгунских полков [[Баур, Родион Христианович|Р. Х. Баура]] и Семёновский лейб-гвардии полк [[Голицын, Михаил Михайлович|М. М. Голицына]], посаженный на лошадей. На следующий день в преследование включился [[Меншиков, Александр Данилович|А. Д. Меншиков]] с ротой лейб-шквадрона.

            Карл XII, пытаясь выиграть время, направил навстречу русским генерал-майора [[Мейерфельдт, Юхан Август|Ю. А. Мейерфельдта]] с посланием: министр Пипер наделялся правом вести переговоры о мире и об обмене военнопленными. Однако эта уловка задержала русских только на 2 часа.

            Вскоре остатки шведской армии были настигнуты русскими и блокированы у Переволочной. [[Капитуляция у Переволочны|Здесь на капитуляцию сдались]] 16 тысяч человек, в их числе 3 генерала (Левенгаупт, Крейц и Крузе), 11 полковников, 16 подполковников, 23 майора, 1 фельдцейхмейстер, 12 575 унтер-офицеров и рядовых, а также большое количество некомбатантов.

            Карл XII с Мазепой сумели бежать. Шведский король скрылся на территории [[Османская империя|Османской империи]] в [[Бендеры|Бендерах]]. Однако его отряд, направленный для установления связи со шведскими войсками в Польше генерала [[Крассов, Эрнст Дитлев фон|Крассова]], был разгромлен под Черновцами русским отрядом, а [[генерал-квартирмейстер]] [[Гилленкрок, Аксель|А. Гилленкрок]] попал в плен<ref>[http://www.battle.poltava.ua/russian/gyllenkrok.htm Полтавская битва. Аксель Юлленкрук.]</ref>.

            Вскоре после битвы начались многочисленные казни изменников-казаков<ref>П. Энглунд. Полтава: Рассказ о гибели одной армии. — М: Новое книжное обозрение, 1995. Глава 28. «Невозможно было взирать без слез»</ref>.

            == Потери сторон ==
            [[Файл:Church at Battelfield near Poltava.jpg|thumb|230px|Церковь на месте битвы]]
            Потери шведов в битве составили 9224 человека, в плен попали 2973 чел. (итого 12 197 чел.).

            Потери русских составили 1345 человек убитыми и 3290 ранеными. В [[Братская могила русских воинов павших в Полтавской битве|братской могиле под Полтавой]] «Погребены бригадир [[Феленгейм, Иван Самуилович фон|Феленгейм]], полковники Нечаев и Лов, подполковник Козлов, майоры Кропотов, Эрнст и Гельд, обер-офицеров 45, капралов и рядовых 1293, всего погребено 1345 человек».

            Ранение получили генерал-лейтенант [[Ренне, Карл Эвальд|К. Э. Ренне]], бригадир [[Полонский, Яков Васильевич|Я. Полонский]], 5 полковников, 11 штаб- и 94 обер-офицеров<ref name="Лексикон" />.

            == Итоги ==
            В результате Полтавской битвы армия короля [[Карл XII|Карла XII]] была настолько обескровлена, что уже не могла вести активных наступательных действий. Военное могущество Швеции было подорвано, и в [[Великая Северная война|Северной войне]] произошёл перелом в пользу [[Россия|России]]. На встрече с саксонским курфюрстом [[Август II|Августом II]] в [[Торунь|Торуни]] был вновь заключен [[Торуньский союзный договор|военный союз]] [[Саксония (курфюршество)|Саксонии]] с Россией. Датский король также вновь выступил против Швеции, причём теперь, благодаря приобретенному авторитету, России это не стоило ни денежных субсидий, ни посылки воинского контингента.

            === Награждения ===
            За одержанную победу были награждены не только военные, но и гражданские лица<ref name="Куракин" />:
            * [[Пётр I]] объявлен был «первым генерал-лейтенантом» и [[шаутбенахт]]ом «от синего флага».
            * Генерал-фельдмаршал [[Шереметев, Борис Петрович|Б. П. Шереметев]] одарён поместьями. Кроме него, поместья получили генералы [[Баур, Родион Христианович|Р. Х. Баур]], [[Голицын, Михаил Михайлович|М. М. Голицын]], [[Гейнскин, Иоганн|И. Гейнскин]] и [[Волконский, Григорий Семёнович (1721)|Г. С. Волконский]].
            * [[Меншиков, Александр Данилович|А. Д. Меншиков]] был наименован вторым [[генерал-фельдмаршал (Россия)|генерал-фельдмаршалом]].
            * [[Ренне, Карл Эвальд|К. Э. Ренне]] получил чин [[генерал от кавалерии|генерала от кавалерии]].
            * генералы [[Репнин, Аникита Иванович|А. И. Репнин]], [[Алларт, Людвиг Николай|Л. Н. Алларт]], [[Ренцель, Самуил|С. Ренцель]] и [[Брюс, Яков Вилимович|Я. В. Брюс]] награждены [[орден Святого Андрея Первозванного|орденом Святого Андрея Первозванного]]. Этим же орденом и чином тайного советника (геемрата) награждён князь [[Долгоруков, Григорий Фёдорович|Г. Ф. Долгоруков]].
            * [[Головкин, Гавриил Иванович|Г. И. Головкин]] получил чин [[канцлер]]а, [[Шафиров, Пётр Павлович|П. П. Шафиров]] — подканцлера (вице-канцлера), [[Мусин-Пушкин, Иван Алексеевич (1659)|И. А. Мусин-Пушкин]] — тайного советника (геемрата).
            * [[Верден, Николай Григорьевич|Н. Г. фон Верден]] стал генерал-лейтенантом.
            * Бук, Алексей Головин, [[Келин, Алексей Степанович|А. С. Келин]], [[Айгустов, Савва Васильевич|С. В. Айгустов]], [[Шидловский, Фёдор Владимирович|Ф. М. Шидловский]], [[Полонский, Яков Васильевич|Я. В. Полонский]], [[Долгоруков, Василий Владимирович|В. В. Долгоруков]], а позже [[Вейсбах, Иоганн Бернгард|И. Б. Вейсбах]] сделаны генерал-майорами.
            * [[Головин, Иван Михайлович|Иван Головин]], [[Чернышёв, Григорий Петрович|Г. П. Чернышев]], [[Бон, Герман Иоганн де|Г. Бон]], [[Кропотов, Гаврила Семёнович|Г. С. Кропотов]] и генерал-адъютант {{Нет АИ 2|[[Чириковы|Л. С. Чириков]]|28|02|2016}} произведены в [[бригадир]]ы.
            В честь битвы были выбиты [[Медаль «За Полтавскую баталию»|медали]] для всех офицеров и солдат, участвовавших в ней.

            === [[Триумф]] ===
            Пленные вначале содержались в крепости [[Ломоносов (город)|Ораниенбаум]], затем перевезены в [[Москва|Москву]], где {{СС|1|января|1710 года|21|декабря|1709 года}} прошли по улицам столицы при торжественном въезде Петра I. В этот день по русской столице провели огромное количество военнопленных — 22 085 шведов, финнов, немцев и других, взятых за 9 лет войны<ref>
            [http://www.russkie.org/index.php?module=fullitem&id=17343 В. Шестаков. «Полтавский парад» в Москве.]</ref>.

            Как утверждает историк [[Артамонов, Владимир Алексеевич|В. А. Артамонов]], ''«Полтавская победа была самым блистательным триумфом петровского времени. Пётр I законно гордился главной битвой своей жизни. „В свете неслыханная виктория“, „русское воскресение“, „начало нашего спасения и благополучия“ — так именовал он её»''<ref name="Павленко"/>.

            == Интересные факты ==
            * На поле битвы остались 22 представителя рода [[Врангели|Врангелей]].
            * 8 июля всех пленных шведов опрашивали на предмет поступления на службу царю. В русской армии сформировали два пехотных полка из шведских военнопленных (стояли в Астрахани и Казани). Драгунский полк из шведов участвовал в экспедиции [[Бекович]]а в Хиву в [[1717 год]]у.
            * Из 23 тысяч шведских военнопленных, взятых под Полтавой и Переволочной, лишь около 4000 снова увидели родину. В некоторых полках, которые начали военную кампанию с тысячным составом, возвратились домой около десятка человек. Ещё в 1729 году, через восемь лет после окончания войны и через двадцать лет после Полтавы, в Швецию продолжали приезжать бывшие пленные. Едва ли не самым последним среди них стал гвардеец Ханс Аппельман: он вернулся в 1745 году, после 36 лет плена<ref name="Энглунд" />.

            == Мифы Полтавской битвы ==
            Мифотворчество вокруг Полтавской битвы началось вскоре после её окончания. Литературной обработке подверглась речь Петра перед баталией. Так, известный текст: «''Воины! Вот пришёл час, который решит судьбу Отечества. Итак, не должны помышлять, что сражаетесь за Петра, но за государство, Петру вручённое, за род свой, за Отечество. А о Петре ведайте, что ему жизнь не дорога, только бы жила Россия, благочестие, слава и благосостояние её''», — скорее всего, имеет более позднее происхождение (возможно, обработан [[Феофан Прокопович|Феофаном Прокоповичем]]). Реальная речь была иной и более обыденной: «''Делайте, братия, так, как я буду делать, и всё, помощию Всевышнего, будет добро. За победою, после трудов, воспоследует покой''»<ref name="Анисимов">Е. Анисимов. Миф Великой Виктории. // Родина. № 7. 2009.</ref>.

            Пуля, попавшая Петру в шляпу, в мифе превратились в три пули, попавшие в шляпу, седло и нательный крест Петра (последнее призвано сакрализировать участие Петра в битве).

            Некоторые мифы были сотворены литератором середины XVIII века [[Крёкшин, Пётр Никифорович|П. Н. Крёкшиным]], который при описании истории Петра I дополнил известные факты собственными домыслами. Сочинения Крекшина были использованы И. И. Голиковым в своей истории Петра, откуда вымыслы перекочевали в научную историческую литературу, включая произведения [[Тарле, Евгений Викторович|Е. В. Тарле]] и современных историков. В числе мифов, созданных Крекшиным<ref>П. А. Кротов Сотворение Полтавской легенды // Родина. № 7. 2009.</ref>:
            * Про переодевание солдат Новгородского полка: будто бы Пётр I использовал тактическую уловку и незадолго до битвы переодел опытных солдат Новгородского пехотного полка в неокрашенную форму молодых. Карл XII, зная от перебежчика о том, что форма опытных бойцов отличается от формы молодых, повёл своё войско на молодых бойцов и попал в ловушку.
            * Про прорыв линии 1-го батальона Новгородского полка и спасение Петром баталии за счёт ввода в бой 2-го батальона. — В походном журнале Петра I указано, что вторая линия русской пехоты в бой не вступала.
            * Про торжественный въезд Петра I в Полтаву на следующий день после битвы и отдание им чести коменданту А. С. Келину. — Согласно походному журналу, царь въехал в Полтаву только в ночь на 30 июня, а наутро отбыл к Переволочной.
            * Участие 2,6 тысяч вооружённых горожан Полтавы в отражении осады не подтверждается ни русскими, ни шведскими источниками и также, скорее всего, является плодом фантазии Крекшина.

            == Карты ==
            {{external media
             |topic    =
             |subtopic =
             |width    =
             |image1   = [http://img.encyc.yandex.net/illustrations/bse/pictures/02013/811770.jpg Схема Полтавской битвы из БСЭ] Показаны действия русских войск с момента попытки освобождения Полтавы из-за Ворсклы и до окончания Полтавского сражения.
             |audio1   =
             |video1   =
            }}

            <center><gallery perrow=5 widths=160 heights=160 caption="Этапы Полтавской битвы по Шведской Википедии:">
            Файл:poltava_inledning.png|<small>Развертывание и наступление</small>
            Файл:poltava_skanslinjen1.png|<small>Первая атака на редуты</small>
            Файл:poltava_skanslinjen2.png|<small>Прорыв сквозь линию редутов - 1</small>
            Файл:poltava_skanslinjen3.png|<small>Прорыв сквозь линию редутов - 2</small>
            Файл:poltava_skanslinjen4.png|<small>Группа Рооса теряет контакт с основной армией</small>
            Файл:poltava_manövrer5.png|<small>Шведская армия сместилась на север. Группа Рооса разбита</small>
            Файл:poltava_slutstriden1.png|<small>Последующее сражение</small>
            Файл:poltava_slutstriden2.png|<small>Последняя атака</small>
            Файл:poltava_reträtten.png|<small>Отступление шведов</small>
            </gallery></center>

            == Память о событии ==
            [[Файл:Музей-заповедник Поле Полтавской битвы.jpg|thumb|260px|Музей-заповедник «Поле Полтавской битвы»]]
            Вскоре после победы, в декабре 1709 года, Пётр I заложил в [[Санкт-Петербург]]е [[Полтава (линейный корабль, 1712)|линейный корабль «Полтава»]] (позже имя «Полтава» носили ещё несколько боевых кораблей русского флота); в 1710 году там же в Санкт-Петербурге в честь битвы, состоявшейся в день святого Сампсония Странноприимца, построена Сампсониевская церковь (позже перестроена в [[Сампсониевский собор]]).

            К 25-летнему юбилею битвы в [[1735 год]]у в [[Петергоф]]е была установлена скульптурная группа «[[Самсон, разрывающий пасть льву]]», созданная по проекту [[Растрелли, Бартоломео Карло|Карло Растрелли]]. Лев ассоциировался со Швецией, герб которой содержит этого геральдического зверя.

            Само поле Полтавской битвы длительное время никак не отмечалось. Хотя Пётр распорядился построить на месте сражения мужской монастырь и воздвигнуть каменную пирамиду, однако в условиях военного времени ограничились деревянным крестом. Первый памятник на поле битвы построен частным лицом в [[1778 год]]у на месте гибели его отца<ref name="Анисимов" />. И только в [[1852 год]]у там же заложена [[Сампсониевская церковь]].

            Несмотря на то, что первое празднование победы под Полтавой в России состоялось уже в 1710 году, а с 1739 года день Полтавской битвы формально считался праздничным, отмечали его лишь эпизодически<ref name="kamensky"/>. Накануне войны с Турцией в [[1787 год]]у [[Потёмкин, Григорий Александрович|Г. А. Потёмкин]] устроил для [[Екатерина II|Екатерины II]] грандиозные манёвры на Полтавском поле, воспроизводя события битвы. Следующие «мемориальные манёвры» провёл император [[Александр I]] в [[1817 год]]у<ref>[http://histpol.pl.ua/ru/poltava-istoricheskie-ocherki/istoricheskie-ocherki/3856-zapiski-o-poltave-i-ee-pamyatnikakh В. Е. Бучневич. Записки о Полтаве и её памятниках. — Полтава. 1902.]</ref>. В 1812 году, во время [[Отечественная война|Отечественной войны]], он же в манифесте напомнил российской армии о победе под Полтавой<ref name="kamensky"/>.

            Крупное празднование было организовано к 200-летию Полтавской битвы в [[1909 год]]у: учреждена [[медаль «В память 200-летия Полтавской битвы»]], на месте битвы основан музей-заповедник «[[Поле Полтавской битвы]]» (ныне Национальный музей-заповедник), на территории которого построен музей, установлены памятники [[Пётр I|Петру I]], русским и шведским воинам, на месте лагеря Петра I и другие.

            При Советской власти о Полтаве надолго забыли. В [[1939 год]]у попытка отметить 230-летний юбилей ограничилась ремонтом памятников на поле битвы. Только в [[1950 год]]у был открыт музей истории Полтавской битвы; в 1981 году, при подготовке к 275-летию битвы, Полтавское поле объявлено государственным историко-культурным заповедником. Советская историография с конца 1930-х годов рассматривала Полтавскую битву в ключе пропаганды патриотизма и мифа о непобедимости России и русской армии, часто увязывая её со сражениями [[отечественная война 1812 года|Отечественной]] и [[Великая Отечественная война|Великой Отечественной войн]], а также с послевоенной советской национальной политикой; так, в официальном буклете музея, выпущенном в 1954 году, Полтавская битва характеризуется как «общая победа русского, украинского и белорусского народов» и, в частности, русской армии. При этом советское правительство запрещало контакты сотрудников заповедника со шведской стороной.<ref>Jörg-Peter Findeisen. Poltava — Mythos und Wirklichkeit. Einige kritische Anmerkungen zur bisherigen Darstellung dieser welthistorischen Schlacht durch die sowjetische Militärhistoriographie // Militärgeschichtliche Zeitschrift. — Bd. 51 (1992). — H. 1. — S. 1—2.{{Ref-de}}</ref><ref name="hausmann">[http://chtyvo.org.ua/authors/Guido_Hausmann/Poltava_2009_Deimperializing_an_Imperial_Site_of_Memory_anhl/ Guido Hausmann. Poltava 2009: Deimperializing an Imperial Site of Memory] // Harvard Ukrainian Studies. — Vol. 31. — No. 1/4: Poltava 1709: The Battle and the Myth. — PP. 657—677.</ref>

            10 февраля 1995 года был принят Федеральный закон Российской Федерации «О днях воинской славы и памятных датах России». Согласно ему среди дней воинской славы России — 10 июля — День победы русской армии под командованием Петра Первого над шведами в Полтавском сражении (1709 год).

            Есть противоположные мнения по поводу памяти Полтавской битвы. Так, по мнению историка [[Каменский, Александр Борисович|А. Б. Каменского]], несмотря на все усилия властей, битва в далекой [[Гетманщина|Гетманщине]] так и не заняла места в коллективной памяти русского народа. Историк отмечает, что даже мемуаров военных, участвовавших в Полтавской битве, не осталось, а оценивая эпоху Петра, российские мыслители XIX века (за исключением [[Вяземский, Пётр Андреевич|Петра Вяземского]], пытавшегося сделать слово «Полтава» символом всех российских военных побед) редко обращали внимание на Полтавскую битву<ref name="kamensky">[http://www.reenactor.ru/ARH/PDF/Kamenskiy_00.pdf Alexander Kamenskii. The Battle of Poltava in Russian Historical Memory // Harvard Ukrainian Studies. — Vol. 31. — No. 1/4: Poltava 1709: The Battle And The Myth (2009—2010). — PP. 195—204.]{{Ref-en}}</ref>.

            В свою очередь, историк [[Павленко, Николай Иванович|Н. И. Павленко]] писал: ''"Северная война на века сохранилась в народной памяти. От того времени осталось немало песен, посвященных отдельным эпизодам долголетней эпопеи… но центральное место среди них занимает Полтавская баталия… Выразительнее и лаконичнее всего происшедшее под Полтавой передает пословица, имеющая хождение и в наши дни: «Пропал, как швед под Полтавой»''<ref name="Павленко">Павленко Н. И., Артамонов В. А. 27 июня 1709 — М.: Молодая гвардия, 1989. — 270[2] с., ил.</ref>.

            Историк Гидо Хаусманн характеризует Полтаву как «имперское [[место памяти]]» для России, отмечая, что в концепции Полтавского историко-культурного заповедника украинская и шведская точки зрения представлены в недостаточной степени. В 2009 году, в день 300-летия битвы, состоялось торжественное открытие на месте сражения Ротонды примирения, увековечивающей память погибших в Полтавском бою солдат всех армий. Однако планы украинского правительства воздвигнуть рядом с памятником Петру I монументы Карлу XII и Ивану Мазепе посол РФ на Украине [[Черномырдин, Виктор Степанович|Виктор Черномырдин]] сравнил с гипотетическим памятником Гитлеру.<ref name="hausmann"/><ref name="gerner"/>.

            В шведской исторической памяти Полтавская битва характеризуется преимущественно положительно как ознаменовавшая окончание для Шведского королевства эпохи империализма и превращение Швеции в «обычное малое европейское государство»<ref name="gerner">Kristian Gerner. The Battle of Poltava as a Realm of Memory and a Bone of Contention // Harvard Ukrainian Studies. — Vol. 31. — No. 1/4: Poltava 1709: The Battle And The Myth (2009—2010). — PP. 679—693.</ref>.

            Русский мыслитель XIX века [[В. Г. Белинский]] высоко оценивал значение Полтавской битвы: «Россия громами Полтавской битвы возвестила миру о своем приобщении к европейской жизни, о своем вступлении на поприще всемирно-исторического существования»<ref> В. Г. Белинский Полное собрание сочинений: в 13 т. — М.: Изд-во АН СССР, 1953—1959.</ref>.""",
        'type': ['battle', 'сражение']
    },
    {
        'name': 'nishtadt_peace_treaty',
        'label': 'Ништадтский мир',
        'description': """
            '''Ништа́дтский мир''' ({{lang-sv|Freden i Nystad}}) — [[мирный договор]] между [[Русское царство|Русским царством]] и [[Шведская империя|Шведской империей]], завершивший [[Северная война|Северную войну]] 1700—1721 годов. Подписан {{OldStyleDate|10|сентября|1721 год|30|августа}}а в городе Ништадт (ныне [[Уусикаупунки]], [[Финляндия]]). Был подписан со стороны [[Русское царство|России]] [[Брюс, Яков Вилимович|Я. В. Брюсом]] и [[Остерман, Андрей Иванович|А. И. Остерманом]], со стороны [[Швеция|Швеции]] — [[Лилльенстедт, Юхан|Ю. Лилльенстедтом]] и [[Стрёмфельд, Отто Рейнхольд|О. Стрёмфельдом]] ({{lang-sv|[[:sv:Otto Reinhold Strömfelt|Otto Reinhold Strömfelt]]}}).

            Договор изменил русско-шведскую границу, ранее закреплённую [[Столбовский мир|Столбовским мирным договором]] от [[1617 год]]а. Швеция признала присоединение к России [[Лифляндия|Лифляндии]], [[Эстляндия|Эстляндии]], [[Ингерманландия|Ингерманландии]], части [[Карелия|Карелии]] (т. н. [[Старая Финляндия|Старой Финляндии]]) и других территорий<ref name="nis">[http://www.hrono.ru/dokum/1700dok/1721nishtadt.php Ништадтский мирный договор между Россией и Швецией. Русский текст.]</ref>. Россия обязалась уплатить Швеции денежную компенсацию и возвратить [[Финляндия|Финляндию]].

            Ратифицирован {{СС|20|сентября||9}}. 10 сентября [[1721 год]]а в [[Москва|Москве]] были устроены торжества по случаю Ништадтского мира. Победа в Северной войне выдвинула{{нет АИ|6|07|2015}} Россию в число крупнейших европейских государств.""",
        'info': None,
        'weight': 1,
        'coordinates': [60.4700, 21.2500],
        'start_date': '1721-09-10',  # 10 сентября 1721 года
        'end_date': '1721-09-10',  # 10 сентября 1721 года
        'text':
            """
                == История ==
            Победами русского оружия в конце Северной войны решили воспользоваться [[Англия]], [[Ганновер]], [[Нидерланды|Голландия]] и [[Дания]], заключившие союз с [[Пётр I|Петром I]] против Швеции. В действительности же Англия и Голландия не желали полного поражения Швеции и усиления России на [[Балтийское море|Балтике]]. Это привело к распаду коалиции и заключению [[4 августа]] [[1717 год]]у союзного договора с [[Франция|Францией]]: [[Париж]] обещал [[посредничество]] в переговорах с Швецией, истощённой до предела длительной войной. [[12 мая]] [[1718 год]]а открылся [[Аландский конгресс]] — на одном из [[Аландские острова|Аландских островов]]. Со стороны России переговоры возглавили [[Брюс, Яков Вилимович|Яков Брюс]] и [[Остерман, Андрей Иванович|Андрей Остерман]]. Однако, надеясь на помощь Англии, шведы всячески их затягивали. Кроме того, после гибели [[Карл XII|Карла XII]] в 1718 году к власти в Швеции пришла [[Реваншизм|реваншистская]] группировка королевы [[Ульрика Элеонора|Ульрики Элеоноры]], выступавшая за сближение с Англией и продолжение военных действий.

            В [[1719 год]]у под воздействием английской дипломатии была организована коалиция европейских государств против России. В её состав вошли [[Австрия]], [[Саксония (курфюршество)|Саксония]] и Ганновер. Англия обещала военную и финансовую помощь шведам. Переговоры на Аландском конгрессе были прекращены. В 1719 году русский флот [[Эзельский бой|победил шведов]] у острова [[Эзель]], а в [[1720 год|1720]] — у острова [[Гренгам]] ([[Сражение при Гренгаме]]). Англия вынуждена была отозвать свою эскадру из Балтики. В 1719—1720 годах были проведены [[Десанты на побережье Швеции (1719)|три успешных десантных операции]] на территории Швеции. Всё это вынудило шведов в мае 1721 года в Ништадте возобновить переговоры. 30 августа (по ст. стилю) 1721 года мирный договор был подписан.

            == Условия договора ==
            [[Файл:Летний сад-Скульптурная группа- (Мир и Победа. Ништадский мир) (До) (001).jpg|right|thumb|Скульптурная группа П.Баратта Ништадский мир (Летний сад, Петербург)]]
            [[Файл:Finland Russian&Sweden Border.png|250px|мини|справа|Карта Финляндии с указанием границ России и Швеции в разное время по договорам, а также по картам генерального штаба, Гермелина, Лоттера, Аф-Кнорринга и друг. Ордин, Кесарь Филиппович «Покорение Финляндии. Опыт описания по неизданным источникам». Том I. — СПб: Тип. И. Н. Скороходова, 1889]]
            Договор состоял из преамбулы и 24 статей. По договору Россия закрепила выход к [[Балтийское море|Балтийскому морю]]: к ней отошли часть Карелии к северу от [[Ладожское озеро|Ладожского озера]], [[Ингерманландия]] от Ладоги до [[Нарва (река)|Нарвы]], часть [[Эстляндия|Эстляндии]] с [[Таллин|Ревелем]], часть [[Лифляндия|Лифляндии]] с [[Рига|Ригой]], острова [[Сааремаа|Эзель]] и [[Хийумаа|Даго]]. За эти земли Россия выплатила Швеции компенсацию в 2 млн [[ефимок|ефимков]] (1,3 млн рублей). Предусматривался обмен пленными<ref name="bse2-30">Большая Советская Энциклопедия. Гл. ред. Б. А. Введенский, 2-е изд. Т. 30. Николаев — Олонки. 1954. 656 стр., илл. и карты; 52 л. илл. и карт.</ref>, амнистия «преступникам и перебежчикам» (кроме сторонников [[Мазепа, Иван Степанович|Ивана Мазепы]]). Финляндия возвращалась Швеции, которая также получила право ежегодно беспошлинно закупать и вывозить из России хлеба на 50 тыс. рублей. Договор подтверждал все привилегии, предоставленные остзейскому дворянству шведским правительством: дворянство сохранило своё самоуправление, сословные органы и т. д.

            Основные положения договора<ref>''Балязин В. Н.'' Неофициальная история России. — М.: Олма Медиа Групп, 2007. — ISBN 978-5-373-01229-4 </ref>:

            # Вечный и неразрывный мир между царём русским и королем шведским и их преемниками;
            # Полная амнистия с обеих сторон, за исключением [[Казачество|казаков]], последовавших за [[Мазепа|Мазепой]];
            # Все действия прекращаются в 14-дневный срок;
            # Шведы уступают во вечное владение России: [[Лифляндия|Лифляндию]], [[Эстляндия|Эстляндию]], [[Ингерманландия|Ингерманландию]], часть [[Карелия|Карелии]]<ref name="nis"/>;
            # Швеции возвращается [[Финляндия]];
            # Исповедание веры на данных территориях свободно.

            == Результаты ==
            Россия стала{{нет АИ|6|07|2015}} великой европейской державой, в ознаменование чего 22 октября ([[2 ноября]]) [[1721 год]]а [[Пётр I]] по прошению сенаторов принял титул '''Отца Отечества, [[Император Всероссийский|Императора Всероссийского]], Петра Великого'''.""",
        'type': ['peace_treaty', 'мирный договор']
    }
]
